{"category_name":"medium","status":"success","problem_code":"AMDRUNK","problem_name":"Drunk Man in Large City","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>\nA city consists of <b>n<\/b> junctions that are connected by <b>m<\/b> bidirectional roads. The junctions are numbered from 1 to <b>n<\/b>. It is known that each junction has at least two roads incident on it. Also, one can walk from any junction to any other junction using these roads. Moreover, no pair of junctions is connected by more than one road.\n<\/p>\n\n<p>A very drunk man has just walked out of a bar which is situated at junction <b>s<\/b> and wants to get to his home which is located at junction <b>t<\/b>. His current junction is <b>s<\/b>. In every minute the following happens:\n<\/p>\n<p>\n<ul>\n\t<li>Step 1: He rationally thinks and chooses one of the roads incident on the current junction and walks along this road.<\/li>\n\t<li>Step 2: If he reaches the junction <b>t<\/b>, he immediately gets home and goes to sleep.<\/li>\n\t<li>Step 3: Otherwise, influenced by the desire for adventure, he picks some random road incident on the current junction and walks along this road. The only limitation is that he never picks the road he used to get to this junction at the beginning of the current minute (ie. in Step 1 of this minute).<\/li>\n\t<li>Step 4: Now, if he has reached junction <b>t<\/b>, he sees his home and goes there directly and sleeps.<\/li>\n<li>Step 5: If not, then we go to the next minute, and this repeats.<\/li>\n<\/ul>\n<\/p>\n\n<p>\nGiven a description of the city and indices of junctions <b>s<\/b> and <b>t<\/b> you have to compute whether the drunk man will surely get home in a finite number of minutes, if he makes optimal choices in all the Step 1's. If so, what is the minimum number of minutes <b>x<\/b>, such that the man can get home in no more than <b>x<\/b> minutes whatever his random choices at step 3 of each minute are. That is, what is the minimum <b>x<\/b>, such that there is a strategy which the man can follow in his Step 1 choices, so that no matter what adversarial choice he makes in the Step 3's, he is guaranteed to reach his home within <b>x<\/b> minutes?\n<\/p>\n\n\n<h3>Input<\/h3>\n<ul>\n\t<li>The first line of the input contains a single integer <b>T<\/b>  — the number of test cases in this input. Then follow <b>T<\/b> descriptions of individual test cases.<\/li>\n\t<li>The first line of the input contains four integers <b>n<\/b>, <b>m<\/b>, <b>s<\/b> and <b>t<\/b>  — the number of intersections and the number of roads in the city, the index of the intersection where the bar is located and the index of the intersection where the drunk man's house is, respectively.<\/li>\n\t<li>The i<sup>th<\/sup> of the following <b>m<\/b> lines contains two integers <b>u<sub>i<\/sub><\/b> and <b>v<sub>i<\/sub><\/b>  — indices of the junctions connected by the i<sup>th<\/sup> road.<\/li>\n<\/ul>\n\n<h3>Output<\/h3>\n<ul>\n\t<li>If there is no strategy for him to reach home definitely, output -1 in a new line.<\/li>\n<li>Otherwise, print how many minutes the drunk man needs to get home in the worst possible scenario if he always behaves optimally in the Step 1 of every minute.<\/li>\n<\/ul>\n\n\n<h3>Constraints<\/h3>\n<ul>\n\t<li>1 ≤ <b>T<\/b> ≤ 100000<\/li>\n\t<li>3 ≤ <b>n<\/b>, <b>m<\/b> ≤ 300000<\/li>\n\t<li>1 ≤ <b>s<\/b>, <b>t<\/b> ≤ <b>n<\/b><\/li>\n\t<li><b>s<\/b> ≠ <b>t<\/b><\/li>\n\t<li>1 ≤ <b>u<sub>i<\/sub><\/b>, <b>v<sub>i<\/sub><\/b> ≤ <b>n<\/b><\/li>\n\t<li><b>u<sub>i<\/sub><\/b> ≠ <b>v<sub>i<\/sub><\/b><\/li>\n\t<li> It is guaranteed that it is possible to get from any junction to any other junction moving along the roads, each junction has at least two incident roads and no two roads connect the same pair of junctions.<\/li>\n\t<li>It is guaranteed that both the total number of intersections and the total number of roads over all test cases in one input file won't exceed 1000000<\/li\n<\/ul>\n\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n2\n4 5 1 2\n1 3\n1 4\n3 4\n2 4\n2 3\n6 9 1 6\n1 2\n1 3\n2 3\n2 4\n2 5\n3 4\n3 5\n4 6\n5 6\n\n<b>Output:<\/b>\n2\n-1\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>Testcase 1<\/b>: Consider the strategy where the drunk man first moves to junction 3 in Step 1 of the first minute. Then in Step 3 of the first minute, he randomly picks the road to junction 2 or the road to junction 4. In case he had picked the road to junction 2, he reaches home in just 1 minute. If not, he ends up at junction 4 at the end of the first minute. Then, in Step 1 of the second minute, he picks the road between 4 and 2, and goes to junction 2, thus reaching his home in the second minute. Thus, no matter what random choices he makes in the Step 3's, he is guaranteed to reach his house within the first two minutes.<\/p>\n\n<p><b>Testcase 2<\/b>: You can show that in the worst case, the drunk man will could be stuck between among the junctions {1, 2, 3, 4, 5} forever.<\/p>","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5","max_timelimit":"8","source_sizelimit":"50000","problem_author":"balajiganapath","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>balajiganapath<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"21-12-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/balajiganapath'>balajiganapath<\/a>","time":{"view_start_date":1517693400,"submit_start_date":1517693400,"visible_start_date":1517693400,"end_date":1735669800,"current":1525198948},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}