{"category_name":"medium","status":"success","problem_code":"ARIGEOM","problem_name":"Arigeom Beats","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Our amazing Chef recently met his best friend Joe at his place. Joe is a musician and owns a wide variety of musical instruments. He got introduced to the Arigeom beats in a music training session at Los Angeles. Arigeom beats, as the name suggests, is a combination of two series of beats. One of them has all its frequencies in <a href=\"http:\/\/en.wikipedia.org\/wiki\/Arithmetic_progression\">arithmetic progression<\/a> while the other series of beats has all its frequencies in <a href=\"http:\/\/en.wikipedia.org\/wiki\/Geometric_progression\">geometric progression<\/a>.<\/p>\n<p>A series of beats is represented by a beat notation, which is the sequence of the frequencies at which the beats are played.<\/p>\n<p>To play Arigeom beats, two digital musical instruments are played simultaneously in front of an instrument known as Sono Phone. One instrument plays the beats in arithmetic progression while the other instrument plays the beats in geometric progression. Sono Phone will capture the beats played by each of the two instruments and process them into Arigeom beats. It will merge the beats, sort the beats in ascending order, and remove duplicate beats.<\/p>\n<p>For example, suppose one instruments plays the following beats notation: (2, 5, 8, 11), an arithmetic progression, while the other plays (2, 4, 8, 16), a geometric progression. The resulting Arigeom beat notation recorded by Sono Phone will be (2, 4, 5, 8, 11, 16).<\/p>\n<p>Because Joe knows how to play Arigeom beats, owns the instruments, and has his friend Chef with him as well, he can't wait anymore to play the beats. Joe has an Arigeom beat notation from his music book and decides that he would play the beats in arithmetic progression while Chef will play the beats in geometric progression. The beat notation consists of <b>N<\/b> beat frequencies <b>F<sub>1<\/sub><\/b>, <b>F<sub>2<\/sub><\/b>, ..., <b>F<sub>N<\/sub><\/b>. However, he is now confused as to which subset of the beats has to be played by Chef and which one by himself.<\/p>\n<p>Help Joe and Chef figure out the subsets of beats to be played by Joe and Chef.<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains a single integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows. For each test case, the first line contains an integer <b>N<\/b>. The second line contains <b>N<\/b> space-separated integers <b>F<sub>1<\/sub><\/b>, <b>F<sub>2<\/sub><\/b>, ..., <b>F<sub>N<\/sub><\/b>.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output two lines. The first line contain the beat notation to be played by Joe (in arithmetic progression). The second line contain the beat notation to be played by Chef (in geometric progression). Each beat notation must contain at least two beats. The beats in each beat notation must be sorted in ascending order.<\/p>\n<p>If there are more than one possible pair of beat notations, output any one of them.<\/p>\n<h3>Constraints<\/h3>\n<p>\n1 ≤ <b>T<\/b> ≤ 100<br \/> 2 ≤ <b>N<\/b> ≤ 10,000<br \/> 1 ≤ <b>F<sub>i<\/sub><\/b> ≤ 100,000<br \/><b>F<sub>1<\/sub><\/b> &lt; <b>F<sub>2<\/sub><\/b> &lt; ... &lt; <b>F<sub>N<\/sub><\/b><br \/>It is guaranteed that at least one pair of valid beat notations exists.\n<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n4<br\/>6<br\/>2 4 5 8 11 16<br\/>5<br\/>1 2 3 4 5<br\/>8<br\/>1 3 9 10 19 27 28 81<br\/>6<br\/>1 4 7 10 13 25<br\/>\n\n<b>Output:<\/b>\n2 5 8 11<br\/>2 4 8 16<br\/>1 2 3 4 5<br\/>1 2 4<br\/>1 10 19 28<br\/>1 3 9 27 81<br\/>1 7 13<br\/>4 10 25<br\/><br\/>\n<\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/pre><h3>Note<\/h3>\n<p>In last example, the common ratio is 2.5 (<b>non-integer<\/b>) even when all the elements of geometric progression sequence are integers.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"0.5","source_sizelimit":"50000","problem_author":"ankul_iiita","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #1E7D22;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>2&#9733;<\/span><span>ankul_iiita<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"29-08-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/ankul_iiita'>\n                    ankul_iiita\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/dec12'>\n                    dec12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/medium'>\n                    medium\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple-math'>\n                    simple-math\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/ARIGEOM","user":{"username":null},"time":{"view_start_date":1355220912,"submit_start_date":1355220912,"visible_start_date":1355218200,"end_date":1735669800,"current":1493557485},"todo":false,"problem_status":"unattempted"}