{"body":"\n<h3> All submissions for this problem are available. <\/h3>\n<p><b>This problem was part of the <a href=\"http:\/\/www.codechef.com\/APRIL09\/\">CodeChef April Challenge<\/a>.  All user submissions for this contest problem are publicly available <a href=\"http:\/\/www.codechef.com\/APRIL09\/status\/B1\/\">here<\/a>.<\/b><\/p>\n<p>Spaghetti Monsters have stolen The Chef&#8217;s golden spoon!  The Chef has a map, on which are marked: his location, the location of the golden spoon, and the locations of the spaghetti monsters. The map is in fact rectangular, consisting of square fields. Each field on the map, except for those adjacent to the boundary, is adjacent to 8 other fields -- fields which share a side or corner are assumed to be at a distance of 1 from each other, and it is possible to move between them directly. The Chef is a bit scared of spaghetti monsters and would prefer not to approach them too closely... Help him compute the minimum distance up to which he must approach some spaghetti monster, so as to find the golden spoon.<\/p>\n<h3>Input<\/h3>\n<p>The first line of input contains two numbers 1&lt;=n,m&lt;=1000, where n denotes the height of the map, and m its width.<br\/><br \/>\nThe map is given in the next n lines, each of which consists of m characters: <br\/><br \/>\nThe unique field represented by the character '@' is the location of The Chef. <br\/><br \/>\nThe unique field represented by the character '$' is the location of the golden spoon.<br\/><br \/>\nA field represented by the character 'D' is the location of a spaghetti monsters. <br\/><br \/>\nAll the remaining fields are represented by the character '.' and denote empty positions.<\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/p>\n<h3>Output<\/h3>\n<p>The output should contain exactly one number, equal to the minimum distance, at which The Chef must find himself from one of the spaghetti monsters in order to reach the golden spoon.<\/p>\n<h3>Example 1<\/h3>\n<pre>\n<tt>\n<b>Input:<\/b>\n7 5\n....$\n.....\n.....\nD...D\n.....\n.....\n@....\n\n<b>Output:<\/b>\n2\n<\/tt>\n<\/pre><h3>Example 2<\/h3>\n<pre>\n<tt>\n<b>Input:<\/b>\n7 5\n....$\n.....\n.....\nDDDDD\n.....\n.....\n@....\n\n<b>Output:<\/b>\n0\n<\/tt>\n<\/pre>    ","languages_supported":"NA","title":"B1","category":"NA","old_version":true,"problem_code":"B1"}