{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>The chef is a fan of candies with chocolate and caramel, and has devoted much of his life to finding the perfect ratio of chocolate to caramel. He recently discovered the perfect ratio, but to his dismay, none of his favourite candy shoppes sell candies with exactly that ratio. So the chef crafted a plan to buy several candies, and melt them together into a larger candy so that the resulting candy will have the perfect ratio. How many candies will he have to buy? The chef may buy multiple candies of the same type.<\/p>\n<h3>Input:<\/h3>\n<p>Input begins with an integer N, the number of different candies available at the various shoppes. N lines follow, each containing 2 integers Chocolate<sub>i<\/sub> and Caramel<sub>i<\/sub> indicating the grams of chocolate and caramel, respectively, contained in the (i)th candy. Finally, there is a line containing 2 integers desiredChocolate and desiredCaramel, indicating the chef's desired ratio of chocolate to caramel.<\/p>\n<h3>Output:<\/h3>\n<p>For each test case, output on a single line the minimum number of candies the chef will have to buy. If it is impossible to produce a candy with the desired ratio, output -1 instead.<\/p>\n<h3>Example<\/h3>\n<p><b>Input 1:<\/b><\/p>\n<pre>3\n4 5\n2 4\n4 1\n1 1\n <\/pre>\n<p> <\/p>\n<p><b>Output 1:<\/b><\/p>\n<pre>3\n <\/pre>\n<p> <\/p>\n<p>In this example, the chef purchases one of each candy and combines them to form a candy with 10 grams chocolate and 10 grams caramel.<\/p>\n<p><b>Input 2:<\/b><\/p>\n<pre>3\n2 3\n4 6\n10 15\n5 8\n <\/pre>\n<p> <\/p>\n<p><b>Output 2:<\/b><\/p>\n<pre>-1\n <\/pre>\n<p> <\/p>\n<h3>Constraints:<\/h3>\n<p>1 ≤ N ≤ 15<br \/> 1 ≤ Chocolate<sub>i<\/sub> ≤ 500<br \/> 1 ≤ Caramel<sub>i<\/sub> ≤ 500<br \/> 1 ≤ desiredChocolate ≤ 500<br \/> 1 ≤ desiredCaramel ≤ 500<br \/> For all candies, Chocolate<sub>i<\/sub>\/Caramel<sub>i<\/sub> ≠ desiredChocolate\/desiredCaramel<br \/> No two candies will be identical.<\/p>\n<p><\/p>    ","languages_supported":"NA","title":"CANDY","category":"NA","old_version":true,"problem_code":"CANDY"}