{"category_name":"medium","status":"success","problem_code":"CANDYGAM","problem_name":"Candy Collecting Game","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Alice and Bob have come to spend their day in a FunFair which is close to their house. They have played almost all games and seen all the attractions. But there's one game left which has caught their attention. The winner of this game could get a LOT of candies! The game is as follows:<\/p>\n<ul>\n<li> The game is a two-player game which is played on an <b>NxM<\/b> grid. <\/li>\n<p><\/p>\n<li> Each cell of the grid has a certain number of candies. <b>A[i][j]<\/b> denotes the number of candies in the <b>j<sup>th<\/sup><\/b> column of the <b>i<sup>th<\/sup><\/b> row. <\/li>\n<p><\/p>\n<li> The players make alternate turns. <\/li>\n<p><\/p>\n<li> In each turn, a player <i>must<\/i> remove one <i>complete row<\/i> or one <i>complete column<\/i> from the grid. He will add all the candies in that row\/column into his account. <\/li>\n<p><\/p>\n<li> The only possible rows that a player can remove in his\/her turn are the top row or the bottom row. Similarly, only leftmost column or the rightmost column can be removed in one turn. <\/li>\n<p><\/p>\n<li> After removing the row or column, the game is played on the new reduced grid with one less row or column respectively. <\/li>\n<p><\/p>\n<li> When the entire matrix is emptied, the player with higher number of candies wins the game and can take all those candies with him\/her. The loser has to give back the candies collected so far and return empty-handed. <\/li>\n<p><\/p>\n<li> If both players have equal number of candies, both of them are declared winners. <\/li>\n<p> \n<\/p><\/ul>\n<p>Alice and Bob want to take as many candies home as possible. They don't have much time with themselves. So they come up with a strategy using which they want to increase Bob's share of candies and decrease Alice's share. This way, they plan to make Bob win and take his entire share of candies! The strategy is as follows:<\/p>\n<ul>\n<li> Alice decides to pick the row or column from the present grid which has the <i>least<\/i> number of candies in every  turn of hers. <\/li>\n<p><\/p>\n<li> If there are more than one such options, then her order of preference will be:<br \/> 1) first row<br \/> 2) last row<br \/> 3) first column<br \/> 4) last column.<br \/> For example, if all these 4 rows\/columns have the same number of candies, she will remove the first row in this turn. <\/li>\n<p><\/p>\n<li> Bob chooses an optimal strategy through which he maximizes his share of candies in the end of the game. Note that Bob's strategy maximizes the number of his candies, not winner's candies. Also note that Bob knows Alice's strategy, of course, and he will take into account her strategy when he decides his move. <\/li>\n<p> \n<\/p><\/ul>\n<p>It's quite evident that their strategy is not optimal. It might happen that Bob loses a game. And sometimes, both might win (with equal number of candies). Given the grid and the number of candies in each cell, your task is to tell them how many candies will the winner get if they play with this combined strategy. Alice will always start the game (Ladies first!).<\/p>\n<h3>Input:<\/h3>\n<p>First line of the test data contains a single integer <b>T<\/b>, the number of test cases.<br \/> Each test case starts with two space separated integers <b>N<\/b> and <b>M<\/b>, the number of rows and columns of the grid respectively.<br \/> Then follow <b>N<\/b> lines containing <b>M<\/b> space separated integers <b>A[i][j]<\/b>. These lines describe the grid.<\/p>\n<h3>Output:<\/h3>\n<p>For each test case, output a single line containing the number of candies the winner(s) gets.<\/p>\n<h3>Constraints:<\/h3>\n<pre>1 ≤ <b>T<\/b> ≤ 25\n1 ≤ <b>N, M<\/b> ≤ 50\n0 ≤ <b>A[i][j]<\/b> ≤ 1000000000 \n\n<\/pre><p> <\/p>\n<h3>Example:<\/h3>\n<p><b>Input:<\/b><\/p>\n<pre>3\n3 3\n0 9 9\n0 6 6\n0 9 6\n2 2\n1 1\n1 1\n1 4\n1 2 3 4\n\n<\/pre><p><b>Output:<\/b><\/p>\n<pre>39\n4\n9\n\n<\/pre><p><b>Explanation:<\/b><br \/> <i>1<sup>st<\/sup> case:<\/i> Alice picks the first column (with all 0's). We're left with a 3x2 grid now. Bob picks the first column (9+6+9=24). We're left with a 3x1 grid. Alice picks the last row (6). A 2x1 grid is left. Bob picks the entire column (9+6=15). Thus, Bob has 24+15=39 candies and Alice has 6. So clearly, Bob is the winner.<br \/> <i>2<sup>nd<\/sup> case:<\/i> Here, both end up with two candies each. Hence both are the winners. Thus the winner(s) have 2+2=4 candies in all.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"4","source_sizelimit":"50000","problem_author":"vamsi_kavala","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>vamsi_kavala<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"28-08-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/dynamic-programming'>\n                    dynamic-programming\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/nov12'>\n                    nov12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/vamsi_kavala'>\n                    vamsi_kavala\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CANDYGAM","user":{"username":null},"time":{"view_start_date":1352712600,"submit_start_date":1352712600,"visible_start_date":1352712600,"end_date":1735669800,"current":1493557499},"todo":false,"problem_status":"unattempted"}