{"category_name":"medium","status":"success","problem_code":"COALSCAM","problem_name":"Coal Scam","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p style=\"text-align:justify\">Chef has entered the politics of Byteland. He is a minister in the coal department of the government. Recently, he has been assigned a project on constructing special bidirectional roads for transferring coals in such a way that the whole country is connected by a road network.<\/p>\n<p style=\"text-align:justify\">Different companies submitted their proposal of roads that they could build along with their estimated cost of the road. Chef has to select a subset of these proposed roads so that all cities of the country are connected.<\/p>\n<p style=\"text-align:justify\">Chef, corrupt as he is, managed to submit bids by his own company for certain roads. If some of his proposed roads are selected, he'd use low grade material. We can safely assume that the cost of building these roads is nothing to him. He would still receive the price he has quoted in the bid and hence, would make as much profit. He wants to choose some subset of proposed roads so that his own profit is maximised.<\/p>\n<p style=\"text-align:justify\">Byteland consists of N cities. There are M1 proposals to build roads by companies other than Chef's. Chef's company has proposed to build M2 roads. Chef wants to choose a subset of these roads in such a way that <b>for each pair of cities, there is exactly one path of roads connecting them<\/b>. The profit Chef will gain is equal to the sum of costs of the roads chosen from among those made by Chef's company.<\/p>\n<p style=\"text-align:justify\">Help Chef choose the roads in such a way that his profit is maximized. If there are multiple ways to achieve that, choose the way where the sum of costs of all chosen roads is minimized.<\/p>\n<h3>Input<\/h3>\n<p style=\"text-align:justify\">The first line of the input contains a number T, the number of test cases. This is followed by the input for each test case one by one. The first line of each test case contains three space-separated integers N, M1, and M2. Then M1 lines follow, each containing a description of a road proposed by other companies. Each of these lines contains three space-separated integers u, v, and c, where u and v denote the end points of the road and c denotes the associated cost. Then M2 lines follow, each containing a description of a road proposed by Chef's company in the same format.<\/p>\n<h3>Output<\/h3>\n<p style=\"text-align:justify\">Output a single line for each test case. If it is impossible to choose a subset of the roads in such a way that for each pair of cities, there is exactly one path of roads connecting them, output a single line containing \"Impossible\" (quotes for clarity and starts with an uppercase 'I') for that test case. Otherwise, output a single line containing two space-separated integers: the maximum profit Chef can gain and the minimum total cost of the chosen roads that yields the maximum profit.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n2\n3 2 1\n0 1 5\n1 2 4\n0 1 10\n3 1 1\n0 1 1\n0 1 3\n\n<b>Output:<\/b>\n10 14\nImpossible\n<\/pre><h3>Constraints<\/h3>\n<p>\n1 ≤ T ≤ 5<br \/>\n2 ≤ N ≤ 5,000<br \/>\n1 ≤ M1 ≤ 20,000<br \/>\n1 ≤ M2 ≤ 20,000<br \/>\nFor each proposed road, the end points will be two different cities.<br \/>\nThere may be several proposed roads between the same pair of cities.<br \/>\nFor each proposed road, 0 ≤ c ≤ 1,000,000,000<br \/>\nEach input file will not be larger than 4 MB (4,000,000,000 bytes) in size.\n<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"yellow_agony","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>yellow_agony<\/span>","problem_tester":"gamabunta","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #666666;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>1&#9733;<\/span><span>gamabunta<\/span>","date_added":"2-09-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/cook26'>\n                    cook26\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/kruskal'>\n                    kruskal\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/yellow_agony'>\n                    yellow_agony\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/COALSCAM","user":{"username":null},"time":{"view_start_date":1348428142,"submit_start_date":1348428142,"visible_start_date":1348427700,"end_date":1735669800,"current":1493557588},"todo":false,"problem_status":"unattempted"}