{"category_name":"medium","status":"success","problem_code":"COLLECT","problem_name":"Collecting Magical Berries","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>ChefLand is very famous for its magical forests. There you can find a lot of different trees, fruits, mushrooms and many other charming things. Recently, <b>N<\/b> bushes of magical berries (numbered <b>1<\/b> to <b>N<\/b>) have been discovered. The berries are in fact very tasty, and it has become very popular among the tourists to pick these berries (don't worry, as the berries are magical, they'll grow next night again :) ).<\/p>\n<p>Groups of tourists often want to go for a walk to pick some berries. For the <b>i<\/b>-th group it is known that it consists of <b>K<sub>i<\/sub><\/b> people and they will collect all the berries, from <b>K<sub>i<\/sub><\/b> consecutive bushes, beginning from the <b>L<sub>i<\/sub><\/b>-th, going to the <b>L<sub>i+1<\/sub><\/b>-th, the <b>L<sub>i+2<\/sub><\/b>-th and so on. Generally, a plan of the <b>i<\/b>-th group of tourists can be described by the numbers <b>L<sub>i<\/sub><\/b> and <b>R<sub>i<\/sub><\/b> - the leftmost and the rightmost bush for the <b>i<\/b>-th group. When the group have picked some amount of berries, we consider that they've picked all the berries from the bushes from the <b>L<sub>i<\/sub><\/b>-th to the <b>R<sub>i<\/sub><\/b>-th, they want to divide them <i>fairly<\/i>. <i>Fair<\/i> division is a division in such a way, that the difference between the maximal and the minimal number of berries a single tourist from the group receives is less than two. All the berries (even from a single bush) are different. Generally, there are a lot of ways to divide them fairly. For example, you can divide fairly two berries between two tourists in two ways.<\/p>\n<p>Some tourists are fond of dividing the berries. So, they will get upset if the number of ways to divide them is too small. But some tourists will get upset if the number of ways if too huge, they will find it quite confusing. So, the ChefLand tourist agency has offered the following service: for each group of tourists they tell the number of ways to divide the berries<br \/>\nfairly among them after the walk. As they currently don't have enough employees, they've asked you to help them. Of course, the number of berries on bushes changes during a day. You'll receive this information. Also, you'll receive the information about the groups of tourists. For each group of tourists, please tell the number of ways to divide collected berries fairly. We understand that this number can be quite huge, so we ask you to calculate it modulo <b>3046201<\/b>.<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input consists of a single integer <b>N<\/b> - the number of bushes.<br \/><br \/>\nThe second line consists of <b>N<\/b> integers - the <b>i<\/b>-th integer corresponds to the amount of the berries on the <b>i<\/b>-th bush in the beginning.<br \/><br \/>\nThe third line consists of a single integer <b>Q<\/b> - the number of requests given to your program. <br \/><br \/>\nNext <b>Q<\/b> lines are the lines of the following form: \"change A B\" - then the amount of the berries on the bush <b>A<\/b> becomes equal to <b>B<\/b>, or \"query L R\" - if a group of tourists wants to visit all the bushes from the <b>L<\/b>-th to the <b>R<\/b>-th, what is the number of ways to divide their collected berries fairly, modulo <b>3046201<\/b>.<\/p>\n<h3>Output<\/h3>\n<p>For each \"query L R\" request, output the number of ways, asked in the statement, modulo <b>3046201<\/b>. Output one number on a single line.<\/p>\n<h3>Constraints<\/h3>\n<p>\n<ul>\n<li><b>1<\/b>&lt;=<b>N<\/b>&lt;=<b>100000<\/b><\/li>\n<li><b>1<\/b>&lt;=<b>Q<\/b>&lt;=<b>100000<\/b><\/li>\n<li>You can assume that the number of berries on a single bush will not exceed <b>30<\/b><\/li>\n<\/ul>\n<\/p><p><br \/><\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n8\n2 1 1 2 1 2 2 2 5\nchange 2 2\nquery 1 8\nquery 5 7\nquery 3 3\nquery 4 4\n\n<b>Output:<\/b>\n2065880\n90\n1\n1\n\n<\/pre>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"xcwgf666","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","problem_tester":"tuananh93","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>tuananh93<\/span>","date_added":"30-11-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/combinatorics'>\n                    combinatorics\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/june13'>\n                    june13\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/medium'>\n                    medium\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/xcwgf666'>\n                    xcwgf666\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/COLLECT","user":{"username":null},"time":{"view_start_date":1371462288,"submit_start_date":1371462288,"visible_start_date":1371460885,"end_date":1735669800,"current":1493557596},"todo":false,"problem_status":"unattempted"}