{"body":"\n<h3> All submissions for this problem are available. <\/h3><p align=\"justify\">\nTwo players take it in turns to cut off squares from a rectangle. If the lengths of the sides of the rectangle are <i>a<\/i> and <i>b<\/i> (a&lt;=b) at the beginning of a player's turn, he may cut off as many squares with a side of length <i>a<\/i> as he likes (but at least 1 square), provided the square he is cutting off has at least three of its sides lying on the sides of the rectangle he is trimming. After every cut, the cut off square is removed from the rectangle. When the last part of the rectangle is removed, the game ends and the person who cut it off wins.\n<\/p>\n<p>\nMichael, a friend of the players', is taking down a log of the games they are playing in the form of a sequence of consecutive numbers, each number denoting how many squares a player cut off in his turn. Since the game is rather slow, Michael is getting a little bored and he has started writing a detailed analysis of the game in his notebook. For given starting dimensions a and b, he always writes down:\n<\/p>\n<div align=\"left\">\n<ul>\n<li>the number of different possible game sequences,\n<\/li><li>the number of different possible game sequences in which the starting player wins,\n<\/li><li>the word 'first' if the starting player can win (provided he does not make any mistakes) regardless of what the other player does, and the word 'second' in all other cases.\n<\/li><\/ul>\n<\/div>\n<p>\nAfter writing for several hours Michael began to worry whether he had enough room left in his notebook for all the information he wanted to write down. Please help him answer this question.\n<h3>Input<\/h3>\n<\/p><p align=\"justify\">\nAn integer t denoting the number of test cases, (t&lt;=10000) followed by t pairs of integers a, b, (1&lt;=a&lt;=b&lt;=10<sup>9<\/sup>) given in separate lines. \n<\/p>\n<h3>Output<\/h3>\n<p align=\"justify\">\nFor each test case, output the number of characters Michael has to write down (excluding spaces).\n<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Sample input:<\/b>\n2\n1 1\n2 3\n\n<b>Sample output:<\/b>\n7\n8\n<\/pre>\n<p>\n(In the first case Michael has to write '1 1 first', in the second case '2 1 second'.)\n<\/p>    ","languages_supported":"NA","title":"CUTSQRS","category":"NA","old_version":true,"problem_code":"CUTSQRS"}