{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>One of our businesses involves selling domain names. To that effect, we have an online interface where potential buyers of domain names can check the availability of domain names, and find out how much it is going to cost them.<\/p>\n\n<p><a href=\"http:\/\/en.wikipedia.org\/wiki\/Domain_tasting\">Domain tasting<\/a> is a frowned upon practice in our industry wherein people register domain names that are typos of existing domain names in order to make money through displaying ads to the traffic received on these typos. For instance if one were to register \"directo.com\" one could potentially get traffic from people who were trying to reach \"directi.com\" but instead mis-typed the last character.<\/p>\n\n<p>In order to disincentivize tasters from registering typos of existing domain names, we wish to levy a surcharge on a domain name which is a typo of an existing domain name. The amount of surcharge would depend on the type and number of transformations required to convert an existing domain to a domain name that someone wishes to register.<\/p>\n\n<p>The following type of transformations exist alongwith their cost -<\/p>\n<ol>\n<li>If a transformation requires insertion of one character, it costs 1 point<\/li>\n<li>If a transformation requires deletion of one character, it costs 1 point<\/li>\n<li>If a transformation requires replacement of one character, it costs 2 points, except where the character being replaced and its replacement are adjacent to one another on the same line of a qwerty keyboard, in which case it costs 1 point<\/li>\n<\/ol>\n<br \/>\n\n<p>These operations can be performed in any order, so for example, to transform the domain name \"directi\" to \"iriecti\", we can either do a deletion of \"d\" in directi followed by an insertion of \"i\" or perform an insertion followed by the deletion. Similarly, \"iriecti\" can be transformed to \"directi\" by performing an insertion of \"d\" followed by a deletion of \"i\" or vice-versa.<\/p>\n\n<p>For all domain name transformations that use 1 or 2 points, we wish to impose a surcharge of 50 and 25 cents respectively. Any domain name that requires more than 2 points will have no surcharge imposed upon them.<\/p>\n\n<h3>Input<\/h3>\n<p>The input starts with a line containing 2 space separated integers m &amp; n followed by a blank line. m is the number of already registered domain names. n is the list of names that a customer wishes to register - (1     m     2500) (1     n     7000). The next m lines are the already registered domain names. This is followed by a blank line. The next n lines are the list of names to be registered. There will be no space in the domain names, and they will consist only of a combination of lowercase alphabets from a to z and digits. The length of a domain name will be less than 31 characters.<\/p>\n\n<h3>Output<\/h3>\n<p>The output must consist of n lines. You need to print the maximum surcharge incurred for registering a particular domain when compared with all the already registered domain names plus the log to the base 10 of the number of domain names that this domain name could be transformed to by using 1 or 2 points. The value printed should be the integral part of the sum in case it has a fractional part. If a domain has already been registered, you should output -1.<\/p>\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n6 7\n\ngoogle\nyahoo\nrediff\nrediffmail\ndirect\ndirecti\n\ndirect\ngallery\nspeaker\nyahooo\ngopgle\ndrect\ndirezti\n\n<b>Output:<\/b>\n-1\n0\n0\n50\n50\n50\n25\n\n<\/pre>    ","languages_supported":"NA","title":"DDILEMMA","category":"NA","old_version":true,"problem_code":"DDILEMMA"}