{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Lights Off is a puzzle game consisting of an n x n grid of lights. At the beginning of the game, some of the lights are switched on. When a light is pressed, this light and the four adjacent lights are toggled, i.e., they are switched on if they were off, and switched off otherwise. The purpose of the game is to switch all the lights off.<\/p>\n<p>The following figure illustrates the game:<\/p>\n<p><img src=\"https:\/\/vn.spoj.pl\/SPOJVN\/content\/lightsoff.png\" alt=\"\" width=\"500\" \/><\/p>\n<p>Johnny has become addicted to playing the Lights Off game on his new iPhone. Yesterday he got stuck at a difficult level. He asked you, the talented programmer, for help. Please write a program to help Johnny solve the Lights Off game, not only for the regular 5x5 board size, but also for much larger dimensions!<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 10). Then t test cases follow.<\/p>\n<p>Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains n, the size of the board (3 &le; n &le; 30).<\/li>\n<li>Then n lines follow, each line contains n characters '0' or '1'. The character in the i<sup>th<\/sup> line and j<sup>th<\/sup> column is '0' if the corresponding light is off and '1' if it is on.<\/li>\n<\/ul>\n<h3>Output<\/h3>\n<p>For each test case, in the first line, print k, the number of times Johny must press a light. Any valid solution in which k does not exceed 5000 is accepted.<\/p>\n<p>Then k lines follow, each line containing two numbers i and j (1 &le; i, j &le; n), describing the position of a light to be pressed. Note that (i,j) means the light in the i<sup>th<\/sup> row and j<sup>th<\/sup> column; the rows are numbered 1 to n from top to bottom, and the columns are numbered 1 to n from left to right.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n1\n3\n000\n110\n010\n\n<strong>Output:<\/strong>\n5\n1 1\n2 1\n2 2\n3 2\n3 3\n\n<strong>Output details:<\/strong>\nThe states of the game after pressing each light are:\n000       110       010       000       000       000\n110 (1,1) 010 (2,1) 100 (2,2) 011 (3,2) 001 (3,3) 000\n010   -&gt;  010   -&gt;  110   -&gt;  100   -&gt;  011   -&gt;  000\n<\/pre>    ","languages_supported":"NA","title":"E2","category":"NA","old_version":true,"problem_code":"E2"}