{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>The Bytelandian Robotic Deparment has just succesfully made a robot that can be programmed to   move. Our robot can perform two type of movements: moving one step to the left or one step to the   right.<\/p>\n<p>Our robot moves according to the instruction from its control sequence. A control sequence of the   robot is a string consisting of only two type of characters: '+' and '-' symbols, in which '+' means   a rightward step and '-' means a leftward step. For example, '+--' is a control sequence that instruct the robot to go one step to the right   followed by two steps to the left.<\/p>\n<p>Our robot also has a master control sequence (MCQ), which is a string of N characters '+' and   '-'. <strong>Any valid control sequence of the robot must be a subsequence of the MCQ<\/strong>. Recall that a   subsequence is a sequence obtained by removing some characters of the initial sequence. An empty   sequence is also a subsequence of the MCQ.<\/p>\n<p>Our robot is currently placed on a runway of length L, in which the leftmost point has coordinate 0   and the rightmost point has coordinate L. Intially our robot stands at the point at coordinate A. It   needs to move to the point at coordinate B. Of course, it cannot go outside the runway.<\/p>\n<p>How many different control sequences are there that make the robot go from A to B?<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 50). Then t test cases follow. Each   test case has the following form:<\/p>\n<ul>\n    <li>The first line contains four integers N, L, A, B (1&lt;=     N&lt;=     500, 1&lt;=     L&lt;=       10<sup>9<\/sup>, 0&lt;=     A, B&lt;=     L).<\/li>\n    <li>The second line contains the MCQ which is a string of exactly N characters. The MCQ contains only   symbols '+' and '-'.<\/li>\n<\/ul>\n<h3>Output<\/h3>\n<p>For each test case, print a single number that is the number of different control sequences that   could make the robot to go from A to B. Since the result may be a very large number, you only need   to print the remainder of the result when dividing by 7051954.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input<\/strong>\n5\n6 6 0 0\n+-+-+-\n6 6 3 3\n+-+-+-\n6 1 0 0 \n+-+-+-\n6 6 1 4\n+-+-+-\n6 6 2 6\n+-+-+-\n\n<strong>Output<\/strong>\n5 \n9\n4\n1\n0\n<\/pre>\n<p><strong>Output details<\/strong><\/p>\n<p>Case 1: the different control sequences are +-, +-+-, ++--, +-+-+- and the empty sequence.<\/p>\n<p>Case 2: same as case 1 together with 4 additional sequences: -+, -+-+, -++-, +--+. These additional   sequences no longer make the robot go outside the runway as in case 1.<\/p>\n<p>Case 3: same as case 1 but without the sequence ++-- since it will make the robot go outside the   runway<\/p>\n<p>Case 4: there is only one possible control sequence: +++<\/p>\n<p>Case 5: there is no way for the robot to go to coordinate 6<\/p>\n<p><\/p>    ","languages_supported":"NA","title":"F2","category":"NA","old_version":true,"problem_code":"F2"}