{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>The Chef has a huge square napkin of size 2<sup>n<\/sup> X 2<sup>n<\/sup>. He folds the napkin n-3 times. Each time he folds its bottom side over its top side, and then its right side over its left side. After each fold, the side length of the napkin is reduced by half. The Chef continues folding until there remains a 8x8 sheet, lying flat on a table.<\/p>\n<p>Oh, did I forget to mention that the Chef was cooking a new brown colored curry while folding the napkin. He drops some brown colored gravy onto some cells in the folded 8x8 napkin. When he drops the gravy, it soaks through all the cells below it.<\/p>\n<p>Now the Chef unfolds the napkin to its original size. There are now many curry stained brown colored cells in the napkin. They form several separate regions, each of which is connected. Could you help the Chef count how many regions of brown cells are there in the napkin?<\/p>\n<p>Note that two cells are adjacent if they share a common edge (they are not considered adjacent if they only share a corner). Two cells are connected if we can go from one cell to the other via adjacent cells. A region is a maximal set of cells such that every two of its cells are connected.<\/p>\n<p>Please see the example test case and the figures below for more details.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 50). Then t test cases follow. Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains N (3     N     10<sup>9<\/sup>)<\/li>\n<li>Then, 8 lines follow. Each line contains 8 numbers, 0 or 1, where 1 denotes a stained brown cell in the folded napkin.<\/li>\n<\/ul>\n<h3>Output<\/h3>\n<p>For each test case, print a single number that is the number of disconnected brown regions in the unfolded napkin. Since the result may be a very large number, you only need to print its remainder when dividing by 21945.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n3\n3\n01000010\n11000001\n00000000\n00011000\n00011000\n00010100\n00001000\n00000000\n4\n01000010\n11000001\n00000000\n00011000\n00011000\n00010100\n00001000\n00000000\n1000000000\n11111111\n11111111\n11111111\n11111111\n11111111\n11111111\n11111111\n11111111\n\n<strong>Output:<\/strong>\n6\n22\n1\n<\/pre>\n<h3>Output details<\/h3>\n<p><img src=\"..\/..\/..\/content\/paulmcvn:paper.png\" alt=\"\" \/><\/p>\n<p>Case 1 and 2: There are 6 brown regions in the 8x8 napkin. If we unfold it once, it has 22 brown regions: 11 regions in the top half and 11 regions in the bottom half (as shown in the figure above).<\/p>\n<p>Case 3: All cells of the napkin are stained, so there is always one brown region, no matter how many times the Chef unfolds the napkin.<\/p>    ","languages_supported":"NA","title":"F3","category":"NA","old_version":true,"problem_code":"F3"}