{"body":"\n<h3> All submissions for this problem are available. <\/h3><p align=\"justify\">\nDid you know that the world's tallest structure is Burj Khalifa in Dubai ? To survive when the world ends, Mr.Turing thinks that he should climb one of those skyscrapers ( tall buildings ). There are N tall buildings numbered b_1, b_2, ... , b_N in that order and b_i and b_i+1 are adjacent to each other for 1 ≤ i &lt; N. Each of these have exactly F number of floors, f_1, f_2, ... , f_F from bottom to top. Floors f_i and f_i+1 in the same building are adjacent to each other for 1 ≤ i &lt; F and it takes one unit of time to move between them. It also takes one unit of time to move between the floor f_1 of a building and f_1 of its adjacent building.\n\n<\/p><p align=\"justify\">\nTuring is afraid that some buildings may still collapse and so he lists down the bridges connecting some of them, to know how to escape quickly. There are M bridges, each of which connects two floors of different buildings. Each of these bridges is given as bi fi T bj fj, meaning it takes T units of time to move along this bridge which connects the floor fi of building bi and the floor fj of building bj. All ways are bidirectional. Turing wants to know, given bq and fq, the sum of the shortest time it takes to reach (b,f) starting from (bq,fq), for all possible 1 ≤ b ≤ N ( except b = bq ) and 1 ≤ f ≤ F. In other words, given (bq,fq), find the value of    D(bq,fq,b,f) for all possible (b,f) except b = bq, where D(bi,fi,bj,fj) is the shortest time it takes to reach floor fi of building bi from floor fj of building bj. Get ready to answer his Q such queries.\n\n<h3>Input<\/h3>\n<\/p><p align=\"justify\">\nFirst line contains N F M. N is the number of buildings , F is the number of floors in each building and M is the number of bridges. M lines follow, each of the form bi fi T bj fj, as mentioned in the problem statement. Next line contains Q, the number of queries and Q lines follow, each of the form bq bf\n\n\n<h3>Output<\/h3>\n<\/p><p align=\"justify\">\nFor each test case, output the sum of the shortest time it takes from (bq,fq) to reach each floor of every other building.\n\n<h3>Constraints<\/h3>\n2 ≤ N, M ≤ 100<br \/>\n1 ≤ F, T ≤ 1,000,000<br \/>\n1 ≤ Q ≤ 2012<br \/>\n1 ≤ bi,bj,bq ≤ N and 1 ≤ fi,fj,fq ≤ F<br \/>\n\n\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n2 4 1\n1 3 1 2 3\n3\n1 1\n1 2\n1 3\n\n<b>Output:<\/b>\n10\n10\n8\n<\/pre>\n<br \/><br \/>\n<i><b>Note : <\/b>There are multiple test sets, and the judge shows the sum of the time taken over all test sets of your submission, if Accepted.<\/i><\/p>    ","languages_supported":"NA","title":"FLOORSMV","category":"NA","old_version":true,"problem_code":"FLOORSMV"}