{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Bibi the Smart Frog is playing a jumping game on an m <em>x<\/em> n rectangular board. There is a number written in each cell of the board (Bibi can read these numbers since he is very smart!)<\/p>\n<p>Bibi starts the game by picking any cell on the board and stays there. At each step, Bibi will jump to another cell. He can either:<\/p>\n<ul>\n<li>Jump to the <strong>right<\/strong> to a cell in the <strong>same row<\/strong>, provided that the number written in that cell is <strong>not smaller than<\/strong> the number written in the current cell.<\/li>\n<li>Jump <strong>downwards<\/strong> to a cell in the <strong>same column<\/strong>, provided that the number written in that cell is <strong>not greater than<\/strong> the number written in the current cell.<\/li>\n<\/ul>\n<p>To win the game, Bibi needs to jump through as many cells as possible. But no, he is not so extraordinarily smart that he could compute the optimal way to play the game. After all, he is only a frog, you know! Write a program to help Bibi compute the maximum number of cells that he can jump into.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 10). Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains two integers m, n (1  &lt;=   m, n &lt;=   500).<\/li>\n<li>Then, m lines follow, each line containing n numbers representing the rectangular board. It is guaranteed that no number exceeds 10<sup>6<\/sup>.<\/li>\n<\/ul>\n<p>Each test case is separated by a blank line.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, print a single number that is the maximum number of cells that Bibi can jump into.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n2\n\n2 3\n2 1 1\n2 1 1\n\n4 4\n6 2 5 2\n4 5 3 8\n9 7 8 9\n9 9 9 5\n\n<strong>Output:<\/strong>\n3\n5\n\n<strong>Output details<\/strong>\nA possible set of cells that Bibi could jump into is marked in bold:\n2 <strong>1<\/strong> <strong>1<\/strong>\n2 1 <strong>1<\/strong>\n\n6 <strong>2<\/strong> <strong>5<\/strong> 2\n4 5 <strong>3<\/strong> <strong>8<\/strong>\n9 7 8 9\n9 9 9 <strong>5<\/strong>\n<\/pre>    ","languages_supported":"NA","title":"G2","category":"NA","old_version":true,"problem_code":"G2"}