{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Once again, the smart friends Johnny and Mary have invented a new game. This time, the game is played with their coins and a strip of paper divided into cells. The cells are numbered from the left, starting from 1.<\/p>\n<p>Before the game starts, Johnny and Mary put some coins at some random cells on the strip, each coin in a cell. They alternatively take their turn to play the game. At each step, a player must take a coin and move it to a cell to the left of it. There is at most one coin in a cell at any time of the game. Of course, a coin cannot jump over another coin.<\/p>\n<p>The rule is simple: whoever cannot move loses the game. Mary takes her turn first.<\/p>\n<img src='\/\/codechef.com\/content\/coingame.png' \/>\n<p>Could you tell them who will win the game, provided that the winner will play the perfect strategy? If Mary could win the game, show her a winning move. If there are several winning moves, show her the winning move that uses the leftmost possible coin. If there are still several moves, show her the move that moves the coin as far as possible to the left.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 100). Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains an integer N (1 &lt;=     N &lt;=    10000) describing the number of coins on the strip.<\/li>\n<li>The second line contains N integers p<sub>1<\/sub>, p<sub>2<\/sub>, ..., p<sub>n<\/sub> (1  &lt;=   p<sub>1<\/sub> &lt; p<sub>2<\/sub> &lt; ... &lt; p<sub>n<\/sub>  &lt;=   10<sup>9<\/sup>) representing the initial position of the coins.<\/li>\n<\/ul>\n<p>Each test case is separated by a blank line.<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case, print either the string \"Mary wins\" or \"Johnny wins\" depending on who will win the game. If Mary could win the game in the next line, print the string \"Move <i>a<\/i> to <i>b<\/i>\" describing the desired winning move, where a is replaced by the position of the coin to move and b is replaced by the new position of that coin.<\/p>\n<p>Remember to print a blank line after the output for each test case.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n3\n\n2\n2 3\n\n3 \n1 3 5\n\n4\n2 4 6 9\n\n<strong>Output:<\/strong>\nJohnny wins\n\nMary wins\nMove 5 to 4\n\nMary wins\nMove 2 to 1\n<\/pre>\n\n<h3>Output details<\/h3>\n<p>Case 1: Mary's only possible move is to move the coin at position 2 to position 1. Johnny then moves 3 to 2 and wins the game.<\/p>\n<p>Case 2: After Mary moves 5 to 4, the only possible move for Johnny is to move 3 to 2. Mary then finishes the game by moving 4 to 3.<\/p>\n<p>Case 3: (see the above figure) Among the winning moves, moving 2 to 1 uses the leftmost possible coin.<\/p>    ","languages_supported":"NA","title":"G3","category":"NA","old_version":true,"problem_code":"G3"}