{"category_name":"medium","status":"success","problem_code":"HISTJUNK","problem_name":"Historical Junctions","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCK151A\/mandarin\/HISTJUNK.pdf\">Mandarin Chinese <\/a> , <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCK151A\/russian\/HISTJUNK.pdf\">Russian<\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCK151A\/vietnamese\/HISTJUNK.pdf\">Vietnamese<\/a><\/h3>\n\n\n<p>After the Great ChefLand War, ChefTown consisted of <b>N<\/b> historical junctions with a sightseeing place in each of them and <b>M<\/b> cobbled roads, connecting them. It is possible to reach any junction from any other one, possibly, via intermediate junctions. The ChefTown Restoration Committee (CTRC) now wants to make the town more convenient, thus, attractive, for the tourists. <\/p>\n\n<p>The essential requirement for the old town is to be \"in the center of the city\". For this purpose, each junction <b>V<\/b> has a parameter  <b>d(V)<\/b> denoting to the maximal shortest distance (in number of roads taken) you need to pass in order to reach some other junction, introduced by the CTRC.<\/p>\n\n<p>\n<center><img src = \"http:\/\/codechef.com\/download\/histjunk_pic.jpg\"><\/img><\/center>\n<\/p>\n<p>Let us take an example. Here you have 5 junctions with 5 roads, connecting them. Inside the circle, there is a number of a junction (in black), near the circle, there is a number <b>d(V)<\/b> (in yellow) corresponding to this junction.<\/p>\n\n<p>Consider the junction, numbered <b>1<\/b>. We have <b>d(1) = 2<\/b> because, you can reach any other junction, passing no more than two roads. In fact, you can reach the junctions <b>2<\/b> and <b>3<\/b> directly, thus, the distance to them is <b>1<\/b>. In order to reach the junction <b>4<\/b> you need to go to the junction <b>2<\/b> and then directly to the junction <b>4<\/b>. The same way you can reach the junction <b>5<\/b> using <b>2<\/b> roads. Of course, you could have travelled to the junction number <b>4<\/b> another way: you could moved to the junction number <b>3<\/b>, then to the junction number <b>2<\/b> and then, finally, to the junction number <b>4<\/b> and that would have taken three roads. But we are interested only in the shortest distances, thus, we have <b>d(1) = 2<\/b>.<\/p>\n\n<p>If we consider the junction <b>5<\/b>, it will take one road to go to the junction <b>3<\/b>, two roads to go to the junctions <b>1<\/b> and <b>2<\/b> and three roads to go to the junction <b>4<\/b>. So we have <b>d(5) = 3<\/b>.<\/p>\n\n<p>Let's call the junction a <b>central<\/b> one in case its' parameter of <b>d(V)<\/b> is minimal among all the junctions in the town. On the example above, the junctions numbered <b>1, 2, 3<\/b> are central, and the junctions numbered <b>4, 5<\/b> are not.<\/p>\n\n<p>Now, CTRC wants to build some new junctions (possibly none) with brand new shops and fast food and new asphalt roads connecting them in such a way that all the historical junctions are <b>central<\/b> in the town. In order to avoid the mess, none of newly built \"non-historical\" junctions should be central. Moreover, by the regulations of CTRC itself, it is prohibited to build an asphalt road between two historical junctions because it violates the spirit of old times.<\/p>\n\n<p>All the roads in ChefTown, namely those that were built initially and those that will be built by CTRC are bi-directional.<\/p>\n\n<p>The CTRC is now short in terms of money. It has sufficient funds only to build no more than <b>2N<\/b> new junctions and no more than <b>N * (N - 1)<\/b> new roads. Please help them to find an appropriate road-building plan or state that it is impossible.<\/p>\n\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows.<\/p>\n\n<p>The first line of each test case contains integers <b>N<\/b> and <b>M<\/b> denoting the number of historical junctions and the number of roads between them.<\/p> \n\n<p>The following <b>M<\/b> lines contain pairs of space-separated integers <b>X<\/b> and <b>Y<\/b> denoting that there is a road between the junction numbered <b>X<\/b> and the junction numbered <b>Y<\/b>.<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case, please use the following output format: \n<\/p>\n<p>\nIf it is impossible to accomplish the requirement, print \"-1 -1\" (without quotes) in a single line. <\/br>\nOtherwise, <\/br>\n<ul>\n<li>First output a line with two space separated integers: <b>J<\/b> and <b>A<\/b> denoting the number of added junctions and the number of added roads. They should not exceed <b>2 * N<\/b> and <b>N * (N - 1)<\/b> respectively.<\/li> <\/br>\n<li>Then, output <b>A<\/b> integers denoting the newly built roads. Each of these integers should denote a road by a pair of space-separated junction numbers. The newly built junctions hold the numbers <b>N+1<\/b> <b>N+2<\/b> ... <b>N+J<\/b>. After adding the roads, it should be possible to reach any junction from any other junction (possible, via the intermediate ones). There should not be more than one road between any pair of junctions and no junction should be connect to itself.<\/li>\n<\/ul> \n<\/p>\n\n<h3>Constraints<\/h3>\n<p>\n<ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>20<\/b><\/li>\n<li><b>1<\/b> ≤ <b>N<\/b> ≤ <b>100<\/b><\/li>\n<li><b>N - 1<\/b> ≤ <b>M<\/b> ≤ <b>N * (N - 1) \/ 2<\/b><\/li>\n<li><b>1<\/b> ≤ <b>X, Y<\/b> ≤ <b>N<\/b><\/li>\n<li>In the given junction-road system, any junction is connected with any other by no more than one road and there is no road that connects the junction to itself. Also, this condition should also be satisfied for the newly constructed junctions and roads between them.<\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n2\n4 4\n1 2\n2 3\n3 4\n4 1\n4 6\n1 2\n2 3\n3 4\n4 1\n1 3\n2 4\n\n<b>Output:<\/b>\n4 4\n1 5\n2 6\n3 7\n4 8\n0 0\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>In the first example<\/b>, the obtained road system satisfies the required constraints. Please note that you don't need to minimize the number of added roads and junctions.<\/p>\n<p><b>In the second example<\/b>, you can leave everything as it is because the given graph already satisfies the constraints.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"xcwgf666","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","problem_tester":null,"problem_tester_html_handle":null,"date_added":"27-04-2015","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/central-nodes'>\n                    central-nodes\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/eccentricity'>\n                    eccentricity\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/graphs'>\n                    graphs\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/snck151a'>\n                    snck151a\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/xcwgf666'>\n                    xcwgf666\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/HISTJUNK","user":{"username":null},"time":{"view_start_date":1432379700,"submit_start_date":1432379700,"visible_start_date":1432379700,"end_date":1735669800,"current":1493557686},"todo":false,"problem_status":"unattempted"}