{"body":"\n<h3> All submissions for this problem are available. <\/h3>\n<p>In the hidden country of Lapatrecta, an age old custom was followed to ensure that no outsider ever entered their country undetected. The security measure, though simple, was an effective one. Every person born in Lapatrecta had the initials of all his forefathers included in front of his name. Every once in a while, certain families became very famous and the initials of their ancestors were dropped from the names of all their descendants. Thus, there existed a nice homogeneity in the names of the people of Lapatrecta.<\/p>\n<p>\nNow, a royal ball was organized at the behest of the Queen of Lapatrecta and all citizens were cordially invited to the event. The ball was being held to chop off the initials of the ancestors of the  most distinguished family of the country. The Queen set the following 2 criteria for determining the most distinguished family from amongst the invitees:\n<\/p>\n<p>\n1.\tThe family must have more than 1 member living.<br \/>\n2.\tThe length of the ancestor list of the family must be as long as possible.\n<\/p>\n<p>\nFor example:\n<\/p>\n<p>\nFor 3 people:<br\/><br \/>\nAPJQ Ravi<br\/><br \/>\nAPJRS Rahul<br\/><br \/>\nPJQ Bharat<br\/>\n<\/br\/><\/br\/><\/br\/><\/br\/><\/p>\n<p>\nThe following observations hold:<br\/><br \/>\n<strong>APJQ Ravi<\/strong> was of the same family as <strong>APJ Rahul<\/strong> but <strong>PJQ Bharat<\/strong> was not of the same family.\n<\/br\/><\/p>\n<p>\nThe length of the ancestor list for Ravi and Rahul was 3 whereas Bharat has an ancestor length of 0 as there is no other member of his family living.  However, if there existed a person named PJ Varun, Bharat and Varun would both have an ancestor list length of 2.\n<\/p>\n<p>\nAs a member of the Royal Court of Lapatrecta, you have been entrusted the task of determining the length of the ancestor list that will be chopped off by the Queen. You will be provided data in the following format:\n<\/p>\n<h3>Input<\/h3>\n<p>Line 1: N &#8211; The number of people coming to the ball<br\/><br \/>\nLine 2-N+1: The initials list of all the people coming to the ball. No initials list is longer than 100 characters.\n<\/br\/><\/p>\n<h3>Output<\/h3>\n<p>Line 1: The length of the longest ancestor list.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\nAPJQ\nAPJRS\nPJQ\n\n<b>Output:<\/b>\n3 \n<\/pre>    ","languages_supported":"NA","title":"INSOMA4","category":"NA","old_version":true,"problem_code":"INSOMA4"}