{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Johnny, a computer science student from the Bytelandian Technological University (BTU), has finally managed to write a program to solve the N queens problem. However, his version of the N queens problem is not really all that similar to the classical one.<\/p>\n<p>Recall that in the N queens problem, there is a square chessboard of size NxN. The goal is to put N queens on the chessboard so that no two queens would be able to attack each other.<\/p>\n<p>In Johnny's version of the problem (which he states to be \"much harder\" than the original one), there are K \"blocked\" squares given on the chessboard. The goal is still the same: to put N queens on the chessboard such that no two queens would be able to attack each other. However, there are some differences due to the existence of blocked squares. First, a queen <b>cannot be put<\/b> on a blocked square. Secondly, two queens are considered to be able to attack each other only if there is <b>no blocked square<\/b> between them. Finally, there must be <b>exactly one<\/b> queen on every column of the board.<\/p>\n<p>Johnny claims that his program solves the above problem very effectively. He generates some test cases (which his program can solve within minutes) to challenge you. You know the method Johnny used to generate the test case. For a given N, Johnny randomly picks a number K between 1 and N<sup>2<\/sup>\/2 with equal probability. After that, Johnny picks K blocked squares on the chess board. Any combinations of K squares can be picked with equal probability.<\/p>\n<p>Write a program that can solve Johnny's test cases within seconds.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 5). Then t test cases follow. Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains two integers N and K (8 &lt;= N &lt;= 500, 1 &lt;= K &lt;= N<sup>2<\/sup>\/2)<\/li>\n<li>Each line in the next K lines contains two integers i, j which are the row and the column number of a blocked square (1 &lt;= i, j &lt;= N)<\/li>\n<\/ul>\n<p>Each test case's input is separated by a blank line. The rows and the columns of the chessboard are numbered from 1 to N. There is always a solution for each test case.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, print a single line containing N integers a<sub>1<\/sub>, a<sub>2<\/sub>, ..., a<sub>N<\/sub> in which a<sub>i<\/sub> is the row number of the queen in column i. Any correct solution will be accepted.<\/p>\n<h3>Example<\/h3>\n<pre><b>Input<\/b><br \/>1<br \/><br \/>8 15<br \/>7 7<br \/>3 1<br \/>7 1<br \/>4 8<br \/>8 3<br \/>6 5<br \/>4 4<br \/>2 1<br \/>8 2<br \/>6 3<br \/>3 7<br \/>7 6<br \/>2 3<br \/>1 2<br \/>6 4<br \/><br \/><b>Output<\/b><br \/>4 2 7 5 2 4 6 8 <br \/><\/pre>\n<p><img src=\"\/themes\/abessive\/images\/contests\/qpuzzle.png\" \/><\/p>    ","languages_supported":"NA","title":"J3","category":"NA","old_version":true,"problem_code":"J3"}