{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Johnny, a third year computer science student of Byteland University, is rushing with his AI assignment project which is due tomorrow evening. In this project, he has to build a Lego NXT robot which is able to navigate in a maze. Johnny calls his robot WallB (because he likes the movie \"WallE\" very much).<\/p>\n<p>The maze is an MxN rectangular grid. There are digits 0..9 and obstacles placed at some intersections. Starting at some intersection, in each step, WallB can move to one of the four intersections adjacent to its current position. However, WallB cannot step into an obstacle.<\/p>\n<p><img src=\"\/themes\/abessive\/images\/contests\/digimaze1.jpg\" \/><\/p>\n<p>A maze intersection with a handwritten digit<\/p>\n<p>Johnny needs to program WallB to be able to do the following tasks. First, WallB has to traverse through all reachable intersections of the maze and recognize the digits written at the intersections. Johnny has already finished this part of the assignment since he is very good at image recognition algorithms.<\/p>\n<p><img src=\"\/themes\/abessive\/images\/contests\/digimaze2.jpg\" \/><\/p>\n<p>WallB needs to scan and recognize all the reachable digits.<\/p>\n<p>The second part of the assignment is harder. Prof. Q will announce a number X. Based on the map of the maze obtained in the first part, Johnny needs to program WallB to find a shortest path that passes through digits which sum up to X.<\/p>\n<p>To be more precise, suppose in his route, WallB passes through the digits d<sub>1<\/sub>, d<sub>2<\/sub>, ..., d<sub>k<\/sub> in order; then we should have d<sub>1<\/sub> + d<sub>2<\/sub> + ... + d<sub>k<\/sub> = X. WallB could pass through a digit more than once.<\/p>\n<p>Johnny gets stuck in this second part of the assignment. Could you write a program to help him?<\/p>\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 25). Then t test cases follow. Each test case has the following form:<\/p>\n<ul>\n<li>The first line contains two integers M, N (0 &lt;= M, N &lt;= 100) representing the size of the maze.<\/li>\n<li>Each line in the next M+1 lines contains N+1 characters describing the structure of the maze. Each character represents an intersection and could be one of: \n<ul>\n<li>'.': empty intersection<\/li>\n<li>'#': obstacle<\/li>\n<li>'0'..'9': digits<\/li>\n<li>'*': starting position of WallB<\/li>\n<\/ul>\n<\/li>\n<li>The last line contains the number X announced by Prof. Q (1 &lt;= X &lt;= 100).<\/li>\n<\/ul>\n<p>Successive test cases are separated by blank lines.  The number of digits in a maze is at most 100.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, print the minimum number of steps that WallB needs to travel to visit the digits that sum up to X. If there is no way for WallB to complete the task, print the number -1.<\/p>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n3\n\n2 3\n1.#2\n#..#\n*.#.\n3\n\n2 3\n2.#2\n#..#\n*.#.\n5\n\n2 3\n2.#2\n#.3#\n*.#.\n5\n\n<b>Output:<\/b>\n8\n-1\n6\n<\/pre>\n<p><\/p>    ","languages_supported":"NA","title":"K3","category":"NA","old_version":true,"problem_code":"K3"}