
{"category_name":"medium","status":"success","problem_code":"MAGICHF2","problem_name":"Magician versus Chef 2","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>###Read problems statements [Hindi](http:\/\/www.codechef.com\/download\/translated\/NOV18\/hindi\/MAGICHF2.pdf) , [Vietnamese](http:\/\/www.codechef.com\/download\/translated\/NOV18\/vietnamese\/MAGICHF2.pdf) , [Mandarin Chinese](http:\/\/www.codechef.com\/download\/translated\/NOV18\/mandarin\/MAGICHF2.pdf) , [Russian](http:\/\/www.codechef.com\/download\/translated\/NOV18\/russian\/MAGICHF2.pdf) and [Bengali](http:\/\/www.codechef.com\/download\/translated\/NOV18\/bengali\/MAGICHF2.pdf) as well.\n\nThe last time in Byteland, Chef defeated the magician in his challenge and won a gold coin.\n\nThe magician does not want to give up his coin so easily, so he gives Chef $N$ coins. One of them is real and the remaining $N-1$ are fake; all fake coins have equal weights, different from the weight of the real coin. The coins are otherwise indistinguishable.\n\nChef has to find the real coin by himself. To make it fair, the magician gives Chef a balance. The balance is magical — it stays balanced when the sums of weights of coins put on each side are equal, but if they are not equal, the balance tilts to a random side instead of the side with the greater sum of weights. Chef can only use this balance up to $K$ times; if he cannot uniquely determine which coin is the real one afterwards, he has to guess the real coin (he may make a guess in any way he wants).\n\nIf Chef uses the balance optimally, what is the minimum possible probability that he will correctly determine the real coin at the end? We are interested in the worst-case scenario where the position of the gold coin is fixed initially (but unknown to Chef).\n\n### Input\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first and only line of each test case contains two space-separated integers $N$ and $K$.\n\n### Output\nFor each test case, print a single line containing one integer — the minimum probability that Chef will find the gold coin. Your output will be considered correct if its absolute error does not exceed $ 10^{-6}$.\n\n### Constraints \n- $1 \\le T \\le 2 \\cdot 10^5$\n- $1 \\le N \\le 10^{18}$\n- $0 \\le K \\le 10^9$\n\n### Subtasks\n**Subtask #1 (25 points):** $1 \\le N \\le 10^5$\n\n**Subtask #2 (75 points):** original constraints\n\n### Example Input\n```\n4\n3 1\n3 2\n4 1\n1 5\n```\n\n### Example Output\n```\n0.500000\n1.000000\n0.500000\n1.000000\n```\n\n### Explanation\n**Example case 1:** Chef takes two coins and puts them on the two sides of the balance. If the balance tilts, then one of these two coins is real. (Otherwise, they are both fake and Chef found the real coin; we do not consider this scenario, since it does not lead to the minimum probability.) Chef cannot use the balance any more, so he cannot determine which of these two coins is the real one. He has to guess one; this guess is correct with probability $1\/2$.\n\n**Example case 2:** The first use of the balance is the same as before. If the balance does not tilt, he knows the real coin. Otherwise, Chef replaces one coin on the balance. If the balance tilts again, the coin that was not replaced is the real one. Otherwise, the replaced coin is the real one.\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"shivam_g1470","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>shivam_g1470<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"29-10-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/cases'>cases<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/easy'>easy<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/nov18'>nov18<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/optimal'>optimal<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/probability'>probability<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/shivam_g1470'>shivam_g1470<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/taran_1407'>taran_1407<\/a>","editorial_url":"https:\/\/discuss.codechef.com\/problems\/MAGICHF2","time":{"view_start_date":1542015002,"submit_start_date":1542015002,"visible_start_date":1542015002,"end_date":1735669800,"current":1559472975},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}