{"category_name":"medium","status":"success","problem_code":"NI03","problem_name":"Weapons","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p style=\"text-align:justify\">There are <b>N<\/b> fighter aircrafts guarding the sky. Each aircraft flies at a constant altitude and at a constant velocity <b>(vx,vy)<\/b>. In other words, every hour it travels <b>vx<\/b> km in the <b>X<\/b> direction and <b>vy<\/b> km in the <b>Y<\/b> direction (<b>vx<\/b> and <b>vy<\/b> can be negative as well).<\/p>\n<p style=\"text-align:justify\">But there has been a major problem. The weapons systems in all the aircrafts have been disabled by an unknown virus. So they are essentially useless! If they return to base camp, the enemy will realize something is wrong and may attack. To avoid this scenario, it is decided that a system expert will leave in a small fast plane and visit each fighter aircraft. The expert will hover his small aircraft exactly over the fighter plane he wants to repair, send the program (fix) to the pilot (via Bluetooth) and then give instructions to the fighter pilot to run the program. This whole process takes exactly an <b>hour,<\/b> once the expert is hovering over the fighter aircraft. After he’s done, he moves onto the next fighter aircraft. When he has repaired all aircrafts, he returns back to base camp.<\/p>\n<p style=\"text-align:justify\">Your task is to determine how long it takes for this entire process, assuming the expert leaves base camp at time <b>t = 0<\/b><\/p>\n<p style=\"text-align:justify\">You can assume the following:<\/p>\n<p style=\"text-align:justify\">1.  The experts plane can fly in any direction with a maximum speed of <b>S<\/b> (assume acceleration, deceleration and varying altitude to be instantaneous).<\/p>\n<p style=\"text-align:justify\">2.  It is guaranteed that <b>S<\/b> will be greater than the speed of any fighter aircraft. <\/p>\n<p style=\"text-align:justify\">3.  Multiple planes may have the same <b>(x, y)<\/b> co-ordinates, but there are no collisions – because they are flying at different altitudes.<\/p>\n<h3>Input<\/h3>\n<p style=\"text-align:justify\">There are multiple test cases (not more than 500). Each test case starts with a line containing a single integer <b>N<\/b> (1 ≤ N ≤ 8, chosen uniformally randomly) – indicating the number of fighter planes (excluding the plane of our expert). The next <b>N<\/b> lines each consist of 4 space separated integers – the initial co-ordinates <b>(px,py)<\/b> (at t = 0) and the velocity vector <b>(vx,vy)<\/b> respectively of the <b>n<sup>th<\/sup><\/b> fighter aircraft. The last line of the test case consists of 3 space separated integers – the <b>(x,y)<\/b> co-ordinates of base camp and <b>S<\/b> – the speed of the experts plane. The end of input is indicated by a case that starts with N = 0 and this last case should not be processed. All co-ordinates \/ vectors in the input have an absolute value less than or equal to 1000 (S of course, does not fall under the same restriction).<\/p>\n<h3>Output<\/h3>\n<p style=\"text-align:justify\">For each test case, output the minimum time taken for the expert to leave the base camp, visit and fix each fighter aircraft exactly once and return to base camp. The format to print the result is:<\/p>\n<p style=\"text-align:justify\"><b>A h m s<\/b><\/p>\n<p style=\"text-align:justify\">Where <b>A<\/b> is the case number (starting with 1 for the first case and so on) and <b>h<\/b>, <b>m<\/b>, <b>s<\/b> are non negative integers denoting hours, minutes and seconds respectively (they should be separated by single space). Note that <b>m<\/b> and <b>s<\/b> are atmost 59. The time should be <b>rounded up<\/b> to the next second.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n5\n1 0 0 0\n2 0 0 0\n3 0 0 0\n4 0 0 0\n5 0 0 0\n0 0 1\n3\n1 2 3 4\n2 2 40 23\n7 8 22 10\n0 0 50\n0\n\n<b>Output:<\/b>\n1 15 0 0\n2 5 59 50\n\n<\/pre>","languages_supported":"C, CPP 4.3.2, CPP14, GO, JAVA","max_timelimit":"3","source_sizelimit":"50000","problem_author":"iitgfaculties","problem_author_html_handle":"iitgfaculties","problem_tester":null,"problem_tester_html_handle":null,"date_added":"2-11-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/iitgfaculties'>\n                    iitgfaculties\n                <\/a>","user":{"username":null},"time":{"view_start_date":1352630418,"submit_start_date":1352630418,"visible_start_date":1352627003,"end_date":1735669800,"current":1493557814},"todo":false,"problem_status":"unattempted"}