{"category_name":"medium","status":"success","problem_code":"PEOPLOVE","problem_name":"Love among People","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>There are <b>n<\/b> people in a group. Some of them love each other. You are given <b>m<\/b> such relationships. Each relationship is represented by two integers <b>u, v<\/b>, denoting that person <b>u<\/b> and <b>v<\/b> love each other.\n<\/p>\n<p>\nOne day the people went to a magician asking about an issue bothering them for long time. The magician said \"It is not a good omen if two persons love each other. There is no joy in the love if you get reciprocated for your love.  So from now on, you guys have to make sure that whoever loves each other among you should decide the person who will be loved and who will love.\".\n<\/p>\n<p>\nFormally, he asked each pair of persons <b>u, v<\/b> which used to love each other to decide among themselves whether <b>u<\/b> will love <b>v<\/b> or <b>v<\/b> will love <b>u<\/b>, but both of them can't love each other.\n<\/p>\n<p>\nTruly scared and saddened by the magician's suggestion, people decided that they will change their relationships according to the suggestion. Soon they realized that by following the suggestion blindly it might happen that a person loves a lot of other people and in turn very few people love him, which will make a person really sad :(. Sometimes it might also happen a lot of persons love a person, but that person loves too less persons, in that case also, he will feel sad too. In particular, sadness of a person will be equal to absolute difference of the number of persons that he loves and number of persons that love him.\n<\/p>\n<p>\nNow they want people to be as less sad as possible. Formally, they want to minimize the maximum value of sadness over all the persons in the group. Can you please help them in this daunting task? Formally, you have to tell for each loving pair <b>u, v<\/b>, which way the love should be?\n<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows.<\/p>\n<p>First line of the each test case contains two space separated integer <b>n, m<\/b> denoting the number of persons and number of their love relationships.<\/p>\n<p>Each of the next <b>m<\/b> lines contains two space separated integers <b>u, v<\/b> denoting that persons <b>u<\/b> and <b>v<\/b> love each other.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output <b>m + 1<\/b> lines. <\/p>\n<p>First line should contain a single integer the minimum value of maximum sadness over all persons that they can achieve. <\/p>\n<p>In the next <b>m<\/b> lines, <b>i<\/b>-th line should contain two space separated integers <b>u, v<\/b> denoting that person <b>u<\/b> loves person <b>v<\/b>. If <b>v<\/b> loves person <b>u<\/b>, then print <b>v, u<\/b>.<\/p>\n<p>Please note that there can be more than one possible ways of changing the relationships. In those situations, you are allowed to print any of them<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ <b>10<sup>6<\/sup><\/b><\/li>\n<li>1 ≤ <b>N<\/b> ≤ <b>10<sup>5<\/sup><\/b><\/li>\n<li>Sum of <b>N<\/b>'s' over all the test cases in a single file won't exceed <b>10<sup>6<\/sup><\/b><\/li>\n<\/ul>\n<h3>Subtasks<\/h3>\n<p>\n<b>Subtask #1 (30 points)<\/b><\/p>\n<ul>\n<li>You just have to tell the minimum value of maximum sadness factor. You don't require to print one such way of changing relationships. Note that if you want to solve this subtask only, the first line of your output should be <tt>\"SMALL_SUBTASK\"<\/tt> (without quotes). After that, for each test case, you should just print the first line corresponding the minimum of maximum sadness.\n<\/li>\n<\/ul>\n\n<p>\n<b>Subtask #2 (70 points)<\/b><\/p>\n<ul>\n<li>For solving this subtask, your should print first line as \"BOTH_SUBTASKS\" (without quotes). The output format for this case will be similar to that is written in output section. <\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input<\/b>\n2\n2 1\n1 2\n3 2\n1 2\n2 3\n\n<b>Output:<\/b>\n<b>For solving both the subtasks.<\/b>\nBOTH_SUBTASKS\n1\n1 2\n1\n1 2\n3 1\n\n<b>For solving only a single subtask<\/b>\nSMALL_SUBTASK\n1\n1\n<\/pre><h3>Explanation<\/h3>\n<p><b>Example case 1.<\/b> There are two persons. Person 1 and 2 love each other. Now, according to magician's suggestion, if person 1 loves person 2, then sadness of both the persons will be equal to 1. Same is the case with person 2 loving person 1. Hence answer is 1.<\/p>\n<p><b>Example case 2.<\/b> There are three persons. Person 1 and 2 love each other. Person 2 and 3 love each other. Now, according to magician's suggestion, if person 1 loves person 2 and person 3 loves 1. Then, sadness of all three persons will be equal to 1. This is the best that they can do. For example, if the person 1 loves 2 and person 1 loves 3 too, then sadness of first person will be 2, which will be worse than previous case. Hence answer is 1.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"5","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"23-06-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>\n                    admin2\n                <\/a>","user":{"username":null},"time":{"view_start_date":1467052140,"submit_start_date":1467052140,"visible_start_date":1467052140,"end_date":1735669800,"current":1493557845},"todo":false,"problem_status":"unattempted"}