
{"category_name":"medium","status":"success","problem_code":"PROC18F","problem_name":"The Illusionist","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Niket is an incredible magician. He has prepared an extraordinary magic trick which he calls as the biggest achievement of his life. He will be performing this magic trick for the first time in the $\\text{K}$-Pop World Festival. He is nervous and wants to make sure that everything goes well. His magic trick consists of $\\text{N}$ acts labeled from 1 to N. Every act except act 1 is $\\text{directly}$ dependent upon the successful execution of exactly one of the previous acts. The act i is said to be dependent upon act j iff - \n- act i is directly dependent upon the act j (j < i) or\n- act i is dependent upon some act x which is dependent upon the act j. (j < x < i) \n\nAn act can never happen if one or more of its dependencies failed. Note that $\\text{not happening is not the same as failing}$. Also, every act has an associated value $\\mathbf{a_i}$ which gets added to the audience's anger if that act $\\text{fails}$. If the anger becomes very large, people will start throwing sharp objects at Niket. \n\nSince he is going to perform in the $\\text{K}$-Pop World Festival, he is interested in knowing the minimum possible anger value of audience in the hypothetical situation where he was able to successfully execute $\\text{exactly K}$ acts during his performance. This means that the remaining acts either failed or could not happen (because of the dependency constraints).\n\n###Input\nThe first line contains a single interger $\\text{T}$ - the number of testcases.\n\nFor each testcase,\n\nThe first line contains two space separated integers $\\text{N}$ and $\\text{K}$.\n\nThe following N-1 lines contain the information about the acts 2 to N. ith of these lines contains two space separated integers $p_i$ ($p_i$ < i+1) and $a_i$- This means that the (i+1)th act is directly dependent upon the $p_i$th act and adds $a_i$ to the anger value.\n\n###Output\nFor each testcase, print a line containing the minimum anger value of audience if Niket could perform exactly $\\text{K}$ of the acts successfully.\n\n###Constraints \n$1 \\leq \\text{T} \\leq 10$\n\n$1 \\leq \\text{N} \\leq 2000$ \n\n$1 \\leq \\text{K} \\leq \\text{N}$ \n\n$1 \\leq \\mathbf{a_i} \\leq 10^9$ \n\n###Sample Input\n\t1\n\t5 3\n\t1 5\n\t2 4\n\t2 6\n\t3 8\n\n###Sample Output\n\t4\n\n###Explanation\nIf Niket fails on act 3,  $a_3$ = 4 gets added to the audience's anger and the act 5 can never happen. This means only 3 acts 1,2 and 4 are successful.","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"meetsid20","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>meetsid20<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"9-08-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/meetsid20'>meetsid20<\/a>","time":{"view_start_date":1534442400,"submit_start_date":1534442400,"visible_start_date":1534442400,"end_date":1735669800,"current":1559472979},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}