{"category_name":"medium","status":"success","problem_code":"PWNCHESS","problem_name":"Pawn Chess","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problem statement in <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/COOK93\/mandarin\/PWNCHESS.pdf\">Mandarin chinese<\/a> and <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/COOK93\/vietnamese\/PWNCHESS.pdf\">Vietnamese<\/a>.<\/h3>\n\nAfter winning the Candidates Tournament, Suzumo is intensively training for his upcoming match against Magus Cartesian.\n\nIn order to improve his calculation skills, Suzumo invented a new game, which he named PawnChess. PawnChess is a two-player game played on a row of $N$ cells. Its rules are as follows:\n\n- Initially, some pawns are placed in some cells; each pawn is either black or white. There may be at most one pawn in each cell at any time. For each white pawn, all the pawns that are to the left of this pawn are also white.\n- Let's call the players White and Black. Each player may only move pawns of their colour. The players alternate turns; White moves first.\n- In White's turn, White must move one pawn one cell to the right (if the pawn was in cell $i$, it is moved to cell $i+1$). Similarly, in Black's turn, Black must move one pawn one cell to the left (from cell $i$ to cell $i-1$). It is not allowed to move a pawn outside of the row of cells or to move a pawn to a cell which already contains a pawn with the same colour.\n- If a pawn $P$ is moved to an empty cell, nothing happens. If it is moved to a cell containing a pawn $R$ with the opposite colour, the pawn $R$ is captured — removed from the game, and $P$ is placed in the cell which previously contained $R$.\n- The winner of the game is the player that captures all the pieces of their opponent. Note that as long as there is at least one black and at least one white pawn, each player can make a move.\n\nGiven the initial configuration of the game board, help Suzumo determine the winner of the game. Assume that both players play optimally.\n\n### Input\n\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first and only line of each test case contains a single string $S$ with length $N$ describing the game board. Each character in $S$ is '.', 'W' or 'B' denoting an empty cell, a white pawn and a black pawn respectively.\n\n### Output\n\nFor each test case, print a single line containing the string `\"W\"` if White wins the game or `\"B\"` if Black wins.\n\n### Constraints \n\n- $2 \\le N \\le 128$\n- there is at least one white pawn and at least one black pawn\n- all pawns to the left of a white pawn are always white\n- the sum of $N$ over all test cases is at most $5 \\cdot 10^5$\n\n### Example Input\n```\n2\nW..B\nWW.B\n```\n\n### Example Output\n```\nW\nB\n```\n\n### Explanation\n\n**Example case 2:** One possible sequence of moves is as follows:\n```\nWW.B\nW.WB\nW.B.\n.WB.\n.B..\n```\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"alei","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #D0011B;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>7&#9733;<\/span><span>alei<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-04-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/alei'>alei<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/cook93'>cook93<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/game-theory'>game-theory<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/games'>games<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/medium'>medium<\/a>","editorial_url":"https:\/\/discuss.codechef.com\/problems\/PWNCHESS","time":{"view_start_date":1524421800,"submit_start_date":1524421800,"visible_start_date":1524421800,"end_date":1735669800,"current":1525198958},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}