{"category_name":"medium","status":"success","problem_code":"REIGN2","problem_name":"Reign 2","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problems statements in <a href=\"\/download\/translated\/COOK62\/mandarin\/REIGN2.pdf\" target=\"_blank\">Mandarin Chinese<\/a> and <a href=\"\/download\/translated\/COOK62\/russian\/REIGN2.pdf\" target=\"_blank\">Russian<\/a> as well.<\/h3>\r\n<p>Crueland is a dangerous region following ancient traditions. Every day, there are confrontations among local rulers, and thus many civilians are forced to be refugees. The only recognized way of resolving issues in Crueland is by means of physical power.<\/p>\r\n<p>King George is thought to be one of the most reasonable and careful rulers in Crueland. As a reasonable ruler, he understands that the best defense is a good offense. Therefore, he decided to conquer some castles and lands to frighten his enemies.<\/p>\r\n<p>There are <b>N<\/b> castles that can be conquered by George. As a careful ruler, he won't let his people die without a strong reason. After careful solitary consideration, he has decided to conquer <b>exactly K<\/b> castles during the next <b>K<\/b> days, an aim he plans to achieve by conquering one castle every day for the next <b>K<\/b> days.<\/p>\r\n<p>As reported by King George's spies, <b>A<sub>i<\/sub> + (j - 1) × B<sub>i<\/sub><\/b> enemy knights will be protecting the <b>i<\/b><sup>th<\/sup> castle during the <b>j<\/b><sup>th<\/sup> day. When attacking a castle, if the King sends as many knights as those defending it, it's sufficient to be conquer that castle. Another requirement is that one knight cannot be sent to conquer two different castles.<\/p>\r\n<p>Now, you are the <em>Hand of the King<\/em>. Though caring about the King is your duty, you know that he is a tyrant and you want people to learn the truth about him. Thus, you want to sabotage George's military campaign: maximize the total number of knights used during all the conquests. In this way, his subjects will learn that he doesn't care about them too much. As you are the king's trusted advisor, you can choose a set of <b>K<\/b> castles, that the king should conquer. George trusts you enough, so you are assured that he will conquer exactly the set of castles you chose. After you provide a set of castles, George will choose the order in which he will conquer them. You can assume that George always chooses the order which minimizes the total number of knights used during all the conquests.<\/p>\r\n<p>Your task is to find the maximum possible total number of knights that can be used during the campaign and reached by delegating a set of <b>K<\/b> castles to conquer. Also, you are not sure about the value of <b>K<\/b>, so you should find the optimal answer for each <b>K = 1, 2, ... , N<\/b>.<\/p>\r\n<h3>Input<\/h3>\r\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows.<\/p>\r\n<p>The first line of a test case description contains a single integer <b>N<\/b>.<\/p>\r\n<p>The second line of the description contains <b>N<\/b> integers, where the <b>i<\/b><sup>th<\/sup> denotes <b>A<sub>i<\/sub><\/b>.<\/p>\r\n<p>The third line of the description contains <b>N<\/b> integers, where the <b>i<\/b><sup>th<\/sup> denotes <b>B<sub>i<\/sub><\/b>.<\/p>\r\n<h3>Output<\/h3>\r\n<p>For each test case, output a single line containing <b>N<\/b> integers: the maximal possible total number of knights used during all the campaign for each <b>K = 1, 2, ... , N<\/b>.<\/p>\r\n<h3>Constraints<\/h3>\r\n<ul>\r\n<li>1 ≤ <b>T<\/b> ≤ 10<\/li>\r\n<li>1 ≤ <b>N<\/b> ≤ 5000<\/li>\r\n<li>0 ≤ <b>A<sub>i<\/sub><\/b>, <b>B<sub>i<\/sub><\/b> ≤ 10<sup>9<\/sup><\/li>\r\n<\/ul>\r\n<h3>Example<\/h3>\r\n<pre><b>Input:<\/b>\r\n2\r\n4\r\n3 1 1 5\r\n4 5 3 4\r\n5\r\n4 6 4 4 3\r\n9 6 7 9 8\r\n\r\n<b>Output:<\/b>\r\n5 12 21 31\r\n6 17 36 61 91\r\n\r\n<\/pre>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"5","source_sizelimit":"50000","problem_author":"kostya_by","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #D0011B;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>7&#9733;<\/span><span>kostya_by<\/span>","problem_tester":"shangjingbo","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>shangjingbo<\/span>","date_added":"28-11-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/cook62'>\n                    cook62\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/dynamic-programming'>\n                    dynamic-programming\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy-medium'>\n                    easy-medium\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/greedy'>\n                    greedy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/kostya_by'>\n                    kostya_by\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/REIGN2","user":{"username":null},"time":{"view_start_date":1442773706,"submit_start_date":1442773706,"visible_start_date":1442773800,"end_date":1735669800,"current":1493557875},"todo":false,"problem_status":"unattempted"}