
{"category_name":"medium","status":"success","problem_code":"SNOWMAN","problem_name":"Do You Want to Build a Snowman","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>On a snowy afternoon, your friend Ajay came to your house with a large pile of snowballs. You both were bored and it was freezing outside. So, you two decided to play a game. Suppose, initially there are $n$ snowballs in the pile. You get the first turn and take at least one snowball from the pile if it is possible by rules. Then Ajay has his turn to also take some snowballs. However, there are some rules you both agreed on:\n\n- Two players take their turns alternately.\n- In the very first turn (first turn of first player), a player cannot empty the pile.\n- A player must take at least one snowball and he cannot take more than two times what his opponent took in his last turn.\n- The player who can empty the pile wins the game.\n\nIf you can win the game, you get all the snowballs and build a beautiful snowman. Can you do that? Remember, your friend Ajay is very clever and will play optimally.\n\n###Input\n- The input consists of multiple problem instances. \n- For each instance, there is an integer $n$ in a separate line representing the number of snowballs in the pile. \n- 0 determines the end of input. \n- There will be maximum 1000 instances to solve. \n- For any instance, $0 < n < 10^{10}$\n\n###Output\nFor each instance, output either of the following in a single line:\n- “L” if you cannot win the game provided that your friend follows the best strategy. \n- The number of snowballs you will take from the pile in the very first turn if there is a winning strategy.  If there are multiple answers, output the smallest answer.\n- “D” If nobody can win.\n\n###Sample Input\n```\n3\n5\n15\n27\n0 \n```\n\n###Sample Output\n```\nL\nL \n2 \n1\n```","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin3","problem_author_html_handle":"admin3","problem_tester":null,"problem_tester_html_handle":"","date_added":"20-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin3'>admin3<\/a>","time":{"view_start_date":1545503400,"submit_start_date":1545503400,"visible_start_date":1545503400,"end_date":1735669800,"current":1559472982},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}