{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>\nThe bustling town of Siruseri has just one sports stadium. There\nare a number of schools, colleges, sports associations, etc. that\nuse this stadium as the venue for their sports events. <\/p>\n\n<p> Anyone interested in using the stadium has to apply to the Manager\nof the stadium indicating both the starting date (a positive integer\nS) and the length of the sporting event in days (a positive integer D)\nthey plan to organise.  Since these requests could overlap it may not\nbe possible to satisfy everyone.  <\/p>\n\n<p>\nIt is the job of the Manager to decide who gets to use the\nstadium and who does not. The Manager, being a genial man, would like\nto keep as many organisations happy as possible and hence would\nlike to allocate the stadium so that maximum number of events are held.\n<\/p>\n\n<p>\nSuppose, for example, the Manager receives the following 4 requests: \n<\/p>\n<table>\n<tr>\n<td>Event No.<\/td>\n<td>Start Date<\/td>\n<td>Length<\/td>\n<\/tr>\n<tr><td>1<\/td><td>2<\/td><td>5<\/td><\/tr>\n<tr><td>2<\/td><td>9<\/td><td>7<\/td><\/tr>\n<tr><td>3<\/td><td>15<\/td><td>6<\/td><\/tr>\n<tr><td>4<\/td><td>9<\/td><td>3<\/td><\/tr>\n<\/table>\n<p>\nHe would allot the stadium to events 1, 4 and 3. Event 1 begins on day 2\nand ends on day 6, event 4 begins on day 9 and ends on day 11 and event\n3 begins on day 15 and ends on day 20. You can verify that it is not possible\nto schedule all the 4 events (since events 2 and 3 overlap  and only one of \nthem can get to use the stadium).\n<\/p>\n\n<p>\nYour task is to help the manager find the best possible allotment (i.e.,\nthe maximum number of events that can use the stadium).\n<\/p>\n\n<p>Input format<\/p>\n\n\n<p>\nThe first line of the input will contain a single integer N (N     100000)\nindicating the number of events for which the Manager has received a request.\nLines 2,3,...,N+1  describe the requirements of the N events.  \nLine i+1 contains two integer Si and Di indicating the starting date \nand the duration of event i. You may assume that 1     Si     1000000 and \n1     Di     1000.\n\n<\/p>\n\n<p>Output format<\/p>\n\n<p>\nYour output must consist of a single line containing a single integer M,\nindicating the maximum possible number of events that can use the stadium.\n<\/p>\n<p>Example:<\/p>\n\n<p>Sample input:<\/p>\n\n<pre>\n4\n2 5\n9 7\n15 6\n9 3\n<\/pre>\n\n<p>Sample output:<\/p>\n\n<pre>\n3\n\n<\/pre>    ","languages_supported":"NA","title":"STADIUM","category":"NA","old_version":true,"problem_code":"STADIUM"}