{"category_name":"medium","status":"success","problem_code":"TEAMSIZE","problem_name":"Team Formation","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>\nBattle of the Chefs is coming up! It's a contest where different teams of different Chefs compete against each other. Our Chef wants to send one of the best teams from his entire staff. Selecting a good team is not about having the best people, but it is about having members who can cooperate and work well with each other. Chef is very aware of this fact. So he chooses the following strategy to decide a team. He lines up all his <b>N<\/b> cooks in a line. Each of these cooks has a skill level associated with him. Denote the level of the <b>i<\/b>-th cook as <b>skill[i]<\/b> for <b>1<\/b> ≤ <b>i<\/b> ≤ <b>N<\/b>. Let us make a few points on a team formation.\n<\/p>\n\n<p>\n<ul>\n<li>A team can have any number of cooks.<\/li>\n<li>Each team should consist of consecutive cooks. So, for example, cooks with positions 3, 4, 5 can form a team, but cooks with positions 4, 5, 7, 8 can not.<\/li>\n<li>A team is a <i>candidate team<\/i> if the difference between the maximum skill and the minimum skill of the cooks in the team does not exceed the threshold <b>C<\/b>.<\/li>\n<li>A cook can be in 0 or more <i>candidate teams<\/i>. Which means that <i>candidate teams<\/i> can intersect.<\/li>\n<li>Two <i>candidate teams<\/i> are considered to be different if there exists at least one cook who is in one team but not in the other.<\/li>\n<\/ul>\n<\/p>\n\n<p>\nChef has not yet decided the team of what size he is going to send to the battle. To be precise we note, that the team size is the total number of cooks in it. For the given team size Chef wants to consider all candidate teams of this size according to the rules described above, evaluate them for himself and choose the best one. Denote the total number of candidate teams for the given size <b>K<\/b> as <b>cand[K]<\/b>. To increase the chances of choosing better team he wants the number of candidate teams to be as large as possible. But Chef is a human and can't evaluate too many teams. The maximal number of teams he can evaluate depends on many factors such as his mood or fatigue. We call it the Chef's limit. Denote the current Chef's limit as <b>M<\/b>. Since Chef still wants the total number of candidate teams to be as large as possible you need to find the team size <b>K<\/b> such that <b>cand[K] ≤ M<\/b>, among all such <b>K<\/b> find the value for which <b>cand[K]<\/b> is maximal and if such <b>K<\/b> is not unique find the minimal <b>K<\/b> among them. Since Chef's limit always changes according to his mood or fatigue you should find the required team size for several values of <b>M<\/b>. Chef also wants to know the total number of candidate teams for the size you will find. There will be <b>Q<\/b> values of <b>M<\/b> in all.\n<\/p>\n\n<p>\nIn order to keep the input small the skills of the cooks will be given in the following way.<br \/>\n<ul>\n<li>Skills of the first <b>X<\/b> cooks are given in the input, where <b>X = min(10000, N).<\/b><\/li>\n<li>If <b>N<\/b> &gt; <b>10000<\/b> skills of the remaining cooks for <b>10000<\/b> &lt; <b>i<\/b> ≤ <b>N<\/b> are calculated as\n\n<b>skill[i]<\/b> = (<b>A<\/b> * <b>skill[i-1]<\/b> + <b>B<\/b> * <b>skill[i-2]<\/b> + <b>D<\/b>) <b>mod 2<sup>30<\/sup><\/b>,\n\nwhere <b>A<\/b>, <b>B<\/b> and <b>D<\/b> are given in the input. Here <b>mod<\/b> denotes the modulo operation, that is, <b>Y mod Z<\/b> is the remainder of division of <b>Y<\/b> by <b>Z<\/b>.<\/li>\n<\/ul>\n<\/p>\n\n\n<h3>Input<\/h3>\n\n<p>\nThe first line of the input contains a single integer <b>T<\/b>, the number of test cases to follow.\nEach test case consists of 3 lines.\nThe first line contains 6 space-separated integers <b>N, C, Q, A, B<\/b> and <b>D<\/b>.\nThe second line contains <b>X = min(N, 10000)<\/b> space-separated integers, <b>i<\/b>-th integer among them represents the skill of the <b>i<\/b>-th cook, that is, the number <b>skill[i]<\/b>.\nThe third line contains <b>Q<\/b> space-separated integers, the values of <b>M<\/b> for which you need to find the optimal team size and the number of candidate teams of this size.\n<\/p>\n\n<h3>Output<\/h3>\n<p>\nFor each test case, output <b>Q<\/b> lines containing the optimal team size for the corresponding value of <b>M<\/b> and the number of candidate teams corresponding to this team size separated by a space.\n<\/p>\n\n<h3>Constraints<\/h3>\n<p>\n<b>1<\/b> ≤ <b>T<\/b> ≤ <b>5<\/b>\n<b>1<\/b> ≤ <b>N<\/b> ≤ <b>500000<\/b>\n<b>0<\/b> ≤ <b>C<\/b> &lt; <b>2<sup>30<\/sup><\/b>\n<b>1<\/b> ≤ <b>Q<\/b> ≤ <b>1000<\/b><br \/>\n<b>0<\/b> ≤ <b>A<\/b>, <b>B<\/b>, <b>D<\/b> &lt; <b>2<sup>30<\/sup><\/b>\n<b>0<\/b> ≤ <b>skill[i]<\/b> &lt; <b>2<sup>30<\/sup><\/b> for <b>1<\/b> ≤ <b>i<\/b> ≤ <b>X<\/b>\n<b>1<\/b> ≤ <b>M<\/b> ≤ <b>N<\/b>\n<\/p>\n\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n2\n6 3 3 1 1 1\n6 2 4 5 6 3\n4 3 6\n6 10 1 2 2 2\n1 1000 1 1000 1 1000\n4\n\n<b>Output:<\/b>\n2 4\n3 3\n1 6\n2 0\n<\/pre>\n\n<h3>Explanation<\/h3>\n\n<p>\n<b>Case 1.<\/b><br \/>\nWith team size 2, we have 4 candidate teams: {2, 4}, {4, 5}, {5, 6}, and {6, 3}. Here numbers denote the cooks' skills. With any other team size, the number of candidate teams is either less than 4 or greater than 4.\nSimilarly, with team size 3, we have 3 candidate teams, which are {2, 4, 5}, {4, 5, 6} and {5, 6, 3}.<br \/>\nWith team size 1, we have 6 candidate teams with one member in each team.\n<\/p>\n\n<p>\n<b>Case 2.<\/b><br \/>\nWith team size 1, we have 6 possible candidate teams. But 6 &gt; 4. For all other team sizes, the total number of candidate teams is 0. Thus, the answer is the smallest size among them, i.e., 2.\n<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"3","source_sizelimit":"50000","problem_author":"vamsi_kavala","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>vamsi_kavala<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"6-10-2011","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/deque'>\n                    deque\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/medium'>\n                    medium\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/oct12'>\n                    oct12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/vamsi_kavala'>\n                    vamsi_kavala\n                <\/a>","user":{"username":null},"time":{"view_start_date":1350293400,"submit_start_date":1350293400,"visible_start_date":1350293400,"end_date":1735669800,"current":1493557946},"todo":false,"problem_status":"unattempted"}