{"category_name":"challenge","status":"success","problem_code":"BX","problem_name":"Bubbles","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p><b>This problem was part of the <a href=\"http:\/\/www.codechef.com\/APRIL09\/\">CodeChef April Challenge<\/a>.  All user submissions for this contest problem are publicly available <a href=\"http:\/\/www.codechef.com\/APRIL09\/status\/BX\/\">here<\/a>.<\/b><\/p>\n\n<p><strong>The following a tie breaker problem.  The best solution will receive one point.  All other successful answers will be scored on a curve and receive a fraction of a point based on how close they come to the best answer.<\/strong><\/p>\n\n<p>Let's have some fun with soap bubbles... We drive several sticks vertically into a flat surface (so that they look like points from above), and spread a thin film of soap over all of them. The soap film tends to minimize the area of its surface, and eventually becomes very thin, with surfaces turning into lines spread over all points. When everything has settled down, we can assume that the \"bubble\" we have is in fact a set of line segments, which connect all of our sticks into one network (possibly via some intermediate points which can also be the endpoints of lines).\n\n<h3>Input<\/h3>\n<p>First, 1<=<var>n<\/var><=1000, the number of starting points to connect. Then, <var>n<\/var> pairs of numbers follow, representing the coordinates of sticks which the soap film will connect.\n\n<h3>Output<\/h3>\n<p>First, you should output the number <var>m<\/var> of intermediate points you create. Then, the next <var>m<\/var> pairs of numbers are coordinates of intermediate points.\nThen, you should output <var>e<\/var>, the number of soap-bubble lines you create. Then, the next 2*<var>e<\/var> numbers represent the indexes of points which are connected by the given line. Each index <var>i<\/var> should be a number 0<=<var>i<\/var> < <var>n<\/var>+<var>m<\/var>. If <var>i<\/var> < n, then it represents the <var>i<\/var>-th input point (stick). If <var>i<\/var>>=n, then it corresponds to the (<var>i<\/var>-<var>n<\/var>)-th intermediate point.\n\n\n\n<h3>Scoring<\/h3>\n<p>\nYour goal is to minimize the score obtained in this problem.\n\n<p>\nAs longer lines tends to get thinner, for each line segment of length t, you will receive t \/ max(1, ln(t)) penalty points, where \"ln\" is the logarithm in the natural base.\nYou will additionally receive ln(m+1) penalty points if your solution uses <var>m<\/var> intermediate points.\n<p>\nIf the soap film given at output does not span  all the input points (connecting them into a network), your solution will be judged as incorrect.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n3\n0.0 0.0\n0.0 3.0\n4.0 0.0\n\n<b>Output:<\/b>\n1\n1.0 1.0\n3\n0 3\n1 3\n2 3\n\n<b>Score:<\/b>\n7.090148\n<\/pre>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"0.117647","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"22-03-2009","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1240484339,"submit_start_date":1240484339,"visible_start_date":1240484210,"end_date":1735669800,"current":1525454453},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}