{"category_name":"challenge","status":"success","problem_code":"BYTEFOOD","problem_name":"Food Shortage in Byteland","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><P align=justify>\nFanatics from the BBFO blew up all the food factories in the Bytelandian capital! Hurry up! There is still some food left in shops. Some shops are located in the centre, others in the suburbs, so Johnny has to decide which of them are worth visiting. Some shops can be very big and have plenty of food in them, others may be so small that food dissappears from them at an alarming rate... So? Help Johnny buy as much food as possible. \n<br><br>\nThere are <i>n<\/i> open shops, each of them located at position (<i>x<sub>i<\/sub><\/i>,<i>y<sub>i<\/sub><\/i>), for <i>i<\/i>=1,...,<i>n<\/i>, where 0 <= <i>x<sub>i<\/sub><\/i>,<i>y<sub>i<\/sub><\/i> <= 250. The distances between shops are measured using the Manhattan metric (i.e. as sums of absolute values of differences of x and y coordinates). Besides, every shop is characterized by a linear time function describing how much food is left in the shop at the moment:<\/p>\n<p align=center><center><i>f<sub>i<\/sub><\/i> = <b>max<\/b>{0, <i>a<sub>i<\/sub><\/i> - <i>b<sub>i<\/sub><\/i> * <i>time<\/i>}<\/center><\/p><p align=justify>where 0 <= <i>a<sub>i<\/sub><\/i> <= 1000000, 0 <= <i>b<sub>i<\/sub><\/i> <= 1000, while <i>time<\/i> is the time (in minutes) that has elapsed from the moment Johnny left the house (assume that Johnny does not live in the same place as any shop). If Johnny decides to stay in a shop, he can buy at most <i>b<sub>i<\/sub><\/i> units of food per minute. Otherwise, he can move along the ortogonal system of streets of the city at a constant speed of unit distance per minute. Johnny only ever changes the action he is performing at the full minute. Because his family is slowly beginning to starve, he should be back at home not later than <i>m<\/i> minutes after he left. \nSince there are thousands of starving families in the capital, Johnny can't spent more that 1 <= <i>c<sub>i<\/sub><\/i> <= 10 minutes in a shop. Moreover, he will never go into the same shop twice for fear of being lynched...<\/p>\n<H3>Input<\/h3>\n<P align=justify>\nThe first line of input contains a single positive integer <i>t<\/i> <= 1000, the number of test cases.\n\nEach test case begins with the number of shops in the city 1 <= <i>n<\/i> <= 1000 and the deadline 1 <= <i>m<\/i> <= 5000.\n\nThen the following <i>n<\/i> lines consist of four integers <i>x<sub>i<\/sub> y<sub>i<\/sub> a<sub>i<\/sub> b<sub>i<\/sub> c<sub>i<\/sub><\/i> each, describing the position and the parameters of the function for food availability of the <i>i<\/i>-th shop. At the end of every test case comes a line with two integers<i>p q<\/i> (between 0 and 250), corresponding to the x and y coordinates of the position of Johnny's house.\n<br><br>All the input data are integers.\n<\/p>\n<H3>Output<\/h3>\n<P align=justify>\nProcess all test cases. The correct output for the <i>i<\/i>-th test case takes the following form:\n<br><i>i<\/i>\t[the number of the test case, in the input order]\n<br><i>s m<\/i> [<i>s<\/i> is the number of the target shop and <i>m<\/i> > 0 is the number of minutes spent in it]. \n<br>At the end of the series of moves you should always write a line conisting of two zeros ('0 0').\n<br><br>All the output data should be integers.\n<\/p>\n<H3>Scoring<\/h3>\n<P align=justify>\nThe score of your program is the total amount of food that Johnny bought (summed over all the testcases in which he managed to come back home before the deadline).\n<\/p>\n<H3>Example<\/h3>\n<P align=justify>\n<pre>\n<b>Input<\/b>\n4\n2 20\n0 0 100 5 5\n10 0 200 10 10\n5 0\n2 20\n0 0 180 15 10\n10 0 200 20 10\n5 0\n4 101\n0 0 1000 20 5\n20 0 200 1 5\n0 20 5000 200 5\n20 20 300 5 10\n10 10\n1 15\n1 0 10 1 5\n5 0\n\n<b>Output<\/b>\n1\n2 10\n0 0\n2\n1 10\n0 0\n3\n3 5\n4 10\n2 1\n0 0\n4\n1 5\n0 0\n\n<b>Score<\/b>\nScore = 1261\n<\/pre>\n<\/p> ","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1.45","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":null,"date_added":"1-12-2008","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1249546937,"submit_start_date":1249546937,"visible_start_date":1249546937,"end_date":1735669800,"current":1525199655},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}