{"category_name":"challenge","status":"success","problem_code":"CAVE","problem_name":"Mushroom Cave","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Chef is exploring a large cave looking for exotic mushrooms.\n\nIt is very dark in the cave, so Chef uses torches to help him see.\nTorches do not last forever, so as Chef explores the cave he must find new torches to light.\nSpecifically, once Chef picks up a torch, he may only travel K steps before it will burn out.\nIf Chef doesn't find another torch within K steps, he will likely be eaten by a grue.\nWhenever Chef finds a torch, he immediately lights it, and drops any currently held torch to the ground, rendering it unusable.\nChef wants to explore as much of the cave as possible before exiting.\nChef begins at the northwest corner of the cave and must end at the southeast corner.\n<\/p>\n<p>You will be given the layout of the cave, including the locations of all torches.\nYour task is to plot a route through the cave from the northwest corner to the southeast corner that visits as many distinct cells of the cave as possible.\nChef must be able to follow your route without running out of torch light.  Chef must also still have a burning torch when he finishes the route.\nNote that optimal routes are not required, and your submission will be scored relative to others' submissions.\nAny route that leads Chef from the northwest corner to the southeast corner will be accepted.\n<\/p>\n\n<h3>Input<\/h3>\n<p>Input will begin with an integer T, the number of test cases (between 3 and 10).\nEach test case begins with 3 integers M, N, K (M, N ≤ 100, 2 ≤ K ≤ 15).\nM and N are the dimensions of the cave, K is the duration of each torch.\nM lines follow of N characters each, describing the cave.\nRows proceed from north to south, and columns from west to east.\nA '.' character indicates an empty cell, a '#' character indicates an impassable cell, and a 't' character indicates a torch.\nThe cell in the northwest corner will always be a 't', and the cell in the southeast corner will never be '#'.\n<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case, output a string of 'N', 'W', 'S', and 'E' characters \n(corresponding to the cardinal directions <b>N<\/b>orth, <b>W<\/b>est, <b>S<\/b>outh, and <b>E<\/b>ast, respectively)\ngiving a route from the northwest corner to southeast.\nIt is guaranteed that at least one such route will exist.<\/p>\n\n<h3>Scoring<\/h3>\n<p>Your score for each test case is the total number of cells visited by your route\n(visiting the same cell multiple times only counts once toward the total) divided by the total number of passable cells.\nYour score for each file is the average of your scores on the individual test cases.\nYour overall score is the average of your scores on the individual test files.\n<\/p>\n\n<h3>Sample Input<\/h3>\n<pre><code>2\n4 5 3\nttttt\n.##..\n.t...\n##t..\n6 6 4\ntt#...\n...##t\n...tt.\n..t.t#\n....t.\n..t..t\n<\/code><\/pre>\n\n<h3>Sample Output<\/h3>\n<pre>SSEESEE\nSENSSSESSENNNWEEENSWSSESWE\n\n<\/pre>\n\n<p>\nThe score for the first test case is 8\/16=0.5.\nThe score for the second test case is 23\/32=0.71875.\nThe overall score is thus (0.5+0.71875)\/2=0.609375.\nNote that the solution to the first test case is unique (in particular, the solution \"EEEESSS\" is invalid because Chef would run out of torch light during his final step), but in the second test case there are many alternate solutions\n(including some that visit more than 23 distinct cells).\n<\/p>\n\n<h3>Test Case Generation<\/h3>\n<p>\nM and N are chosen randomly and uniformly between 10 and 100, inclusive,\nand K is chosen randomly and uniformly between 2 and 15.\nAdditionally, a real number D is chosen randomly and uniformly between .05 and .2, inclusive.\nEach cell is chosen as '#' with probability D, 't' with probability (1-D)\/K, and '.' with probability (1-D)*(K-1)\/K.\nIf no valid path exists from the northwest to southeast corner, the process is restarted with the same values of M, N, K, and D.\n<\/p>","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, SCALA, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, PERL6, TEXT, CLOJ, FS","max_timelimit":"0.85034","source_sizelimit":"50000","problem_author":"pieguy","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>pieguy<\/span>","problem_tester":"gamabunta","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #666666;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>1&#9733;<\/span><span>gamabunta<\/span>","date_added":"26-02-2011","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/challenge'>challenge<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/june11'>june11<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/pieguy'>pieguy<\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CAVE","time":{"view_start_date":1307944762,"submit_start_date":1307944762,"visible_start_date":1307944714,"end_date":1735669800,"current":1525199504},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}