{"category_name":"challenge","status":"success","problem_code":"GX","problem_name":"Mosaic","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Imagine a large mosaic made of glass.  It has the form of a large square, of size n x n, made up from unit squares of different types of glass. Different types of glass have different physical parameters, such as the speed of light in the material. \n\n<\/p><p>\nWe have a source of light in corner (0,0) and a light detector in corner (n,n). We would like to estimate as accurately as possible the path taken by a ray of light which is directed from the source and reaches the detector, knowing that of all the possible routes, the one chosen by light will be the one with the shortest travel time. \n<\/p><p>\nEach type of glass has 3 defining parameters, denoted o<sub>1<\/sub>,o<sub>2<\/sub>, and ang. In order to calculate the travel time of light along some straight line segment in one specific type of glass, we calculate the lengths l<sub>1<\/sub> and l<sub>2<\/sub> of the projections of this segment onto two perpendicular lines: onto the axis forming angle ang with the horizontal direction (X axis), and onto the axis perpendicular to it. Then, the travel time of light along the given segment is given as sqrt((l<sub>1<\/sub>*o<sub>1<\/sub>)<sup>2<\/sup>+(l<sub>2<\/sub>*o<sub>2<\/sub>)<sup>2<\/sup>).\n\n<h3>Input<\/h3>\n<\/p><p>First, 1500 ≤ n ≤ 2000, the size of mosaic. Then, n rows, n numbers in each, describing the o<sub>1<\/sub> values for each square, with the x-th number in the y-th line corresponding to the square with its top left-hand corner at (x,y). Then, in the same way, come n rows of n numbers defining values of parameter o<sub>2<\/sub>, and n rows of n numbers defining values of parameter ang. The angle is given in radians, and for each square we have, 0.1 ≤ o<sub>1<\/sub>,o<sub>2<\/sub> ≤ 100, 0 ≤ ang ≤ 2pi<\/p>\n<h3>Output<\/h3>\n<p>You should describe describe the route from (0,0) to (n,n) by outputting k (k ≤ 10<sup>6<\/sup>) and then the coordinates of k midpoints of the route (the points (0,0) and (n,n) should not be output). The route must follow the following rules: each segment between successive points of the route starts on a side of some unit square and ends on a side of this square, and the segment between them lies entirely within this unit square. Successive midpoints must be different from each other, route segments may not run along edges of unit squares, and are not allowed to lead outside of the mosaic.<\/p>\n<h3>Scoring<\/h3>\n<p>Your score is equal to the travel time of light along the fictional route defined by your solution (summed over all data sets). The goal is to minimize the obtained score.\n\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n2\n1.0 2.0\n3.0 1.0\n1.0 1.0\n1.0 1.0\n0 0.785398\n0.785398 0\n\n<strong>Output:<\/strong>\n2\n0.5 1\n1 1.5\n\n<strong>Score:<\/strong>\n3.650282\n\n<\/pre><\/p>","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1.47059","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-08-2009","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1252672785,"submit_start_date":1252672785,"visible_start_date":1252672785,"end_date":1735669800,"current":1525199664},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}