{"category_name":"challenge","status":"success","problem_code":"MX","problem_name":"Sorting device","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>You work for a large company, and your job is to design sorting devices. Devices are built from:<\/p>\n<ul>\n<li><var>n<\/var> inputs,<\/li>\n<li><var>n<\/var> outputs,<\/li>\n<li>gates which have two inputs and send to output the minimum (\"min gates\") or maximum (\"max gates\") of the two numbers given at their input,<\/li>\n<li>connecting wires.<\/li>\n<\/ul>\n<p>You are competing in a bid for a Bytelandian Ministry of Information contract to design the smallest possible device (in terms of the number of gates) which sorts any input. Each device will go through a rigorous test process on a number of data sets. However, through some Good Friends in High Places you have managed to acquire some additional information concerning the exact data sets (permutations) your device will be tested on. Make use of this, and of course your superior programming skills, to win the bid!<\/p>\n<h3>Input<\/h3>\n<p>First, two numbers, 2≤<var>n<\/var>≤20, 1≤<var>k<\/var>≤1000, the number of inputs and the number of different permutations for which your device will be tested. The next <var>k<\/var> lines contain permutations of the numbers <var>1 .. n<\/var>.<\/p>\n<h3>Output<\/h3>\n<p>First, output <var>p<\/var>, the number of gates in your device (0≤<var>p<\/var>≤10<sup>6<\/sup>). The next <var>p<\/var> lines should contain definitions of the gates used, in the form of a pair of integers, <var>x<sub>i<\/sub>,y<sub>i<\/sub><\/var>, and exactly one of the strings \"min\" or \"max\". To be able to use the output of a gate as the input of a subsequent gate, we use the following convention. First of all, the range for inputs <var>x<sub>i<\/sub><\/var> and <var>y<sub>i<\/sub><\/var> is as follows: 1 ≤ <var>x<sub>i<\/sub>,y<sub>i<\/sub><\/var> &lt; <var>n+p<\/var>. The output of the <var>i<\/var>-th gate is assumed to be input <var>n+i<\/var>.\n<p>\nFinally, a sequence of exactly <var>n<\/var> integers in the range <var>1<\/var>..<var>n+p<\/var> should follow, describing which of the \"inputs\" should be hard-wired to successive outputs of the device.<\/p>\n<h3>Scoring<\/h3>\n<p>If your program does not produce a sorting machine which works for every input (sorting it in ascending order), it will be deemed incorrect. Otherwise, you will score <var>p<\/var> penalty points for each test case solved.<\/p>\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong><br \/>3 2<br \/>1 2 3<br \/>1 3 2<br \/><br \/><strong>Output:<\/strong><br \/>2<br \/>2 3 min<br \/>2 3 max<br \/>1 4 5<br\/><br\/><strong>Score:<\/strong><br\/> 0.5<\/pre>","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-01-2010","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1265893919,"submit_start_date":1265893919,"visible_start_date":1265893919,"end_date":1735669800,"current":1525199668},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}