{"category_name":"challenge","status":"success","problem_code":"NX","problem_name":"The Best Tower","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>ByteTel, the largest mobile operator in Byteland, would like to find a place to construct a cellphone tower. There are N important places in Byteland that need to be considered.<\/p>\n<p>These N buildings can be represented by N points in a 2D plane. The cellphone tower can be represented by a circle, and in order to construct the tower, ByteTel needs to specify its center and radius.\n<\/p><p>Moreover, the center of the tower cannot be outside the secure area, which is also a circle.\n<\/p><p>ByteTel wants to find a center and radius for the tower such that <b>the total squared distance<\/b> between each of the building and the tower is as small as possible.\n<\/p><p>The distance between a point and a circle is defined to be the difference between the distance from the circle's center to the point and the circle's radius.\n<\/p><p>Your task is to help ByteTel find a center and radius for their cellphone tower.\n\n<h3>Input<\/h3>\n<\/p><p>The first line contains a number t (about 10), which is the number of test case. Each test case has the following form.<\/p>\n<p>The first line contains three numbers (X<sub>s<\/sub>, Y<sub>s<\/sub>) and R<sub>s<\/sub>, specifying the secure circle.\n<\/p><p>The second line contains N, the number of buildings (1 ≤ N ≤ 100).<\/p>\n<p>Each line in the next N lines contain two numbers which are the coordinates of a building.\n<\/p><p>All coordinates are integer and are between 0 and 10000 (inclusive).<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case, output 3 numbers (X,Y) and R, rounded to 3 decimal digits, which are the center and radius of the cellphone tower. \n\n<h3>Scoring<\/h3>\n<\/p><p>For each test case, your score is d\/D in which:\n<\/p><p>d is the total square distance between each of the building and the tower your program has found \n<\/p><p>D is the total square distance between each of the building and the secure circle's center.\n<\/p><p>Your program's score is the sum of each test case's score, the lower the better.\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n1\n\n1 1 4\n5\n3 -2\n2 1\n5 3\n4 3\n4 -1\n\n<b>Output:<\/b>\n4.000 1.000 2.000\n<\/pre>\n\n<\/p><p>The sample output's score is 0.023444. The secure circle is red and the tower is yellow.<\/p>\n\n<img src='https:\/\/www.spoj.pl\/content\/paulmcvn:circle.png' \/>","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1.5","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"5-02-2010","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1268736795,"submit_start_date":1268736795,"visible_start_date":1268736795,"end_date":1735669800,"current":1525454420},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}