{"category_name":"challenge","status":"success","problem_code":"SPELL","problem_name":"The Spelling Problem","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/NOV14\/mandarin\/SPELL.pdf\">Mandarin Chinese <\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/NOV14\/russian\/SPELL.pdf\">Russian<\/a>.<\/h3>\n<p>Fedya and Alex are OI-ers. They live in different cities, but they like to write letters to each other, in which they discuss complicated data structure problems, contests, nice girls\/ boys, animes and other not so important things.<\/p>\n<p>Nevertheless, there is a problem, arising sometimes. Being quite young and impatient, Fedya is eager to send his just typed letter. Though everything is okay with it, but like any of us, Fedya sometimes makes some spelling mistakes in the typed text. Being a  perfectionist, Alex sometimes gets upset, when he sees mistakes in Fedya's letters.\n<\/p>\n<p>\nMore precisely, sometimes Fedya can following mistakes:<\/p>\n<ul>\n<li>to swap two letters;<\/li>\n<li>to skip a letter;<\/li>\n<li>to insert an irrelevant letter;<\/li>\n<li>to mistype a letter in some of the words.<\/li>\n<\/ul>\n<p><br \/>Though, he is an intelligent guy and he never makes more than <b>one<\/b> mistake in a single typed word.<\/p>\n<p>Fedya isn't really bad at spelling, so he will make mistakes in no more than 4% of the typed words.<\/p>\n<p>Alex is a nice guy. In order to upset less, he has decided to write a program that will correct Fedya's mistakes. But this appeared to be not an easy task for him. So we ask you to help Alex.<\/p>\n<p>Formally, you will be given a text. The text will be an English text with correct grammar and spelling. Somewhere in the text, the mistakes of some of the above kinds will be made. You need to provide the modified text that will contain as less mistakes as possible (see Grading section). In order to make our problem easier, we will give you a dictionary of English words. The most part of words will appear in the dictionary, but not all of them.<\/p>\n<h3>Input<\/h3>\n<p>The first line of input contains a single integer <b>D<\/b>, denoting the number of words in the dictionary. Then, <b>D<\/b> lines will follow, each will contain a dictionary word. The dictionary used is the same in all the test cases, and you can download it <a href=\"http:\/\/www.codechef.com\/download\/NOV14\/SPELL_dict.txt\">here<\/a>.<\/p>\n<p>Then there is a line, containing lowercase English text, consisting of words and numbers. All the punctuation but dots, exclamation and question marks, commas and apostrophes will be removed. All the sentences always ends with dots, but the dot can also be used in shortings (like Mr., Mrs.) and abbreviations.<\/p>\n<h3>Output<\/h3>\n<p>Output the corrected text in the same format as it is given to you in the input.<\/p>\n<h3>Grading<\/h3>\n<p>You will not get any \"Wrong Answer\" verdict in this problem. The scoring mechanism works as follows:<\/p>\n<ul>\n<li>First, we split your output into the consecutive words of non-space symbols, that can't be extended by adding a symbol to the left, or to the right.<\/li>\n<li>Then, we do a group-by-group comparison with the official outputs' groups.<\/li>\n<li>If the current group was correct in the input, but in your output it is incorrect, your score for the test case decreases by <b>1<\/b>.<\/li>\n<li>If the current group was incorrect in the input, but in your output it is correct, your score for the test cases increases by <b>3<\/b>.<\/li>\n<li>We compare only the first <b>min{the number of groups in your output; the number of groups in the official output}<\/b> groups of symbols. So, you can output not all the text - that will possibly not enable you to score as much points as possible, but if you find it convenient, you can use it.<\/li>\n<li>If your score for the test case is lower than <b>0<\/b>, it will be increased to <b>0<\/b>.<\/li>\n<li>Your initial score for each test case equals to <b>100<\/b>. So, if you don't change the text at all, you will still receive some positive amount of points.<\/li>\n<\/ul>\n<p>As you can easily see, you should leave all the punctuation on its' places.\n <\/p>\n<h3>Test Data Generation<\/h3>\n<p>All the texts, given to you will be basically normal English texts (of any style) with mistakes in some words. The amount of mistaken words is about 4%. Basically, you should treat the mistakes as the one that had been made by a human.<\/p>\n<p>Some test data sizes information:<\/p>\n<ul>\n<li>The <b>10%<\/b> of the test data will have the text of the size of approximately <b>10 MB<\/b>.<\/li>\n<li>The additional <b>40%<\/b> of the test data will have the text of the size of <b>1<\/b> to <b>3 MB<\/b>.<\/li>\n<li>The rest of the test data has texts of the size below <b>1 MB<\/b>.<\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n[dictionary declaration is omitted in this sample case]\nthus is the sample text.\n\n<b>Output:<\/b>\nthis is the sample text.\n<\/pre><p> <\/p>\n<h3>Explanation<\/h3>\n<p>This answer will get a score of <b>103<\/b> points.<\/p>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, SCALA, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, PERL6, TEXT, CLOJ, FS","max_timelimit":"3","source_sizelimit":"50000","problem_author":"xcwgf666","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","problem_tester":null,"problem_tester_html_handle":null,"date_added":"7-10-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/challenge'>challenge<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/nov14'>nov14<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/xcwgf666'>xcwgf666<\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/SPELL","time":{"view_start_date":1416216600,"submit_start_date":1416216600,"visible_start_date":1416216600,"end_date":1735669800,"current":1528985566},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}