{"category_name":"challenge","status":"success","problem_code":"STORO","problem_name":"Rotation Puzzle","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Recently, with the release of the ultimate computing device bytePad, a platform game with the simple name \"Rotation Puzzle\" immediately became a phenomenon among Bytelandians. The game is extremely simple, yet quite additive. Here's the rule:\n<p>Given a MxN rectangular grid in which each cell contains a unique number from 1 to MxN. In each step, the player can pick any 2x2 subgrid and perform a rotation (whether clockwise or counterclockwise).\n<p>The task is to transform from the initial grid to the final configuration, using as few steps as possible.\n<p>The final configuration is the configuration<\/p>\n<table>\n<tr>\n<td>1<\/td>\n<td>2<\/td>\n<td>...<\/td>\n<td>n<\/td>\n<\/tr>\n<tr>\n<td>n+1<\/td>\n<td>n+2<\/td>\n<td>...<\/td>\n<td>2n<\/td>\n<\/tr>\n<tr>\n<td>...<\/td>\n<td>...<\/td>\n<td>...<\/td>\n<td>...<\/td>\n<\/tr>\n<tr>\n<td>(m-1)n+1<\/td>\n<td>(m-1)n+2<\/td>\n<td>...<\/td>\n<td>mn<\/td>\n<\/tr>\n<\/table>\n<p>You may have guessed why this game is addictive: it requires a tremendous visualization skill!\n\n<h3>Input<\/h3>\n<p>The first line contains a number T (about 5000), which is the number of test cases. Each test case has the following form.\n<p>The first line contains two numbers M and N (2 <= M, N <= 33).\n<p>The next M lines contains the description of the grid.\n<p>Each test case's input is separated by a blank line.\n<p>It is guaranteed that each input data has a solution.\n\n<h3>Output<\/h3>\n<p>For each test case, output the result in the following format.\n<p>The first line contains a number K, the number of steps you need to solve the puzzle. K must not exceed 10000.\n<p>Each line of the next K lines contain three numbers c, i, j (c=0 or c=1, 1<=I < M, 1 <= J < N). (i,j) is the top-left coordinate of the 2x2 square that is need to be rotated. c=1 if the rotation if clockwise and c=0 if the rotation is counter-clockwise.\n<p>Prints a blank link after each test case's output.\n\n<h3>Scoring<\/h3>\nGiven m and n, we pick a random positive integer K* and starting from the final configuration, we perform a random operation K* times to generate the test case. \nFor each test case, your score is K*\/K. \nHigher score is\nbetter.\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n2\n\n2 3\n1 5 2\n4 6 3\n\n2 3\n5 6 2\n1 4 3\n\n<b>Output:<\/b>\n1\n0 1 2\n\n2\n1 1 1\n0 1 2\n<\/pre>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, kotlin, PERL6, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1.49","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"6-04-2010","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/STORO","time":{"view_start_date":1273669494,"submit_start_date":1273669494,"visible_start_date":1273669494,"end_date":1735669800,"current":1525199677},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}