{"category_name":"challenge","status":"success","problem_code":"TILT","problem_name":"Table Tilt","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Chef recently discovered a game called \"Table Tilt\".<br \/>\nThe game consists of a rectangular table which has several holes in it, and several balls placed on the table.<br \/>\nThe goal is to tilt the table so that the balls will roll into the holes.<br \/>\nThe edges of the table are blocked so that a ball cannot fall off the edge of a table.<br \/>\nBy careful tilting of the table, Chef is able to precisely control the movement of the balls.<br \/>\nChef controls the tilting so that each second, each ball will simultaneously attempt to<br \/>\nroll 1 unit in the same direction parallel to an edge of the table.<br \/>\nA ball will fail to move if doing so would cause it to fall off the table,<br \/>\nor if doing so would result in 2 balls in the same location after the move.<\/p>\n<p>There are different types of balls, and they have different effects when they roll into a hole.<br \/>\nThe ball types, along with their shorthand notations, and effects, are as follows:<\/p>\n<ul>\n<li>Neutral (=): no effect<\/li>\n<li>Positive (+): score increases by 5<\/li>\n<li>Negative (-): score decreases by 5<\/li>\n<li>Inverter (%): all positive balls become negative, and vice versa<\/li>\n<\/ul>\n<p>Additionally, the score decreases by 1 every second until all of the balls have rolled into holes,<br \/>\nat which point the game ends.<br \/>\nNote that multiple balls may roll into holes simultaneously.<br \/>\nIn this case, inverter balls are processed last.<br \/>\nThat is, if a negative ball and an inverter ball simultaneously roll into holes, the score is decreased by 5 before the<br \/>\nremaining negative balls become positive.<br \/>\nAdditionally, inverter balls are processed one at a time,<br \/>\nso if 2 inverter balls simultaneously roll into holes there is no net effect.\n<\/p>\n<p>Since Chef has mastered his tilting skill, he now needs strategy to improve his score.<br \/>\nHe has tasked you with finding a sequence of tilts that gives a good score.<br \/>\nChef is in a good mood and is not demanding an optimal sequence of tilts,<br \/>\nbut merely requires you find one that yields a positive score<br \/>\n(of course, the higher the score, the more appreciative Chef will be).<\/p>\n<h3>Input<\/h3>\n<p>Input begins with an integer T, the number of test cases.<br \/>\nEach test case begins with 2 integers H and W on a line, giving the height and width, respectively,<br \/>\nof the table.<br \/>\nH lines follow of W characters each, giving the initial layout of the table.<br \/>\nA '*' character indicates a hole.<br \/>\nAll other characters will be '=', '+', '-', or '%',<br \/>\nindicating neutral, positive, negative, and inverter balls, respectively.\n<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output a single line with a sequence of 'U', 'L', 'D', and 'R' characters,<br \/>\ncorresponding to tilts up, left, down, and right, respectively.<br \/>\nThis sequence of tilts must be one that completes the game with a positive score.<\/p>\n<h3>Scoring<\/h3>\n<p>Your total score is the sum of the scores for the individual test cases.<br \/>\nNote that if the score for any individual test case is non-positive, the submission will be judged \"Wrong Answer\".\n<\/p>\n<h3>Sample Input<\/h3>\n<pre><code>2\n3 3\n%+-\n=*+\n-=+\n3 4\n+==-\n--%*\n+%-*\n<\/code><\/pre><h3>Sample Output<\/h3>\n<pre>LDRDLRULR\nRDLRRRDR\n\n\n<\/pre><p>\nThe score for the first test case after each tilt is: 4, 8, 7, 6, 10, 9, 8, 2, 6.<br\/><br \/>\nThe score for the second test case after each tilt is: -6, -2, -3, 1, 5, 14, 13, 12.<br\/><br \/>\nThe total score is therefore 18.<br \/>\nNote that better scores may be possible, but the only requirement is that the score be positive.\n<\/br\/><\/br\/><\/p>\n<h3>Test Case Generation<\/h3>\n<p>\nFor each official input file, T is 5.<br \/>\nFor each test case, H and W are chosen randomly and uniformly between 8 and 20.<br \/>\nEach cell of the table is chosen with the following probabilities:\n<ul>\n<li>Hole: 2%<\/li>\n<li>Inverter ball: 2%<\/li>\n<li>Neutral ball: 32%<\/li>\n<li>Positive ball: 32%<\/li>\n<li>Negative ball: 32%<\/li>\n<\/ul>\n<\/p><p>Furthermore, it is guaranteed there will be at least one hole and one inverter ball.\n<\/p>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, SCALA, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, PERL6, TEXT, CLOJ, FS","max_timelimit":"2.9703","source_sizelimit":"50000","problem_author":"pieguy","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>pieguy<\/span>","problem_tester":"gamabunta","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #666666;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>1&#9733;<\/span><span>gamabunta<\/span>","date_added":"4-08-2011","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/challenge'>challenge<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/pieguy'>pieguy<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/sep11'>sep11<\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/TILT","time":{"view_start_date":1315733823,"submit_start_date":1315733823,"visible_start_date":1315733606,"end_date":1735669800,"current":1525454470},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}