{"category_name":"challenge","status":"success","problem_code":"WAREHOUS","problem_name":"Warehouseman (Challenge)","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problems statements in <a href=\"http:\/\/www.codechef.com\/download\/translated\/JUNE18\/mandarin\/WAREHOUS.pdf\" target=\"_blank\">Mandarin chinese<\/a>, <a href=\"http:\/\/www.codechef.com\/download\/translated\/JUNE18\/russian\/WAREHOUS.pdf\" target=\"_blank\">Russian<\/a> and <a href=\"http:\/\/www.codechef.com\/download\/translated\/JUNE18\/vietnamese\/WAREHOUS.pdf\" target=\"_blank\">Vietnamese<\/a> as well.<\/h3>\n\nIn order to save money, Chef has started buying bulk shipments of shelf-stable foods when they're on sale, then storing them in a warehouse until needed. This saves a lot of money, but Chef is having trouble managing the warehouse and needs your help getting shipments in and out of it.\n\nChef's warehouse is a grid with $R$ rows and $C$ columns. There is a single entrance to the warehouse in the northwest corner. Rows run from west to east and columns run from north to south, so e.g. north is the direction of decreasing row number.\n\nA single forklift is used to move shipments around the warehouse. The forklift occupies one cell in the warehouse (initially, the northwest corner cell), and each shipment also occupies one cell in the warehouse. The forklift can carry up to one shipment at a time, and while carrying a shipment, the forklift and that shipment occupy the same cell. The forklift can move in any of the four cardinal directions, but it must stay in the warehouse and cannot occupy the same cell as a shipment it does not currently carry. When the forklift is not carrying a shipment, it can pick up a newly arrived shipment from the entrance (such a shipment does not occupy any cell until it is picked up), or it can load a shipment from an adjacent cell. When the forklift is carrying a shipment, it can drop it off at the entrance (a shipment does not occupy any cell after being dropped off) or unload it to an adjacent empty cell.\n\nThere are $R\\cdot C - 1$ shipments numbered $1$ through $R\\cdot C - 1$. The shipments will arrive in some order given on the input, and they must be picked up in this order and placed into the warehouse one at a time. Then, the shipments must be retrieved from the warehouse and dropped off at the entrance, in the order from $1$ to $R\\cdot C - 1$. You must produce a sequence of instructions for the forklift operator. The shorter the sequence of instructions you produce, the better.\n\nThe types of forklift instructions are as follows:\n- **'N'**, **'W'**, **'S'**, **'E'**: Move one cell north, west, south, or east, respectively. The destination cell must be inside the warehouse and must not contain any shipment.\n- **'P'**: Pick up a shipment. The forklift must be at the warehouse entrance and it must not be currently carrying a shipment. After performing this instruction, the forklift will be currently carrying the shipment it picked up — the next element from the sequence of incoming shipments. This instruction cannot be performed after all arriving shipments have been picked up.\n- **'D'**: Drop off a shipment. The forklift must be at the warehouse entrance and it must be carrying a shipment. This instruction cannot be performed before all incoming shipments have been picked up or after all shipments have been dropped off. A dropped off shipment cannot be picked up.\n- **\"Lx\"**: Load a shipment from a side-adjacent cell. The character $x$ must be one of 'N', 'W', 'S', 'E', and it indicates the direction of the cell to load the shipment from. For example, to load a shipment from the cell to the north of the forklift, use 'LN'. The forklift must not be currently carrying a shipment and there must be a shipment at the specified cell. The forklift remains in its current cell after this instruction, but is now carrying the shipment it loaded.\n- **\"Ux\"**: Unload a shipment to a side-adjacent cell. The character $x$ must again be one of 'N', 'W', 'S', 'E', and it indicates the direction of the cell to unload the shipment to. For example, to unload a shipment to the cell to the north of the forklift, use 'UN'. The forklift must be currently carrying a shipment and there must not be a shipment at the specified cell. The forklift remains in its current cell after this instruction, but the unloaded shipment is now in the specified cell.\n\n### Input\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains two space-separated integers $R$ and $C$.\n- The second line contains $R\\cdot C - 1$ space-separated integers — a permutation of the numbers $1$ through $R \\cdot C - 1$ denoting the order in which the shipments arrive.\n\n### Output\nFor each test case, print a single line containing one string — the concatenation of all your instructions for the forklift operator. The length of this string must not exceed $500,000$ characters. Your answer will be considered correct if by following your instructions, the forklift picks up all the shipments and then drops them off in the correct order, returning to the northwest corner.\n\nIt is guaranteed that a valid sequence of instructions always exists under the given constraints.\n\n### Constraints \n- $T = 5$\n- $6 \\le R,C \\le 20$\n- the last shipment to arrive is not shipment number $1$\n\n### Example Input\n```\n1\n2 3\n3 1 2 4 5\n```\n\n### Example Output\n```\nPSEUENWPUSPEUSWPEUEWLSUEPUSLEDELSWDESLENWDELEWDLSD\n```\n\n### Explanation\nNote that the example input does not conform to the constraints, but it does not appear in the actual test data.\n\n**Example case 1:** Let us denote the northwest corner cell by $(0,0)$ and the southeast corner cell by $(2,1)$. The example output can be broken down into the following steps:\n- \"PSEUE\": Pick up shipment 3 and unload it into cell $(2,1)$.\n- \"NWPUS\": Move to the entrance, pick up shipment 1 and unload it into $(0,1)$.\n- \"PEUS\": Pick up shipment 2 and unload it into $(1,1)$.\n- \"WPEUE\": Pick up shipment 4 and unload it into $(2,0)$.\n- \"WLSUE\": Load shipment 1 from $(0,1)$, then unload it into $(1,0)$.\n- \"PUS\": Pick up shipment 5 and unload it into $(0,1)$.\n- \"LED\": Load shipment 1 from $(1,0)$, move to the entrance and drop it off.\n- \"ELSWD\": Load shipment 2 from $(1,1)$ and drop it off.\n- \"ESLENWD\": Load shipment 3 from $(2,1)$ and drop it off.\n- \"ELEWD\": Load shipment 4 from $(2,0)$ and drop it off.\n- \"LSD\": Load shipment 5 from $(0,1)$ and drop it off.\n\n### Scoring\nYour score for each test case is $(S+2)\/(R+C-1) - 2\\cdot R\\cdot C + 20$, where $S$ is the length of your output string. Your score for each test file is the average of your scores for the individual test cases. Your score for the problem is the sum of your scores for all test files.\n\nFor the sample output, the score would be $(50+2)\/(2+3-1) - 2\\cdot2\\cdot3 + 20 = 21$.\n\n### Test Generation Process\nThere are twenty test files. During the contest, the displayed score will account for exactly two test files, i.e. your score reflects your submission's performance on 10% (1\/10) of the test files. However, if your program gets a non-AC verdict on any test file, your submission's verdict will be non-AC. In other words, an AC verdict denotes that your program runs successfully on all the test files. After the end of the contest, your score will be changed to the sum of your program's scores over the other eighteen test files.\n\nThe tests are generated using the following pseudocode. Assume that `random_int(x, y)` returns a uniformly randomly chosen integer between $x$ and $y$ inclusive and `random_shuffle(list)` replaces `list` by its uniformly randomly chosen permutation.\n```\n# 5 test cases in every file\nT = 5\nprint(T)\nfor i in 1...T:\n    R = random_int(6, 20)\n    C = random_int(6, 20)\n    print(R, C)\n    # permute shipments numbered 1 through R*C-1\n    shipments = [1, 2, ..., R*C-1]\n    while True:\n        random_shuffle(shipments)\n        # do not allow 1 to be last shipment\n        if shipments[R*C-1] != 1:\n            break\n    # print space-separated integers\n    print(shipments[1], ..., shipments[R*C-1])\n```\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"5","source_sizelimit":"50000","problem_author":"pieguy","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>pieguy<\/span>","problem_tester":"mgch","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>mgch<\/span>","date_added":"8-05-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/pieguy'>pieguy<\/a>","time":{"view_start_date":1528709405,"submit_start_date":1528709405,"visible_start_date":1528709405,"end_date":1735669800,"current":1528985566},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}