{
  "category_name": "school",
  "status": "success",
  "problem_code": "CHEFAPAR",
  "problem_name": "Chef and His Apartment Dues",
  "body": "<span class=\"solution-visible-txt\">All submissions for this problem are available.</span><h3> Read problems statements in <a target=\"_blank\" href=\"http://www.codechef.com/download/translated/FEB17/mandarin/CHEFAPAR.pdf\">Mandarin Chinese</a>, <a target=\"_blank\" href=\"http://www.codechef.com/download/translated/FEB17/russian/CHEFAPAR.pdf\">Russian</a> and <a target=\"_blank\" href=\"http://www.codechef.com/download/translated/FEB17/vietnamese/CHEFAPAR.pdf\">Vietnamese</a> as well.</h3>\n\n<p>Chef lives in a big apartment in Chefland. The apartment charges maintenance fees that he is supposed to pay monthly on time. But Chef is a lazy person and sometimes misses the deadlines. The apartment charges 1000 Rs per month as maintenance fees. Also, they also charge a one-time fine of 100 Rs for each of the late payments. It does not matter how late the payment is done, the fine is fixed to be Rs.100.</p>\n\n<p>Chef has been living in the apartment for <b>N</b> months. Now, he wants to switch the apartment, so he has to pay the entire dues to the apartment. The deadline for the <b>N</b>-th month is also over. From his bank statement, he finds the information whether he paid apartment rent for a particular month for not. You are given this information by an array <b>A</b> of size <b>N</b>, where <b>A<sub>i</sub></b> (can be either 0 or 1) specifies whether he has paid the 1000Rs in the <b>i</b>-th month or not. Assume that Chef paid the fees in the <b>i</b>-th month, then this fees will be considered for the earliest month for which Chef has not yet paid the fees.\n</p>\n\n<p>For example, assume Chef did not pay any money in first month and 1000Rs in the second month. Then this rent of 1000Rs will be considered for 1st month. But this counts as late payment for the first month's fees, and hence he will have to pay Rs. 100 for that. And since the payment he made in the second month is not accounted for the second month, but rather for the first month, he will incur a fine of Rs.100 even for the second month. \n</p>\n\n<p>He has not paid any of the fines so far. Can you please help in finding Chef total due (all the fines, plus all the unpaid maintenance fees) that he has to pay to apartment? </p>\n\n<h3>Input</h3>\n<p>First line of the input contains an integer <b>T</b> denoting number of test cases. The description of <b>T</b> test cases follows.</p>\n<p>The first line of each test cases contains an integer <b>N</b> denoting the number of months for which you have to calculate the total amount of money that Chef has to pay at the end of the <b>n</b> month to clear all of his dues.</p> \n<p>Next line of each test case contains <b>N</b> space separated integers (each of them can be either 0 or 1) denoting whether Chef paid the 1000Rs fees in the corresponding month or not. If the corresponding integer is 1, it means that Chef paid the maintenance fees for that month, whereas 0 will mean that Chef did not pay the maintenance fees that month.</p>\n\n<h3>Output</h3>\n<p>For each test case, output a single integer denoting the total amount including fine that Chef has to pay.</p>\n\n<h3><b>Constraints</b></h3>\n<ul>\n<li><b>1 ≤ <b>T</b> ≤ 25</b></li>\n<li><b>0 ≤ <b>A<sub>i</sub></b> ≤ 1</b></li>\n</ul>\n\n<h3>Subtasks</h3>\n<p>\n<b>Subtask #1 (30 points)</b>\n<ul>\n<li><b>1 ≤ <b>N</b> ≤ 10<sup>3</sup></b></li>\n</ul>\n</p>\n\n<p>\n<b>Subtask #2 (70 points)</b>\n<ul>\n<li><b>1 ≤ <b>N</b> ≤ 10<sup>5</sup></b></li>\n</ul>\n</p>\n\n<h3>Example</h3>\n<pre>\n<b>Input</b>\n4\n2\n1 1\n2\n0 0\n3\n0 1 0\n2\n0 1\n\n<b>Output</b>\n0\n2200\n2300\n1200\n</pre>\n\n<h3>Explanation</h3>\n<p><b>Example case 1.</b> Chef paid maintenance fees for both the months. So, he does not have any dues left.</p>\n<p><b>Example case 2.</b> Chef did not pay the maintenance fees for any of the months. For the first month, he has to pay 1000Rs, and 100Rs fine as a late payment. For second month payments, he just have to pay 1100Rs. So, in total he has a due of 1100 + 1100 = 2200 Rs.</p>\n<p><b>Example case 3.</b> In the first month, Chef did not pay his maintenance fees. He paid the maintenance of first in the second month. So, he paid a fine of 100Rs for first month. For second and third month, Chef did not pay the maintenance fees. So, he has to pay 1000Rs + 100Rs (of fine) for second month and only 1000Rs + 100Rs (of fine) for third month. In total, Chef has got to pay 100 + 1100 + 1100 = 2300 Rs. </p>\n<p><b>Example case 4.</b> In the first month, Chef did not pay his maintenance fees. He paid the maintenance of first in the second month. So, he paid a fine of 100Rs for first month. For second month, Chef did not pay the maintenance fees. So, he has to pay 1000Rs + 100Rs (of fine) for second month. In total, Chef has got to pay 100 + 1100 = 1200 Rs. </p>\n",
  "languages_supported": "ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC",
  "max_timelimit": "2",
  "source_sizelimit": "50000",
  "problem_author": "admin2",
  "problem_author_html_handle": "admin2",
  "problem_tester": "mgch",
  "problem_tester_html_handle": "<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #D0011B;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>7&#9733;</span><span>mgch</span>",
  "date_added": "1-02-2017",
  "tags": "<a class='problem-tag-small ' href='/tags/problems/admin2'>\n                    admin2\n                </a>",
  "user": {
    "username": null
  },
  "time": {
    "view_start_date": 1487496600,
    "submit_start_date": 1487496600,
    "visible_start_date": 1487496600,
    "end_date": 1735669800,
    "current": 1492506700
  },
  "todo": false,
  "problem_status": "unattempted"
}
