{"category_name":"school","status":"success","problem_code":"H1","problem_name":"A puzzle game","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Johnny has some difficulty memorizing the small prime numbers. So, his computer science teacher has asked him to play with the following puzzle game frequently.<\/p>\n<p>The puzzle is a 3x3 board consisting of numbers from 1 to 9. The objective of the puzzle is to swap the tiles until the following final state is reached:<\/p>\n<pre>\n1 2 3\n4 5 6\n7 8 9\n<\/pre>\n<p>At each step, Johnny may swap two adjacent tiles <b>if their sum is a prime number.<\/b> Two tiles are considered adjacent if they have a common edge.<\/p>\n<p>Help Johnny to find the shortest number of steps needed to reach the goal state.<\/p>\n\n<h3>Input<\/h3>\n<p>The first line contains t, the number of test cases (about 50). Then t test cases follow. Each test case consists of a 3x3 table describing a puzzle which Johnny would like to solve.<\/p>\n<p>The input data for successive test cases is separated by a blank line.<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case print a single line containing the shortest number of steps needed to solve the corresponding puzzle. If there is no way to reach the final state, print the number -1.<\/p>\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n2\n\n7 3 2 \n4 1 5 \n6 8 9 \n\n9 8 5 \n2 4 1 \n3 7 6  \n\n<b>Output:<\/b>\n6\n-1\n<\/pre>\n<h3>Output details<\/h3>\n<p>The possible 6 steps in the first test case are described in the following figure:<\/p>\n<img src='https:\/\/campus.codechef.com\/images\/problems\/h1.png' \/>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, kotlin, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"0.551667","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-09-2009","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1255253400,"submit_start_date":1255253400,"visible_start_date":1255253400,"end_date":1735669800,"current":1525198930},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}