
{"category_name":"school","status":"success","problem_code":"LIFELTD","problem_name":"Life Limited","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Recently the company Life Ltd created a new logo for themselves. You are asked to test the design of the logo. \n\nThe logo is a 3 * 3 square grid with 9 cells. Each cell contains some lower case english letter. This logo will be considered good if there exist three cells in the shape of an L that contain the letter 'l' (lower case 'L') in each of them. That is, there should be a cell with 'l', its cell directly beneath it should also have 'l' and the cell to the right of the second cell should also have 'l'.\n\nYour task is to tell whether the logo is good or not.\n\n\n### Input\n- The first line of the input contains an integer $T$ denoting the number of test cases. The description of the test cases follows.\n- Each of the next three lines contains a description of the logo, i-th of the line contains three characters which denote the i-th row of the logo. \n\n### Output\nFor each test case, output yes or no according to the answer to the problem.\n\n###Constraints\n- $1 \\le T \\le 100$\n\n### Example Input\n```\n3\nlaz\nlla\naaa\nala\nlla\naaa\nlll\nlll\nlll\n```\n\n### Example Output\n```\nyes\nno\nyes\n```\n\n###Explanation:\n**Testcase1**: The L shaped cells with 'l' in each of them is shown in bold here:\n\n**l**aa\n\n**ll**a\n\naaa","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"17-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>admin2<\/a>","time":{"view_start_date":1545157800,"submit_start_date":1545157800,"visible_start_date":1545157800,"end_date":1735669800,"current":1559472927},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}