
{"category_name":"school","status":"success","problem_code":"MEDIC","problem_name":"When to take medicine","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>You visit a doctor on a date given in the format $yyyy:mm:dd$. Your doctor suggests you to take pills every alternate day starting from that day. You being a forgetful person are pretty sure won’t be able to remember the last day you took the medicine and would end up in taking  the medicines on wrong days. \n\nSo you come up with the idea of taking medicine on the dates whose day is odd or even depending on whether $dd$ is odd or even. Calculate the number of pills you took on right time before messing up for the first time.\n\n###Note:\nEvery year that is exactly divisible by four is a leap year, except for years that are exactly divisible by 100; the centurial years that are exactly divisible by 400 are still leap years. For example, the year 1900 is not a leap year; the year 2000 is a leap year.\n\n###Input:\n\n- First line will contain $T$, number of testcases. Then the testcases follow. \n- Each testcase contains of a single line of input, in the format $yyyy:mm:dd$\n\n###Output:\nFor each testcase, output in a single line the required answer.\n\n###Constraints \n- $ 1 \\leq T \\leq 1000 $\n- $ 1900 \\leq yyyy \\leq 2038 $\n- $yyyy:mm:dd$ is a valid date\n\n###Sample Input:\n\t1\n\t2019:03:31\n\n###Sample Output:\n\t1\n\t\n###EXPLANATION:\nYou can take pill on the right day only on 31st March. Next you will take it on 1st April which is not on the alternate day.\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, R, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"vishal_nnd0","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>vishal_nnd0<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"16-04-2019","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/vishal_nnd0'>vishal_nnd0<\/a>","time":{"view_start_date":1556307900,"submit_start_date":1556307900,"visible_start_date":1556307900,"end_date":1735669800,"current":1559472929},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}