
{"category_name":"school","status":"success","problem_code":"PLAYPIAN","problem_name":"Play Piano","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Two sisters, A and B, play the piano every day. During the day, they can play in any order. That is, A might play first and then B, or it could be B first and then A. But each one of them plays the piano exactly once per day. They maintain a common log, in which they write their name whenever they play.\n\nYou are given the entries of the log, but you're not sure if it has been tampered with or not. Your task is to figure out whether these entries could be valid or not.\n\n### Input\n- The first line of the input contains an integer $T$ denoting the number of test cases. The description of the test cases follows.\n- The first line of each test case contains a string $s$ denoting the entries of the log.\n\n### Output\n- For each test case, output `yes` or `no` according to the answer to the problem.\n\n###Constraints\n- $1 \\le T \\le 500$\n- $2 \\le |s| \\le 100$\n- $|s|$ is even\n- Each character of $s$ is either 'A' or 'B'\n\n### Example Input\n```\n4\nAB\nABBA\nABAABB\nAA\n```\n\n### Example Output\n```\nyes\nyes\nno\nno\n```\n\n###Explanation\n\n**Testcase 1**: There is only one day, and both A and B have played exactly once. So this is a valid log. Hence 'yes'.\n\n**Testcase 2**: On the first day, A has played before B, and on the second day, B has played first. Hence, this is also a valid log.\n\n**Testcase 3**: On the first day, A played before B, but on the second day, A seems to have played twice. This cannot happen, and hence this is 'no'.","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"12-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>admin2<\/a>","time":{"view_start_date":1544985000,"submit_start_date":1544985000,"visible_start_date":1544985000,"end_date":1735669800,"current":1559472930},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}