{"category_name":"school","status":"success","problem_code":"SNELECT","problem_name":"Snakes, Mongooses and the Ultimate Election","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problems statements in <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/SNCKPB17\/mandarin\/SNELECT.pdf\">Mandarin Chinese<\/a>, <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/SNCKPB17\/russian\/SNELECT.pdf\">Russian<\/a>and <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/SNCKPB17\/vietnamese\/SNELECT.pdf\">Vietnamese<\/a> as well.<\/h3>\n\n<p>In Snakeland, there are some snakes and mongooses. They are lined up in a row. The information about how exactly they are lined up it is provided to you by a string of length <b>n<\/b>. If the i-th character of this string is 's', then it means that there is a snake at the i-th position, whereas the character 'm' denotes a mongoose.<\/p>\n\n<p>You might have heard about the age-old rivalry between hares and tortoises, but in Snakeland, the rivalry between snakes and mongooses is much more famous. The snakes and the mongooses want to hold a final poll in which the ultimate winner of this age-old battle will be decided. If the snakes get more votes than the mongooses, they will be the ultimate winners. Similarly, if the mongooses get more votes than snakes, they will be the ultimate winners. Obviously, each animal is loyal to their species, i.e. each snake will vote for the snakes to be the ultimate champions and each mongoose for the mongooses.\n<\/p>\n\n<p>\nTomorrow's the election day. Before the elections, the mongooses decided to cheat. They planned that each mongoose will eat at most one of its neighbor snakes. Two animals are said to be neighbors of each other if they are consecutive to each other in the row. After this, the elections will be held. The mongooses planned in such a way that the number of snakes eaten is maximized. Can you find out who will win the final poll? Output \"snakes\", \"mongooses\" or \"tie\" correspondingly.\n<\/p>\n\n<h3>Input<\/h3>\n<p>First line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follow.<\/p>\n<p>The only line of each test case contains a string consisting of characters 's' and 'm'. <\/p>\n\n<h3>Output<\/h3>\n<p>For each test case output a single line containing \"snakes\", \"mongooses\" or \"tie\" correspondingly (without quotes).<\/p>\n\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ 100<\/li>\n<li>1 ≤ <b>|s|<\/b> ≤ 100<\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre>\n<b>Input<\/b>\n4\nsm\nssm\nsms\nssmmmssss\n\n<b>Output<\/b>\nmongooses\ntie\ntie\nsnakes\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>Example 1<\/b>. The mongoose will eat the snake. Only the mongoose will be left. So, on the election day, there is one mongoose and zero snakes. So mongooses will win.<\/p>\n\n<p><b>Example 2<\/b>. The mongoose will eat the snake at position 2 (1-based indexing). One mongoose and one snake will be left. Hence, there will be a tie.<\/p>\n\n<p><b>Example 3<\/b>. The mongoose can eat either the snake to its left or to the right. But, it can eat only one of them. Afterwards, there will be a single snake and mongoose. So, it will result in a tie. <\/p>\n\n<p><b>Example 4<\/b>. The mongooses can eat at max two snakes. For example, s*mmm*sss, where * denotes the snakes that were eaten by mongooses. After this, we have four snakes and three mongooses. So, the snakes win.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":"kingofnumbers","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>kingofnumbers<\/span>","date_added":"30-05-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/ad-hoc'>\n                    ad-hoc\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/admin2'>\n                    admin2\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/greedy'>\n                    greedy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/snckpb17'>\n                    snckpb17\n                <\/a>","editorial_url":"https:\/\/discuss.codechef.com\/problems\/SNELECT","user":{"username":null},"time":{"view_start_date":1496331000,"submit_start_date":1496331000,"visible_start_date":1496331000,"end_date":1735669800,"current":1497283980},"todo":false,"problem_status":"unattempted"}