{"category_name":"school","status":"success","problem_code":"TLG","problem_name":"The Lead Game","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p> The game of billiards involves two players knocking 3 balls around\non a green baize table. Well, there is more to it, but for our\npurposes this is sufficient.<\/p>\n\n<p> The game consists of several rounds and in each round both players\nobtain a score, based on how well they played. Once all the rounds\nhave been played, the total score of each player is determined by\nadding up the scores in all the rounds and the player with the higher\ntotal score is declared the winner.<\/p>\n\n<p> The Siruseri Sports Club organises an annual billiards game where\nthe top two players of Siruseri play against each other. The Manager\nof Siruseri Sports Club decided to add his own twist to the game by\nchanging the rules for determining the winner. In his version, at the\nend of each round the leader and her current lead are calculated. Once\nall the rounds are over the player who had the maximum lead at the\nend of any round in the game is declared the winner.\n<\/p>\n\n<p>\nConsider the following score sheet for a game with 5 rounds:\n<\/p>\n\n<pre style=\"margin:15px\">\n    Round     Player 1       Player 2\n\n      1             140                 82\n      2              89                 134 \n      3              90                 110 \n      4              112              106\n      5              88                  90 \n<\/pre>\n\n<p>\nThe total scores of both players, the leader and the lead after\neach round for this game is given below:<\/P>\n\n<pre style=\"margin:15px\">\n    Round      Player 1       Player 2     Leader     Lead\n\n      1               140           \t 82        Player 1     58\n      2               229           \t216       Player 1     13\n      3               319           \t326       Player 2      7\n      4               431           \t432       Player 2      1\n      5               519           \t522       Player 2      3\n<\/pre>\n\n<p> The winner of this game is Player 1 as he had the maximum lead (58\nat the end of round 1) during the game.<\/p>\n\n<p> Your task is to help the Manager find the winner and the winning\nlead. You may assume that the scores will be such that there will\nalways be a single winner.  That is, there are no ties.<\/p>\n\n<p style=\"font-weight: bold\">Input<\/p>\n\n<p> The first line of the input will contain a single integer N (N\n≤ 10000) indicating the number of rounds in the game.  Lines\n2,3,...,N+1 describe the scores of the two players in the N rounds.\nLine i+1 contains two integer Si and Ti, the scores of the Player 1\nand 2 respectively, in round i.  You may assume that 1 ≤ Si ≤\n1000 and 1 ≤ Ti ≤ 1000.  <\/p>\n\n<p style=\"font-weight: bold\">Output<\/p>\n\n<p> Your output must consist of a single line containing two integers\nW and L, where W is 1 or 2 and indicates the winner and L is the\nmaximum lead attained by the winner.<\/p>\n\n<p style=\"font-weight: bold\">Example<\/p>\n\n<p style=\"font-weight: bold\">Input:<\/p>\n\n<pre>\n5\n140 82\n89 134\n90 110\n112 106\n88 90\n<\/pre>\n\n\n<p style=\"font-weight: bold\">Output:<\/p>\n\n<pre>\n1 58\n<\/pre>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"28-07-2009","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>\n                    admin\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/array'>\n                    array\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/TLG","user":{"username":null},"time":{"view_start_date":1248791554,"submit_start_date":1248791554,"visible_start_date":1248791554,"end_date":1735669800,"current":1492507641},"todo":false,"problem_status":"unattempted"}