{"category_name":"school","status":"success","problem_code":"ZUBREACH","problem_name":"J - Reached Safely Or Not","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>\nEverybody is worried about Rakesh as the boy does not have much knowledge about the real world. He can not go from one place to another on his own. It's high time he learned to explore the city. He is going to a relative's house situated on the other side of the city on his own. As this is his first time, he is carrying a GPS tracker of a special kind. The tracker continuously sends information to the family of Rakesh about his movement. The information is sent using the following four letters: <b>U, D, R,<\/b> and <b>L<\/b>. Those letters indicate the moves taken by Rakesh. \n<\/p>\n<p>\nThe city can be considered as a grid. Rakesh starts his journey from <b>(0, 0)<\/b> position of the grid. His relative's house is situated at <b>(Rx, Ry)<\/b>. Rakesh can move in four directions: up, down, right, or left indicated by <b>U, D, R,<\/b> and <b>L<\/b> respectively. \n<\/p>\n<p>\nAny position of the city with <i>x<\/i> ordinate negative or greater than <b>M<\/b> is considered as dangerous. Also, any position of the city with <i>y<\/i> ordinate negative or greater than <b>N<\/b> is considered as dangerous. You will be given the total sequence of Rakesh's movement. You need to determine if Rakesh ended up being at his relative's house, at a dangerous place, or at a random place in the city.\n<\/p>\n<p>\nTo make things clear,\n<ul>\n    <li> <b>U<\/b> indicates a move that increases position along <i>y<\/i>-axis by 1 <\/li>\n    <li> <b>D<\/b> indicates a move that decreases position along <i>y<\/i>-axis by 1 <\/li>\n    <li> <b>R<\/b> indicates a move that increases position along <i>x<\/i>-axis by 1 <\/li>\n    <li> <b>L<\/b> indicates a move that decreases position along <i>x<\/i>-axis by 1 <\/li>\n<\/ul>\n<\/p>\n<p>\nNote that we are interested in the position of Rakesh at the end of his journey only. He may visit some dangerous place or his relative's house at some intermediate point but that won't affect the answer.\n<\/p>\n\n<h3>Input<\/h3>\n<ul>\n<li>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of each test case follows.\n<\/li>\n\n<li>The first line of each test case contains two integers <b>M<\/b> and <b>N<\/b>.<\/li>\n\n<li>The second line contains two integers <b>Rx<\/b> and <b>Ry<\/b>.<\/li>\n\n<li>The third line contains the length of Rakesh's move sequence.<\/li>\n\n<li>The next line contains the move sequence containing letters <b>U, D, R,<\/b> and <b>L<\/b> only with no space.<\/li>\n<\/ul>\n\n\n<h3>Output<\/h3>\n<p>For each test case, print \"Case i: \", and then the answer, where i is the testcase number, 1-indexed. The answer should be any of the following three strings:<\/p>\n<ul>\n\t<li> <b>\"REACHED\"<\/b> if Rakesh could reach his relative's house <\/li>\n\t<li> <b>\"DANGER\"<\/b> if Rakesh ended up being in a dangerous place <\/li>\n\t<li> <b>\"SOMEWHERE\"<\/b> if Rakesh ended up being in somewhere safe place in the city other than his relative's place <\/li>\n<\/ul>\n<p>Don't print any quotation mark. Check the sample output.<\/p>\n\n\n<h3>Constraints<\/h3>\n<p>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ 10<\/li>\n<li>0 ≤ <b>M, N<\/b> ≤ 10000<\/li>\n<li>0 ≤ <b>Rx<\/b> ≤ <b> M <\/b><\/li>\n<li>0 ≤ <b>Ry<\/b> ≤ <b> N <\/b><\/li>\n<li>0 ≤ Sum of the lengths of all sequences ≤ 10000<\/li>\n<\/ul>\n\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n2\n20 20\n4 5\n13\nLLUUUUURRRRRR\n10 10\n3 4\n7\nUDUDDRR\n\n<b>Output:<\/b>\nCase 1: REACHED\nCase 2: DANGER\n<\/pre>\n\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY","max_timelimit":"1","source_sizelimit":"50000","problem_author":"zubaerkh","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>zubaerkh<\/span>","problem_tester":null,"problem_tester_html_handle":null,"date_added":"5-11-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/zubaerkh'>zubaerkh<\/a>","time":{"view_start_date":1517085000,"submit_start_date":1517085000,"visible_start_date":1517085000,"end_date":1735669800,"current":1525198931},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}