{"category_name":"easy","status":"success","problem_code":"A1","problem_name":"Paying up","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>In the mysterious country of Byteland, everything is quite different from what you'd \n\nnormally expect. In most places, if you were approached by two mobsters in a dark alley, they would \n\nprobably tell you to give them all the money that you have. If you refused, or didn't have any - \n\nthey might even beat you up.\n<p>\nIn Byteland the government decided that even the slightest chance of someone getting injured has to be ruled out. So, they introduced a strict policy. When a mobster approaches you in a dark \n\nalley, he asks you for a specific amount of money. You are obliged to show him all the money that \n\nyou have, but you only need to pay up if he can find a subset of your banknotes whose total value \n\nmatches his demand. Since banknotes in Byteland can have any positive integer value smaller than \n\none thousand you are quite likely to get off without paying.\n\n<p>Both the citizens and the gangsters of Byteland have very positive feelings about the system. No one ever \n\ngets hurt, the gangsters don't lose their jobs, and there are quite a few rules that minimize that \nprobability of getting mugged (the first one is: don't go into dark alleys - and this one is said to work in other places also).\n\n<h3>Input<\/h3>\n<p>\nThe first line contains integer <i>t<\/i>, the number of test cases (about 100). Then <i>t<\/i> test cases follow. Each test case starts with <i>n<\/i>, the \n\nnumber of banknotes in your wallet, and <i>m<\/i>, the amount of money the muggers asked of you. Then <i>n<\/i> \n\nnumbers follow, representing values of your banknotes. Your wallet does not hold more than 20 banknotes, and the value of a single banknote is never more than 1000.\n\n<h3>Output<\/h3>\n<p>\nFor each test case output a single line with the word 'Yes' if there is a subset of your banknotes that sums  to <i>m<\/i>, and 'No' otherwise.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n5\n3 3\n1\n1\n1\n5 11\n1\n2\n4\n8\n16\n5 23\n1\n2\n4\n8\n16\n5 13\n1\n5\n5\n10\n10\n20 132\n17\n6\n4\n998\n254\n137\n259\n153\n154\n3\n28\n19\n123\n542\n857\n23\n687\n35\n99\n999\n\n<b>Output:<\/b>\nYes\nYes\nYes\nNo\nYes\n<\/pre>\n<p><b>Explanation:<\/b> For example, in the last case you have to pay up, since: 6+3+123=132.","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"7","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"1-12-2008","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>\n                    admin\n                <\/a>","user":{"username":null},"time":{"view_start_date":1367924860,"submit_start_date":1367924860,"visible_start_date":1367924777,"end_date":1735669800,"current":1493558102},"todo":false,"problem_status":"unattempted"}