{"category_name":"easy","status":"success","problem_code":"ALETHIO","problem_name":"Lyra and the Alethiometer","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>\nLyra Belacqua is a very gifted girl. She is one of a very small set of people capable of reading an alethiometer, more commonly known as The Golden Compass. It has one specific use: to tell the truth. The name in fact, is derived from \"Aletheia\" meaning truth, and \"-ometer\", meaning \"measuring device\".\n<\/p>\n<p>\nThe alethiometer had four needles, out of which the user would direct three of them to lie over symbols on the face of the device to ask a question. The fourth needle then swung into action and pointed to various symbols one after another, thus telling the answer.\n<\/p>\n<p>\nFor this problem, consider the alethiometer consisting of symbols : digits '<b>0<\/b>'-'<b>9<\/b>' and letters '<b>A<\/b>'-'<b>Z<\/b>'. Learned scholars were debating the age of the Universe, and they requested Lyra to find out the age from the alethiometer. Having asked the question, the fourth needle started spouting out symbols, which Lyra quickly recorded. In that long string of characters, she knows that some substring corresponds to the age of the Universe. She also knows that the alethiometer could have wrongly pointed out atmost one digit (0-9) as a letter (A-Z). She then wonders what is the maximum possible age of the Universe.\n<\/p>\n<p>\nGiven the set of symbols the alethiometer pointed out, help her find the maximum age of the Universe, which could correspond to a substring of the original string with atmost one letter changed.\n<\/p>\n<p>\n<b>Note:<\/b> We consider a substring to be a contiguous part of the string <b>S<\/b> <br \/><br \/>\nAlso, the alethiometer wrongly reports only a <b>letter<\/b>. All the <b>digits<\/b> <i>remain as they are<\/i>.\n<\/p>\n<h3>Input<\/h3>\n<p>\nEach input consists of a single string <b>S<\/b> which is what Lyra recorded from the fourth needle's pointing.\n<\/p>\n<h3>Output<\/h3>\n<p>\nOutput one number, the maximum possible answer.\n<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li> <b>1<\/b>  ≤ |<b>S<\/b>|  ≤ <b>1,000<\/b><\/li>\n<li> <b>S<\/b> will only contain digits 0-9 and uppercase Latin letters. <\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre>\n<b>Input1:<\/b>\n06454\n\n<b>Input2:<\/b>\nC0D3C43F\n\n<b>Output1:<\/b>\n6454\n\n<b>Output2:<\/b>\n3943\n<\/pre><h3>Explanation<\/h3>\n<p>\nIn the first example, there is no choice as to what the number can be. It has to be 6,454.\n<\/p>\n<p>\nIn the second example, there are a total of 41 possible strings (one for the original, and 10 for changing each letter). You can verify that the maximum number as a substring is got by making the string \"C0D3943F\".\n<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"pragrame","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>pragrame<\/span>","problem_tester":"tuananh93","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>tuananh93<\/span>","date_added":"3-06-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/ad-hoc'>\n                    ad-hoc\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cook35'>\n                    cook35\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/pragrame'>\n                    pragrame\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/ALETHIO","user":{"username":null},"time":{"view_start_date":1372012200,"submit_start_date":1372012200,"visible_start_date":1414769400,"end_date":1735669800,"current":1493558211},"todo":false,"problem_status":"unattempted"}