
{"category_name":"easy","status":"success","problem_code":"AUTOCARS","problem_name":"Autonomous Cars","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>You are in the future. It's the time of autonomous cars. Switching lanes is a pretty difficult task for autonomous cars, and you have the logs from an experiment you had run with two cars. You want to verify whether the logs are corrupted, or could be valid.\n\nIn that experiment, you had a highway consisting of two lanes. These were represented by 2 rows of an infinite grid. The cell (1, 1) is the top left cell which is the starting point of the first lane. Cell (2, 1) is the bottom left cell of the grid which is the starting point of the second lane.\n\nThere are two cars, 1 and 2 that start from the cell (1, 1) and (2, 1). \n\nAt each instant, a car has the following choices.\n- Stay at the current position.\n- Move one cell to the right.\n- Switch Lanes. When a car switches its lane, it stays in the same column. That is, from (1, i) it could go to (2, i), or from (2, i) it could go to (1, i). But both both cars shouldn't end up at the same cell at any point. Note that there could have been a car which had moved at the very instant that you move into it.\n\nConsider one such scenario of driving cars.\n\nTime $t = 0$\n```\n1.....\n2.....\n```\n\nTime $t = 1$. Car 2 advances one cell right. Car 1 stays at the same place.\n```\n1.....\n.2....\n```\n\nTime $t = 2$. Car 2 stays at its place. Car 1 switches the lane.\n```\n......\n12....\n```\n\nTime $t = 3$. Car 2 moves one cell to the right.  Car 1 also moves one cell to the right.\n```\n......\n.12...\n```\n\nTime $t = 4$. Both the cars stay in the same place.\n```\n......\n.12...\n```\n\nYou are given positions of the car at $n$ instants. Your task is to check whether this situation is feasible or not.\n\n### Input\n- The first line of the input contains an integer $T$ denoting the number of test cases. The description of the test cases follows.\n- The first line of each test case contains an integer $n$ denoting the number of instants where the positions of the cars were recorded.\n- Each of next $n$ lines contains 5 space separated integers denoting $t_i, x_i, y_i, X_i, Y_i$ denoting time, $x$ and $y$ coordinate of the first car, and that of second car.\n\n### Output\nFor each test case, output either `yes` or `no` according to the answer to the problem.\n\n###Constraints\n- $1 \\le T \\le 10^5$\n- $1 \\le n \\leq 10^5$\n- $1 \\le t_i, y_i, X_i, Y_i \\leq 10^9$\n- $1 \\leq x_i \\leq 2$\n- $t_i < t_{i+1}$\n- Sum of $n$ over all the test cases doesn't exceed $10^6$\n\n### Example Input\n```\n2\n3\n1 1 1 2 2\n2 2 1 2 2\n4 2 2 2 3\n1\n1 1 3 2 2\n```\n\n### Example Output\n```\nyes\nno\n```","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"2","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"17-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>admin2<\/a>","time":{"view_start_date":1545157800,"submit_start_date":1545157800,"visible_start_date":1545157800,"end_date":1735669800,"current":1559472935},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}