
{"category_name":"easy","status":"success","problem_code":"BEAUKONO","problem_name":"Beauty of Konoha","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Naruto has become the seventh Hokage of Konoha. He is now devoted to making Konoha a developed city. In order to do so, he is going to establish some city centers and connect them with roads.\n\nA road between city centers $u$ and $v$ can be used to travel both from $u$ to $v$ and from $v$ to $u$. The **distance** between two city centers $u$ and $v$ is the minimum number of roads one needs to travel in order to reach from $u$ to $v$. A city center is called **remote** if it is an endpoint of exactly 1 or 0 roads. The **oddness** of a city center $u$ is the number of remote city centers which have odd distance from $u$. Naruto defines the **beauty** of Konoha as the maximum value of oddness among all existing city centers.\n\nInitially, Konoha has only one city center (this city center has index 1) and no road. Naruto wants to do some operations. In each operation, he establishes a new city center and a road connecting this new city center with an existing city center. To know about the beauty of Konoha, Naruto has appointed you, the crazy genius programmer. Your job is to keep the record of the beauty of Konoha after **each** operation. After performing all the operations, Naruto calls you. He is too tired from all the work and only wants to know the **sum** of all the beauty values you have recorded. Can you answer him correctly?\n\n###Input\n- The first line of input is $T$ ($1 \\leq T \\leq 20$), the number of testcases. \n- Each testcase contains two lines.The first line of each testcase is $n$ ($1 \\leq n \\leq 200000$), the number of operations Naruto performs. \n- The second line of each testcase contains $n$ space separated integers, $i^{th}$ of which is $a_i$, which describes the $i^{th}$ operation performed by Naruto. This indicates that Naruto adds a new city center with index $i+1$ and a new road between city centers with indices $i+1$ and $a_i$.\n- It is guaranteed that $1 \\leq a_i \\leq i$.\n\n###Output\n- For each testcase, output only one line, the answer to Naruto’s question.\n\n###Sample Input\n```\n3\n2\n1 2\n3\n1 1 2\n5\n1 2 3 1 2\n```\n\n###Sample Output\n```\n3\n4\n8\n```\n\n###Explanation\n**Testcase 1**: At first Konoha has only one citycenter, 1. After the first operation, the structure of Konoha looks like this:\n\n\n\n![fig1](https:\/\/www.codechef.com\/download\/problems\/BEAUKONO\/8h5WQIF.png =100x75)\n\n\nThere are two remote citycenters: 1 and 2. Only 2 has odd distance from 1. So, oddness(1) = 1. Similiarly, oddness(2)=1. As both citycenter 1 and 2 have oddness 1, beauty after first operation is max(1,1)=1.\n\nAfter second operation, the structure of Konoha looks like this:\n\n![fig2](https:\/\/www.codechef.com\/download\/problems\/BEAUKONO\/36dgQQp.png =100x100)\n\nThere are two remote citycenters: 1 and 3.\n\nFrom 1 or 3, no remote citycenter is at odd distance. But from 2, both 1 and 3 are at odd distance.\n\nSo, oddness(1)=0, oddness(2)=2 and oddness(3)=0.\n\nSo, beauty after second operation is max(0,2,0)=2.\n\nThe answer to Naruto’s question is: beauty after first operation + beauty after second operation = 3","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"2","source_sizelimit":"50000","problem_author":"admin3","problem_author_html_handle":"admin3","problem_tester":null,"problem_tester_html_handle":null,"date_added":"20-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin3'>admin3<\/a>","time":{"view_start_date":1545503400,"submit_start_date":1545503400,"visible_start_date":1545503400,"end_date":1735669800,"current":1559472935},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}