{"category_name":"easy","status":"success","problem_code":"BIPIN3","problem_name":"Help Watson Escape","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/APRIL16\/mandarin\/BIPIN3.pdf\">Mandarin Chinese<\/a>, <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/APRIL16\/russian\/BIPIN3.pdf\">Russian<\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/APRIL16\/vietnamese\/BIPIN3.pdf\">Vietnamese<\/a> as well.<\/h3>\n<p><b>Zombies zombies everywhere!!<\/b> <\/p>\n<p>In a parallel world of zombies, there are <b>N<\/b> zombies. There are infinite number of unused cars, each of same model only differentiated by the their colors. The cars are of<b> K<\/b> colors.\n<\/p>\n<p>\nA zombie parent can give birth to any number of zombie-children (possibly zero), i.e. each zombie will have its parent except the <em>head<\/em> zombie which was born in the winters by combination of ice and fire.\n<\/p>\n<p>\nNow, zombies are having great difficulties to commute to their offices without cars, so they decided to use the cars available. Every zombie will need only one car. <em>Head<\/em> zombie called a meeting regarding this, in which he will allow each zombie to select a car for him.\n<\/p>\n<p>\nOut of all the cars, the <em>head<\/em> zombie chose one of cars for him. Now, he called his children to choose the cars for them. After that they called their children and so on till each of the zombie had a car. Head zombie knew that it won't be a good idea to allow children to have cars of same color as that of parent, as they might mistakenly use that. So, he enforced this rule during the selection of cars.\n<\/p>\n<p>Professor James Moriarty is a criminal mastermind and has trapped Watson again in the zombie world. Sherlock somehow manages to go there and met the <em>head<\/em> zombie. Head zombie told Sherlock that they will let Watson free if and only if Sherlock manages to tell him the maximum number of ways in which the cars can be selected by <b>N <\/b>Zombies among all possible hierarchies. A hierarchy represents parent-child relationships among the <b>N<\/b> zombies. Since the answer may be large, output the answer modulo <b>10<sup>9<\/sup> + 7<\/b>. Sherlock can not compute big numbers, so he confides you to solve this for him.\n<\/p>\n<h3>Input<\/h3>\n<p>The first line consists of a single integer <b>T<\/b>, the number of test-cases.<br \/>\nEach test case consists of two space-separated integers <b>N<\/b> and <b>K<\/b>, denoting number of zombies and the possible number of colors of the cars respectively.\n<\/p>\n<h3>Output<\/h3>\n<p>For each test-case, output a single line denoting the answer of the problem.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>100<\/b><\/li>\n<li><b>1<\/b> ≤ <b>N<\/b> ≤ <b>10^9<\/b><\/li>\n<li><b>1<\/b> ≤ <b>K<\/b> ≤ <b>10^9<\/b><\/li>\n<\/ul>\n<h3>Subtasks<\/h3>\n<p>\n<b>Subtask #1 : (10 points)<\/b><\/p>\n<ul>\n<b>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>20<\/b><\/li>\n<li>1 ≤ N, K ≤ 10<\/li>\n<p><\/p><\/b>\n<\/ul>\n\n<p>\n<b>Subtask 2 : (20 points) <\/b><br \/><\/p>\n<ul>\n<b>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>10<\/b><\/li>\n<li>1 ≤ N, K ≤ 10000<\/li>\n<p><\/p><\/b>\n<\/ul>\n\n<p>\n<b>Subtask 3 : (70 points) <\/b><br \/><\/p>\n<ul>\n<b>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>100<\/b><\/li>\n<li>1 ≤ N, K ≤ 10^9<\/li>\n<p><\/p><\/b>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input<\/b>\n2\n2 2\n3 3\n<b>Output:<\/b>\n2\n12\n<\/pre><h3>Explanation\n<p>In the first sample test case, there are 2 zombies. Let us name them Z1 and Z2. Let one hierarchy be one in which Z1 is parent of Z2. There are 2 colors, suppose red and blue. If Z1 takes red, then Z2 should take a blue. If Z1 takes blue, then Z2 should take red. <br \/>\nNote that one other possible hierarchy could be one in which Z2 is a parent of Z1. In that hierarchy also, number of possible ways of assigning cars is 2.<br \/>\nSo there maximum number of possible ways is 2.\n<\/p>\n<p>\nIn the second example, we have 3 Zombies say Z1, Z2, Z3 and cars of 3 colors, suppose red, blue and green.<br \/>\nA hierarchy to maximize the number of possibilities is Z1 is the parent of Z2, Z2 is the parent of Z3.<br \/>\nZombie Z1 can choose one of red, blue or green cars. Z2 can choose one of the remaining two colors (as its car's color can not be same as its parent car.). Z3 can also choose his car in two colors, (one of them could be color same as Z1, and other being the color which is not same as cars of both Z1 and Z2.). This way, there can be 12 different ways of selecting the cars.\n<\/p>\n<\/h3>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"bipin2","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>bipin2<\/span>","problem_tester":"xcwgf666","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","date_added":"8-01-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/april16'>\n                    april16\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/bipin2'>\n                    bipin2\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/fastmodexp'>\n                    fastmodexp\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple'>\n                    simple\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/BIPIN3","user":{"username":null},"time":{"view_start_date":1460374200,"submit_start_date":1460374200,"visible_start_date":1460374200,"end_date":1735669800,"current":1493558111},"todo":false,"problem_status":"unattempted"}