{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>A long school holiday has come, and you decided to visit the famous Byte Island. You know there are only two types of Bytelandians: Byteknights and Byteknaves. A Byteknight always tells the truth, whereas a Byteknave always lies.<\/p>\n\n<p>It is known that there are <i>N<\/i> Bytelandians in the island, and now you meet all of them. You are curious about their types. Because you are a smart logician, you don't want to ask them questions that immediately reveal their types (that's too boring). Instead, to each Bytelandian you ask, \"How many Byteknights are there here?\"<\/p>\n\n<p>To your surprise, they also don't answer your questions directly. Instead, the <i>i<\/i>-th Bytelandian answers of the form \"The number of Byteknights here is between <i>a<sub>i<\/sub><\/i> and <i>b<sub>i<\/sub><\/i>, inclusive\". You record all answers in your pocket note.<\/p>\n\n<p>Now that you have collected all information you need, determine the type of each Bytelandian.<\/p>\n\n<h3>Input<\/h3>\n<p>The first line contains a single integer <i>T<\/i>, the number of test cases. <i>T<\/i> test cases follow. The first line of each test case contains a single integer <i>N<\/i>. <i>N<\/i> lines follow. The <i>i<\/i>-th line contains two integers <i>a<sub>i<\/sub><\/i> and <i>b<sub>i<\/sub><\/i>.<\/p>\n\n<h3>Output<\/h3>\n<p>For each test case, output two lines. In the first line, output a single integer indicating the number of different solutions, modulo 1000000007. In the next line, output the lexicographically smallest solution. A solution is a string consisting of <i>N<\/i> characters, where the <i>i<\/i>-th character of the string is '1' if the <i>i<\/i>-th Bytelandian is a Byteknight, or '0' in case of a Byteknave. It is guaranteed that there is at least one valid solution.<\/p>\n\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\n1\n0 1\n4\n1 4\n2 4\n3 4\n4 4\n3\n1 2\n0 0\n1 3\n\n<b>Output:<\/b>\n1\n1\n5\n0000\n1\n101\n<\/pre>\n\n<h3>Constraints<\/h3>\n<ul>\n<li>1 &lt;= <i>T<\/i> &lt;= 5<\/li>\n<li>1 &lt;= <i>N<\/i> &lt;= 50000<\/li>\n<li>0 &lt;= <i>a<sub>i<\/sub><\/i> &lt;= <i>b<sub>i<\/sub><\/i> &lt;= <i>N<\/i><\/li>\n<\/ul>    ","languages_supported":"NA","title":"BYTEISLE","category":"NA","old_version":true,"problem_code":"BYTEISLE"}