{"category_name":"easy","status":"success","problem_code":"CARVANS","problem_name":"Carvans","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p style=\"text-align:justify\">Most problems on CodeChef highlight chef's love for food and cooking but little is known about his love for racing sports. He is an avid Formula 1 fan. He went to watch this year's Indian Grand Prix at New Delhi. He noticed that one segment of the circuit was a long straight road. It was impossible for a car to overtake other cars on this segment. Therefore, a car had to lower down its speed if there was a slower car in front of it. While watching the race, Chef started to wonder how many cars were moving at their maximum speed.<\/p>\n<p style=\"text-align:justify\">Formally, you're given the maximum speed of N cars in the order they entered the long straight segment of the circuit. Each car prefers to move at its maximum speed. If that's not possible because of the front car being slow, it might have to lower its speed. It still moves at the fastest possible speed while avoiding any collisions. For the purpose of this problem, you can assume that the straight segment is infinitely long.<\/p>\n<p style=\"text-align:justify\">Count the number of cars which were moving at their maximum speed on the straight segment.<\/p>\n<h3>Input<\/h3>\n<p style=\"text-align:justify\">The first line of the input contains a single integer T denoting the number of test cases to follow. Description of each test case contains 2 lines. The first of these lines contain a single integer N, the number of cars. The second line contains N space separated integers, denoting the maximum speed of the cars in the order they entered the long straight segment.<\/p>\n<h3>Output<\/h3>\n<p style=\"text-align:justify\">For each test case, output a single line containing the number of cars which were moving at their maximum speed on the segment.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\n1\n10\n3\n8 3 6\n5\n4 5 1 2 3\n\n<b>Output:<\/b>\n1\n2\n2\n<\/pre><h3>Constraints<\/h3>\n<p>\n1 ≤ T ≤ 100<br \/>\n1 ≤ N ≤ 10,000<br \/>\nAll speeds are distinct positive integers that fit in a 32 bit signed integer.<br \/>\nEach input file will not be larger than 4 MB (4,000,000,000 bytes) in size.\n<\/p>\n<p style=\"text-align:justify\"><b>WARNING!<\/b> The input files are very large. Use faster I\/O.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"yellow_agony","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>yellow_agony<\/span>","problem_tester":"gamabunta","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #666666;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>1&#9733;<\/span><span>gamabunta<\/span>","date_added":"2-09-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/cakewalk'>\n                    cakewalk\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cook26'>\n                    cook26\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple-math'>\n                    simple-math\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/yellow_agony'>\n                    yellow_agony\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CARVANS","user":{"username":null},"time":{"view_start_date":1348428125,"submit_start_date":1348428125,"visible_start_date":1348427700,"end_date":1735669800,"current":1493558113},"todo":false,"problem_status":"unattempted"}