{"category_name":"easy","status":"success","problem_code":"CBARG","problem_name":"Chef and Memory Limit","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/JUNE15\/mandarin\/CBARG.pdf\">Mandarin Chinese <\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/JUNE15\/russian\/CBARG.pdf\">Russian<\/a>.<\/h3>\n<p>Recently Chef has decided to make some changes in our beloved <b>Codechef<\/b>. As you know, each problem at Codechef has its memory and time limits. To make problems even more challenging, he decided to measure allocated memory in a different way. Now judge program will be calculating not the maximum memory usage during the execution of all test files, but all the memory ever allocated by the solution program. But as Chef is not that good in algorithms, so he asks you to write a program that will calculate total memory usage of a solution.<\/p>\n<p>So, you are given <b>N<\/b> numbers <b>M<sub>1<\/sub>, , ,M<sub>N<\/sub><\/b> representing the measurements of consumed memory (in MBs) for <b>N<\/b> test files. In other terms, it means that on i-th test file, program took <b>M<sub>i<\/sub><\/b> MBs of memory. Initially, there is no memory allocated for your program. Before running your program on each test file, if the currently allocated memory is more than memory needed for the current test file, then there will be a deallocation of the memory to fit the current program. Also, if there is less than needed memory available, then allocation of memory will happen so as to fit the current program. e.g. Let us say that our program took 10 MBs on current test file. So, assuming if there was 12 MBs memory allocated before running the program on current test file, then there will happen a deallocation of 2 MBs. Assuming if there was 8 MBs memory allocated before running the program on current test file, then there will happen a allocation of 2 MBs.\n<\/p>\n<p>\nCalculate the total memory <b>allocated<\/b> for running the solution program on all the <b>N<\/b> test files. Please see third sample for more clarity.<\/p>\n<h3>Input<\/h3>\n<p>First line of input contains a single integer <b>T<\/b> denoting the  number of test cases. First line of each test case contains a single integer <b>N<\/b> denoting the number of measurements. Second line of each test case contains <b>N<\/b> space separated integers, where <b>i<sup>th<\/sup><\/b> integer denotes the consumption of memory for <b>i<sup>th<\/sup><\/b> i-th test file.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, print total memory allocated for running the solution program.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>10<sup>5<\/sup><\/b><\/li>\n<li><b>1<\/b> ≤ <b>N<\/b> ≤ <b>10<sup>5<\/sup><\/b><\/li>\n<li><b>1<\/b> ≤ <b>M<sub>i<\/sub><\/b> ≤ <b>10<sup>9<\/sup><\/b><\/li>\n<li> sum of <b>N<\/b> over all test cases does not exceed <b>10<sup>5<\/sup><\/b><\/li>\n<\/ul>\n<h3>Subtasks<\/h3>\n<p><b>\n<p>Subtask 1 (30 points):<br\/><\/br\/><\/p>\n<ul>\n<li>1 ≤ T ≤ 100<\/li>\n<li>1 ≤ N ≤ 100<\/li>\n<li>1 ≤ M<sub>i<\/sub> ≤ 100<\/li>\n<\/ul>\n<\/b><\/p>\n<p>Subtask 3 (70 points): <br\/><\/br\/><\/p>\n<ul>\n<li>Original constraints.<\/li>\n<\/ul>\n\n<p><\/p>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n3\n2\n1 1\n5\n1 2 3 4 5\n3\n1 3 2\n\n<b>Output:<\/b>\n1\n5\n3\n<\/pre><h3>Explanation<\/h3>\n<p><b>Example case 1.<\/b> Initially, there was no memory allocated. For running first test file, there was a memory allocation of 1 MBs. There was no allocation\/ deallocation for running your program on second test file. <\/p>\n<p><b>Example case 2.<\/b> On running on each test file, there was a further allocation of 1 MBs from previous one. So, there are total 5 MBs of memory allocated while running the program.<\/p>\n<p><b>Example case 3.<\/b> Initially, there was no memory allocated. For running first test file, there was a memory allocation of 1 MBs. For running second test file, there was a further memory allocation of 2 MBs to have 3 MBs of memory needed, then in the last file, there was a deallocation of 1 MB of memory so as to get 2 MBs of memory needed for running the program. So, overall, there was 1 + 2 = 3 MBs of memory ever allocated in the program. Note that we are only counting allocated memory, not allocated + unallocated.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"witalij_hq ","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>witalij_hq<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"22-02-2015","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/cakewalk'>\n                    cakewalk\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/june15'>\n                    june15\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simulation'>\n                    simulation\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/witalij_hq '>\n                    witalij_hq \n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CBARG","user":{"username":null},"time":{"view_start_date":1434360600,"submit_start_date":1434360600,"visible_start_date":1434360600,"end_date":1735669800,"current":1493558113},"todo":false,"problem_status":"unattempted"}