{"category_name":"easy","status":"success","problem_code":"CHN03","problem_name":"Animesh practices some programming contests","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>\nAs you know, Malvika has created some <b>n<\/b> programming contests. Each of the contests has three problems, categorized as easy, medium and hard on difficulty level. For the <b>i<\/b><sup>th<\/sup> contest, easy problem takes <b>TE[i]<\/b> hours and gives you <b>PE[i]<\/b> pleasure. Similarly, medium problem takes <b>TM[i]<\/b> hours, gives <b>PM[i]<\/b> pleasure, and a hard one has the values <b>TH[i]<\/b>, <b>PH[i]<\/b>.\n<\/p>\n\n<p>\nToday, Animesh wanted to practice some of them. Animesh has a really bad habit of trying problems for only a few minutes and saying to Malvika \"I am a noob, you are a pro. It's some weird shit I don't know. Please, tell me the solution, bro!\" Having been irritated by this behaviour numerous times in the past, she granted him <b>K<\/b> special powers he can use before starting the practice session. By using a single power, Animesh can pick any two problems irrespective of their difficulty from two different contests and swap them. \n<\/p>\n\n<p>\nAnimesh has at max <b>time<\/b> hours before he gets frustrated by his noobness and ends the practice session. He wants to make the maximum use of it by getting as much pleasure out of this activity as possible. Animesh also gets bored with the contest themes fairly quickly, so he does not want to solve more than one problem from any contest. Can you help Animesh in estimating the maximum amount of pleasure he can achieve out of this activity?\n<\/p>\n\n<h3>Input<\/h3>\n<ul>\n<li>The first line of input contains a single integer <b>T<\/b> denoting number of test cases<\/li>\n<li>For each test case : <\/li>\n<ul>\n\t<li>The first line contains three space separated integers <b>n, k, time<\/b>.<\/li>\n\t<li>Each of the next <b>n<\/b> lines contain three space separated integers denoting <b>TE[i], TM[i], TH[i]<\/b>.<\/li>\n\t<li>Each of the next <b>n<\/b> lines contain three space separated integers denoting <b>PE[i], PM[i], PH[i]<\/b>.<\/li>\n<\/ul>\n<\/ul>\n\n<h3>Output<\/h3>\n<ul>\n<li>For each test case, output a single integer in a separate line corresponding to the answer of the problem.<\/li>\n<\/ul>\n\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ <b>10<\/b><\/li>\n<li>1 ≤ <b>n<\/b> ≤ <b>50<\/b><\/li>\n<li>0 ≤ <b>k<\/b> ≤ <b>n * n<\/b><\/li>\n<li>1 ≤ <b>time<\/b> ≤ <b>50<\/b><\/li>\n<li>1 ≤ <b>TE[i], TM[i], TH[i]<\/b> ≤ <b>50<\/b><\/li>\n<li>1 ≤ <b>PE[i], PM[i], PH[i]<\/b> ≤ <b>100000<\/b><\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n2\n1 0 5\n1 2 3\n5 3 6\n2 1 6\n1 2 1\n2 3 3\n5 3 3\n4 6 5\n\n<b>Output:<\/b>\n6\n11\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>In the first example<\/b>, \nMalvika has prepared only one programming contest, its easy problem takes 1 hour and gives 5 units of pleasure. The medium one takes 2 hours and gives 3 units of pleasure whereas the same values for hard are 3 hours and 6 units of pleasure. Animesh has only 5 hours and can select at max one problems out of these to solve. The hard problem is the best candidate to choose for him, it will him give him 6 units of pleasure and take his 5 hours. So, the answer is 6.\n<\/p>\n\n<p><b>In the second example<\/b>, \nMalvika has prepared two programming contests.\n<ul>\n\t<li>First programming contest:\n\t\t<ul>\n\t\t\t<li> Easy problem — 1 hour and 5 units of pleasure.<\/li>\n\t\t\t<li> Medium problem — 2 hours and 3 units of pleasure.<\/li>\n\t\t\t<li> Hard problem — 1 hours and 3 units of pleasure.<\/li>\n\t\t<\/ul>\n\t<\/li>\n\t<li>Second programming contest:\n\t\t<ul>\n\t\t\t<li> Easy problem — 2 hours and 4 units of pleasure.<\/li>\n\t\t\t<li> Medium problem — 3 hours and 6 units of pleasure.<\/li>\n\t\t\t<li> Hard problem — 3 hours and 5 units of pleasure.<\/li>\n\t\t<\/ul>\n\t<\/li>\n<\/ul>\n\nAnimesh has 6 hours and can use at max one swapping power. He can select the easy problem of the first programming contest and the medium problem of the second one. It will take him 4 hours and give him 11 units of pleasure.\n<\/p>","languages_supported":"C, CPP14, JAVA","max_timelimit":"3","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-01-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/acm15chn'>\n                    acm15chn\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/admin2'>\n                    admin2\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/dynamic-programming'>\n                    dynamic-programming\n                <\/a>","user":{"username":null},"time":{"view_start_date":1453546800,"submit_start_date":1453546800,"visible_start_date":1453546800,"end_date":1735669800,"current":1493558127},"todo":false,"problem_status":"unattempted"}