{"category_name":"easy","status":"success","problem_code":"CLMBSTRS","problem_name":"Climbing Stairs","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>There is a ritual that some monks of Byteland perform every century as a sign of respect and worship towards BOOL, the God of Byteland.<\/p>\n<p>All the monks train for many years in order to accomplish an extremely hard task, that is the one of accessing the sacred temple of Byteland, where only the best of the bests monks are allowed to enter and worship their god, BOOL.<\/p>\n<p>The training the monks perform, usually consists of several physically and intellectually challenging tasks, trained and perfected over the course of many years, so that one of them can be eligible for the ultimate task that is a combination of both physical effort as well as mental effort.<\/p>\n<p>This final task is the actual possibility of trying to access the sacred temple of Byteland, that is located on the top of a very high mountain, where reckless storms and heavy rains usually occur.<\/p>\n<p>The access to this mountain is done by climbing an enourmous set of stairs that spiral around the mountain until it ends on the top of the mountain where the sacred temple door is located.<\/p>\n<p>The door can only be opened by unlocking it. To unlock the door, the monk only sees a hole in it, a lever, and he also spots a very large amount of little round stones on the ground, and he understands that the only way to open the door is to place an exact pre-determined amount of stones trough that hole, so that when the number is correct, he will push the lever down, and the door will open. If this number is incorrect, the lever will be locked by the incorrect stones and a whole new century must pass so that the storms can erode the stones and a new monk can be selected for the task.<\/p>\n<p>This year, YOU were the one selected to climb the huge set of stairs, and you are extremely well prepared... You have done your training very well and you are also aware of two very important facts that will be key for your success... The favourite number base on Byteland is base 2, and Gods favourite number is the largest number on this base. You also know that the number of stones you need to place on the door hole is related to the way everyone climbs the stairs and with the number of stairs itself. <\/p>\n<p>As the monks take several supplies for the demanding trip, they can only climb either one or two steps at a time. You understood that the number of stones you need to place on the door is closely related with the way you climb the stairs. Suppose the number of stairs you need to climb is <b>N<\/b>. Also, let the number of ways you have of climbing those <b>N<\/b> stairs be <b>M<\/b>. Now, the number of stones required is equal to the number of 1's in the base-2 representation of (<b>M<\/b> modulo 1000000007).<\/p>\n<p>You won't fail, as you are extremely well ready, but you have made everyone on your town extremely excited with your journey, so, given the number N of steps you are to climb and a guess, <b>G<\/b>, from the people of your village, you need to see if they are correct or not.<\/p>\n<p>More formally, given a number <b>N<\/b> of steps to climb and a guess <b>G<\/b> from your village, you need to check if guess <b>G<\/b> is accordingly to your correct calculations. They are correct if you manage to enter the temple using their guess, or incorrect otherwise. You should output the string “CORRECT” if they are correct, or “INCORRECT” if they are incorrect. (Quotes for clarity only). Please read the section \"Output Explanation\" for some clarification on the example cases.<\/p>\n<h3>Input<\/h3>\n<p>The first line of each official test case file will contain an integer <b>T<\/b>, that stands for the number of test cases on that specific test case file.<br \/>\nThe next <b>T<\/b> lines contain two-space separated integers, <b>N<\/b> and <b>G<\/b>, respectively, the number of steps the monk needs to climb and the guess from the village's population.<\/p>\n<h3>Output<\/h3>\n<p>Output will contain the string \"CORRECT\" or \"INCORRECT\" on a single line, as explained above on the problem statement.<\/p>\n<h3>Constraints<\/h3>\n<p>In each file, <b>T<\/b> = 100000, i.e., each file will contain 100000 test cases (this value needs to be read from standard input).<\/p>\n<p>1 ≤ <b>N<\/b> ≤ 1000000<\/p>\n<p>0 ≤ <b>G<\/b> ≤ 50<\/p>\n<p>Your code will be judged against several input files.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n100000\n1 1\n7 4\n(and 99998 more test cases...)\n\n<b>Output:<\/b>\nCORRECT\nINCORRECT\n(and 99998 more answers...)\n<\/pre>\n<h3>Output Explanation:<\/h3>\n<p>On the first case, when there is only one step to climb, there is only one way to do it. 1 in binary is 1, and as the village's population guess is also 1 the answer is correct.<\/p>\n<p> On the second case, there are 21 ways of climbing the stairs altogether. 21 in binary is 10101, that contains three ones. As the village's population guess was 4, the answer is therefore incorrect. <\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"kuruma","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #1E7D22;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>2&#9733;<\/span><span>kuruma<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"9-12-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/combinatorics'>\n                    combinatorics\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/feb13'>\n                    feb13\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/kuruma'>\n                    kuruma\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple'>\n                    simple\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CLMBSTRS","user":{"username":null},"time":{"view_start_date":1360580275,"submit_start_date":1360580275,"visible_start_date":1360580275,"end_date":1735669800,"current":1493558131},"todo":false,"problem_status":"unattempted"}