
{"category_name":"easy","status":"success","problem_code":"DEM2019A","problem_name":"Surgical Strikes","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>$N$ Indian Air Force fighter planes are located in different bases across the country. Each airbase is described by some integer coordinate $(x,y)$. The Air Force plans to do surgical strikes on a maximum of $M$ different targets in enemy territory (which are also described by cartesian coordinates) and then come back to the common main airbase at coordinate $(baseX, baseY)$ .   \n\nEach army base and the targets are recognised by a secret integer $ID$. The time taken for an aircraft to go from a base to a target is the prime factor of the Manhattan Distance between the base and the target that is just greater than the $ID$ of the source base (In case the $ID$ is greater than or equal to the largest prime factor, then consider the $ID$ itself). Similarly, the time taken for an aircraft to go from a target to the main base is the prime factor of the Manhattan Distance between the target and the main base that is just greater than the $ID$ of the target (In case the $ID$ is greater than or equal to the largest prime factor, then consider the $ID$ itself).   \n\nEach Aircraft needs to leave the base, reach target and come back to the main base in a maximum time of $T$.  One aircraft can go to only one target before going to the main base.\n\nFind the maximum number of targets that can be reached in the enemy territory.\n\n\n###Input\n- The first line contains three space separated integers $N$, $M$ and $T$ respectively.\n- The next $N$ lines contain 3 integers denoting $x$ coordinate, $y$ coordinate and the $ID$ of the air bases.\n- The next $M$ lines contain 3 integers denoting $x$ coordinate, $y$ coordinate and the $ID$ of the targets.\n- The last line contains two integers denoting the  $baseX$ and $baseY$ coordinate.\n\n###Output\n\nOutput a single integer which is the maximum number of targets that can be reached.\n\n###Constraints \n- $ 1\\leq N,M \\leq 400$\n- $ 0 \\leq x, y, baseX, baseY \\leq 5*10^6$\n- $ 0 \\leq ID \\leq 5000$\n- $ 0 \\leq T \\leq10^7$\n\n###Sample Input\n\n2 2 35   \n1 2 15   \n2 10 20   \n2 1 8   \n5 6 12   \n5 5   \n\n###Sample Output\n2\n\n###Sample Explanation\nAircraft from first base can go to target 1 and then to the main base in time 23 and aircraft from second base can go to target 2 and then to the main base in time 32. So 2 targets can be reached in less than time T=35.  ","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, R, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"vishal_nnd0","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>vishal_nnd0<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"15-04-2019","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/vishal_nnd0'>vishal_nnd0<\/a>","time":{"view_start_date":1556307900,"submit_start_date":1556307900,"visible_start_date":1556307900,"end_date":1735669800,"current":1559472942},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}