{"category_name":"easy","status":"success","problem_code":"ELHIDARR","problem_name":"Find an element in hidden array","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>There is an array of length <b>N<\/b> consisting of non-negative integers. The array is sorted in non-decreasing order. Each number in the array appears exactly <b>K<\/b> times, except one element, which appears at least once, but less than <b>K<\/b> times. Your task is to identify that element.<\/p>\n\n<p>This is an interactive problem. You are only given the integer <b>N<\/b> in the input. Both the array and the value of <b>K<\/b> are hidden. You are allowed to ask the judge the following queries: What is the value of the element at index <b>i<\/b> of the array? Identify the value of the element with frequency less than <b>K<\/b> by asking at most 60 such queries.<\/p>\n\n<h3>Input and Output<\/h3>\n<p>The first line of the input contains a single integer <b>T<\/b> denoting the number of test cases.<\/p>\n<p>For each test case, you should start by reading a single line containing one integer <b>N<\/b> from the input.<\/p>\n<p>You can interact with the judge using the standard input and output. There are two types of operations: to perform one operation, you should print to the standard output a line containing two space-separated integers <b>type<\/b> and <b>val<\/b>.\n<ul>\n\t<li>If <b>type<\/b> = 1, you are asking the judge a query for the value of the element of the array at index <b>val<\/b>. After printing this line, the judge will print to the standard input a line containing one integer corresponding to the value of the element at index <b>val<\/b>. <\/li>\n\t<li>If <b>type<\/b> = 2, you are telling the judge that the element with frequency less than <b>K<\/b> is <b>val<\/b>. For each test case, you should perform this operation exactly once at the end. This is not counted towards the 60 queries.<\/li>\n<\/ul><\/p>\n\n<h3>Note<\/h3>\n<p>Don't forget to flush the standard output after printing each line. It can be done using fflush(stdout) in C\/C++, System.out.flush() in Java and sys.out.flush() in Python.<\/p>\n<p>If you ask more than 60 queries, your program will get the verdict Wrong Answer.<\/p>\n\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ 10<sup>4<\/sup><\/li>\n<li>3 ≤ <b>N<\/b> ≤ 10<sup>5<\/sup><\/li>\n<li>2 ≤ K<\/b> ≤ <b>N - 1<\/b><\/li>\n<li>each element of the array lies between 1 and 10<sup>9<\/sup> inclusive<\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre>Input \/ judge feedback\tyour output\n1\n3\n\t\t\t\t\t\t1 2\n1\n\t\t\t\t\t\t1 3\n5\n\t\t\t\t\t\t1 1\n1\n\t\t\t\t\t\t2 5\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>Example case 1:<\/b> Suppose the array is [1, 1, 5]. Note that the value of <b>K<\/b> is 2, but it is hidden from you.<\/p>\n<p>In the first query, you request the value of the 2nd element and the judge answers 1. Then you request the value of the 3rd element and the judge answers 5, then the value of the first element and the judge answers 1.<\/p>\n<p>Now, you tell the judge that the answer is 5. You made a total of 3 queries.<\/p>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"2","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":null,"date_added":"25-11-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/acm17chn'>acm17chn<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/admin2'>admin2<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/binary-search'>binary-search<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/chn17rol'>chn17rol<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/easy-medium'>easy-medium<\/a>","editorial_url":"https:\/\/discuss.codechef.com\/problems\/ELHIDARR","time":{"view_start_date":1515357000,"submit_start_date":1515357000,"visible_start_date":1515357000,"end_date":1735669800,"current":1525454367},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}