{"category_name":"easy","status":"success","problem_code":"GALACTIK","problem_name":"Galactik Football","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p><b>WARNING<\/b> Large input\/output files. Use faster I\/O.<\/p>\n<p>It's Galactik Football time! The Galactik Football Assosiation (GFA) has announced a football tournament between all the teams of all the planets in the galaxy (say <b>N<\/b>). Teams like Snow Kids, Shadows, Xenons, Red Tigers, Wambas, Pirates, etc. are in total enthusiasm and are practising hard to win the cup using their talent and flux.<\/p>\n<p>Each planet of the galaxy has a government. Some governments have a <b>mutual agreement<\/b> between them. If planet <b>A<\/b> has mutual agreement with planet <b>B<\/b>, then there is a <b>bidirectional<\/b> <b>spaceway<\/b> between <b>A<\/b> and <b>B<\/b> using which anybody can go from <b>A<\/b> to <b>B<\/b> and <b>vice-versa<\/b>. People can use these spaceways to travel from one planet to another, if there exists a <b>path<\/b> between them using some of the spaceways.<\/p>\n<p>Each planet has it's own football ground. The GFA has planned the matches in such a way that a team can have a match at any of these grounds. The GFA has come across some problems in the execution of their plan. They have found out that there are many pairs of planets between which there <b>does not exist any path<\/b>, so the football team of one of those planets can't reach the other planet. They requested the corresponding governments to make a spaceway between them, but because of absense of mutual agreement (duhhh.. Politics!), these goverment did not agree. So the GFA suggested that they will make teleports between some pairs of planets which will be used only by the football teams to travel.<\/p>\n<p>But there are two types of governments in the galaxy<br \/>\n<b>1.<\/b> Some of the governments are greedy (duhhh..). They want to make money (You don't say!) throught the GFA. So each of these government has asked the GFA for a tax value which it has to pay if it wants to make a teleport ending at their planet.<br \/><br \/>\n<b>2.<\/b> Others want to sponser the event, so they will give money to the GFA if they make a teleport ending at their planet (That's new..). The GFA would always avoid such governments no matter what the consequences are, because these kind of governments have always some dirty plans in their minds for the GFA.<br \/><\/p>\n<p>Now, the GFA wants to make bi-directional teleports between planets such that the football teams of any planet can reach any other planet to play a football match, using spaceways between the planets and\/or teleports made by the GFA.<\/p>\n<p>The GFA also has financial problems and want to spend as little money as possible. They have come to you so that you can help them calculate the minimum ammount of money needed to fulfill their plan.<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input consists of two integers - <b>N<\/b> and <b>M<\/b>. <b>N<\/b> is number of planets and <b>M<\/b> is number of pairs of planets which have a mutual agreement, i.e they have a spaceway between them. Then, <b>M<\/b> lines follow, each containing two space separated integers <b>A<\/b> and <b>B<\/b>, denoting a mutual agreement and hence a spaceway to travel, between plenet <b>A<\/b> and planet <b>B<\/b>. Then, <b>N<\/b> lines follow. The <b>i<sup>th<\/sup><\/b> line has an integer <b>C<\/b>. If <b>C ≥ 0<\/b>, then it represents the tax value which the GFA has to pay to the government of planet i (it's a <b>type 1<\/b> government). If <b>C &lt; 0<\/b>, then it represents the money the ith government will pay to the GFA (it's a <b>type 2<\/b> government).<\/p>\n<h3>Output<\/h3>\n<p>Print the minimum amount needed for the GFA to fulfill their plan if it can be fulfilled, else print \"-1\" (without quotes).<\/p>\n<h3>Constraints<\/h3>\n<p>\n<b>1 ≤ N ≤ 100,000<\/b><br \/>\n<b>0 ≤ M ≤ 1,000,000<\/b><br \/>\n<b>0 ≤ |C| ≤ 10,000<\/b><br \/>\n<b>1 ≤ A,B ≤ N<\/b><br \/>\n<b>A ≠ B<\/b><\/p>\n<h3>Sample<\/h3>\n<pre>\n<b>Input 1<\/b>\n6 6\n1 2\n2 3\n1 3\n4 5\n5 6\n4 6\n1\n3\n5\n2\n4\n6\n\n<b>Output 1<\/b>\n3\n\n\n<b>Input 2<\/b>\n3 1\n2 3\n1\n-1\n-1\n\n<b>Output 2<\/b>\n-1\n\n<\/pre>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"jay_adm","problem_author_html_handle":"jay_adm","problem_tester":"gamabunta","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #666666;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>1&#9733;<\/span><span>gamabunta<\/span>","date_added":"6-04-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/disjoint-set'>\n                    disjoint-set\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/jay_adm'>\n                    jay_adm\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/july13'>\n                    july13\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/mst'>\n                    mst\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/union-find'>\n                    union-find\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/GALACTIK","user":{"username":null},"time":{"view_start_date":1373880917,"submit_start_date":1373880917,"visible_start_date":1373880600,"end_date":1735669800,"current":1493558148},"todo":false,"problem_status":"unattempted"}