{"category_name":"easy","status":"success","problem_code":"GAMEW","problem_name":"Games of Wasseypur","body":"Everything was going well in Wasseypur until Ramadhir Singh came to know that Sahid Khan plans to kill him someday, and takeover his mine. So he decided to take preemptive measures and kill Sahid Khan first. However Sahid Khan also came to know Ramadhir Singh's plan to kill him soon. Wasseypur was all set for bloodshed but the Chef intervened. Instead of violence, he convinced both to play a game called Game of Wasseypur.\n\nThere is a string $S$ of length $N$ consisting of only $0's$ and $1's$. The Game is played in turns, in each turn a player can erase a $block$ from the current string and the remaining part of the string will concatenate to make the current string for another player.\n\nA block in the string is defined as a non-empty substring consisting of the same character such that both the neighbouring character(s) (if exists) are different from the character of the substring. $Eg: S = “0001110110011”$\nIn the above string, there are $6$ blocks which are $000,111,0,11,00,11$\n\nThe player who will not be able to make a move at the end will lose the game and so will have to leave the Wasseypur. Both Sahid Khan and Ramadhir have taken the help of Wasseypur's elders and will play optimally. Assuming the game will start from the Sahid khan, find out the winner.\n<aside style='background: #f8f8f8;padding: 10px 15px;'><div>All submissions for this problem are available.<\/div><\/aside>","problemComponents":{"constraints":"- $1 \\leq T \\leq 10^4$\n- $1 \\leq N \\leq 10^5$\n- $S$ is a binary string, consisting of $0$ and $1$ only\n- Sum of $N$ over all test cases will not exceed $10^6$\n","constraintsState":true,"subtasks":"- 30 points : $1 \\leq R \\leq 10000$\n- 70 points : $1 \\leq R \\leq 10^9$\n","subtasksState":false,"statement":"Everything was going well in Wasseypur until Ramadhir Singh found out that Sahid Khan plans to kill him someday and takeover his mine. To protect himself, he decided to take preemptive measures and kill Sahid Khan first. However, Sahid Khan also learnt of Ramadhir Singh's plan to kill him, and soon Wasseypur was all set for bloodshed - but Chef intervened! Instead of resorting to violence, he convinced them to settle things by playing a game called the Game of Wasseypur.\n\nThe game is as follows:\nThere is a string $S$ of length $N$ consisting of only $0's$ and $1's$. Players take turns moving - on his turn, a player chooses some $block$ of $S$ and erases it. The remaining parts of $S$ are then concatenated together (without changing the order), and the other player then makes a move on this modified string.\n\nA $block$ in the string is defined as a maximal non-empty substring consisting of the same character. For example, if $S = 0001110110011$, there are $6$ blocks: in order from left to right, $000, 111, 0, 11, 00, 11$.\n\nThe player who is unable to make a move at the end loses the game and has to leave Wasseypur. Assuming that both players play optimally and Sahid Khan starts, find the winner of the game.","inputFormat":"- The first line of input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains a single integer $N$ denoting the length of the string.\n- The second line of each test case contains the binary string $S$.","inputFormatState":true,"outputFormat":"For each test case, output a single line containing the string “SAHID” (without quotes) if Sahid Khan will be the winner, and “RAMADHIR” otherwise.\n\nEach character of the output can be printed either in lowercase or uppercase (so if Sahid wins, “SAHID”, “sahid” and “sAHiD” are all acceptable outputs).\n","outputFormatState":true,"sampleTestCases":[{"id":"1","input":"2\n4\n0000\n4\n0011","output":"SAHID\nRAMADHIR","explanation":"**Test case 1:**\nThere is only one block $0000$, which Sahid Khan will erase in the first move. Ramadhir Singh is then left unable to make a move and loses.\n\n\n**Test case 2:**\nThere are two blocks- $00$ and $11$. Sahid has to erase any one of the two, following which Ramadhir will erase the remaining block and make the string empty. Now, Sahid cannot make a move and will lose the game.\n","isDeleted":false}]},"video_editorial_url":"https:\/\/youtu.be\/ZwqIWQDsjBU","languages_supported":"CPP14, C, JAVA, PYTH 3.6, CPP17, PYTH, PYP3, CS2, ADA, PYPY, TEXT, PAS fpc, NODEJS, RUBY, PHP, GO, HASK, TCL, PERL, SCALA, LUA, kotlin, BASH, JS, LISP sbcl, rust, PAS gpc, BF, CLOJ, R, D, CAML, FORT, ASM, swift, FS, WSPC, LISP clisp, SQL, SCM guile, PERL6, ERL, CLPS, ICK, NICE, PRLG, ICON, COB, SCM chicken, PIKE, SCM qobi, ST, SQLQ, NEM","max_timelimit":"0.5","source_sizelimit":"50000","problem_author":"rag_hav13","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span class='m-username--link'>rag_hav13<\/span>","problem_tester":"","problem_tester_html_handle":"","date_added":"30-09-2021","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/csns2021'>csns2021<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/observation'>observation<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/rag_hav13'>rag_hav13<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/simple'>simple<\/a>","problem_difficulty_level":"Unavailable","user_zen_mode":false,"best_tag":"","editorial_url":"https:\/\/discuss.codechef.com\/problems\/GAMEW","time":{"view_start_date":1635960600,"submit_start_date":1635960600,"visible_start_date":1635960600,"end_date":1735669800,"current":1643797815},"user":{"username":null,"access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false,"problemDiscussURL":"https:\/\/discuss.codechef.com\/search?q=GAMEW","is_proctored":false,"is_user_verified_for_proctoring":null,"visitedContests":[]}