{"category_name":"easy","status":"success","problem_code":"GCAC","problem_name":"Greedy Candidates","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problems statements in <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/AUG17\/mandarin\/GCAC.pdf\">mandarin chinese<\/a>, <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/AUG17\/russian\/GCAC.pdf\">russian<\/a> and <a target=\"_blank\" \nhref=\"http:\/\/www.codechef.com\/download\/translated\/AUG17\/vietnamese\/GCAC.pdf\">vietnamese<\/a> as well.<\/h3>\n\n<p>The placements\/recruitment season is going on in various colleges. The interviews are over, and each company has selected some students. But since each student can end up finally in at most one company, a student might have to reject a company which selected him. The companies know this, and hence, the companies usually select more students than it can actually employ. So now, the exact pairings should be done. We talk about one such session in a famous college.<\/p>\n\n<p>There are a total of <b>N<\/b> candidates (numbered from 1 to <b>N<\/b>) and <b>M<\/b> companies (numbered from 1 to <b>M<\/b>) taking part in it. Each candidate has a certain minimum expectation of salary, which is given by the array <b>minSalary<\/b> (All the arrays are 1-indexed). For each candidate, you are also given the information regarding the companies which have selected him. This information is given by an array <b>qual<\/b> of size <b>N * M<\/b>, where <b>qual<\/b>[i][j] = 1 if and only if the i-th candidate has qualified for a job in the j-th company. A company will provide a fixed salary to the candidates it employs, which is given by the array <b>offeredSalary<\/b>. Also, a company has an upper bound on the number of candidates it can employ and finally give an offer to. This information is provided by array <b>maxJobOffers<\/b>.<\/p>\n\n<p>The D-day has come. Each candidate from 1, 2, .. <b>N<\/b> (in this order) will go to the placements coordinator. When the i-th student goes, among the companies which have selected him, and which still haven't reached their <b>maxJobOffers<\/b> limit, he picks the company which provides the maximum <b>offeredSalary<\/b>, provided that it is at least his <b>minSalary<\/b>.<\/p> \n\n<p>You have to find the number of the candidates that will end up with a job, the total amount of salaries that the candidates will get, and the number of companies that won't be able to employ even a single candidate. This information is very crucial for the placement coordinator, so as to analyze whether it makes sense to invite a company to come to the placements session next year or not. Please help the coordinator!<\/p>\n\n<h3>Input<\/h3>\n<ul>\n<li>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows<\/li>\n<li>First line of each test case contains two space separated integer <b>N, M<\/b>.<\/li>\n<li>The next line contains <b>N<\/b> space separated integers denoting the array <b>minSalary<\/b>.<\/li>\n<li>Each of the next <b>M<\/b> lines contains two space separated integers denoting <b>offeredSalary<\/b>[i] and <b>maxJobOffers<\/b>[i].<\/li>\n<li>The next <b>N<\/b> lines will contain the description of the 2-D array <b>qual<\/b>. Each of the <b>N<\/b> lines will contain <b>M<\/b> binary integers (without any space): j-th integer in the i-th line will denote <b>qual<\/b>[i][j].<\/li>\n<\/ul>\n\n<h3>Output<\/h3>\n<ul>\n<li>For each test case, output three integers in a new line, denoting the number of the candidates that will get a job, the total amount of salaries that the candidates will get, and the number of companies that won't be able to hire even a single candidate.<\/li>\n<\/ul>\n\n<h3>Constraints<\/h3>\n<ul>\n<li> 1 ≤ <b>T<\/b> ≤ 10<\/li>\n<li> 1 ≤ <b>N, M<\/b> ≤ 10<sup>3<\/sup><\/li>\n<li> 0 ≤ <b>minSalary<\/b>[i] ≤ 10<sup>9<\/sup><\/li>\n<li> 0 ≤ <b>qual<\/b>[i][j] ≤ 1<\/li>\n<li> 1 ≤ <b>offeredSalary<\/b>[i] ≤ 10<sup>9<\/sup><\/li>\n<li> 1 ≤ <b>maxJobOffers<\/b>[i] ≤ 10<sup>6<\/sup><\/li>\n<li>All elements of the array <b>offeredSalary<\/b> are distinct<\/li>\n<\/ul>\n\n<h3>Subtasks<\/h3>\n<ul>\n<li><b>Subtask 1<\/b> (30 points): 1 ≤ <b>N, M<\/b> ≤ 200<\/li>\n<li><b>Subtask 2<\/b> (70 points): Original Constraints<\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n1\n5 6\n5000 10000 3000 20 100\n10000 2\n800 2\n600 1\n10 8\n1000 9\n2000 10\n111111\n100000\n000000\n000001\n100100\n\n<b>Output:<\/b>\n3 22000 4\n<\/pre>\n\n<h3>Explanation<\/h3>\nThere are 5 candidates and 6 companies. <\/p>\n<p>The first candidate wants a job that pays at least 5000 Rs. He has qualified in all the companies, so he will choose the 1st company that provides him the maximum money, 10000 Rs.<\/p>\n<p>The second candidate will get a job offer of 10000 Rs from 1st company.<\/p>\n<p>The third candidate has not qualified in any company, so he won't get any job.<\/p>\n<p>The fourth candidate has qualified only in 6-th company which provides a salary of 2000 Rs which is greater than or equal to 20, the minimum salary expected by the fourth candidate.<\/p>\n<p>The fifth candidate wants minimum salary 100 Rs. He has qualified in company 1st and 4th. The 1st company won't hire him as it has already filled the quota of hiring two people. 4th company is providing the candidate less than 100 Rs, so he won't join that too.<\/p>\n<p>So, overall there are three candidates that got the job (first, second and fourth). Total amount of salary is 10000 + 10000 + 2000 = 22000. Only first and 6-th companies are able to select some candidates, so there are 4 companies that are not able to hire any candidate. Hence, the answer will be 3 22000 4.<\/p.","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 6.3, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, kotlin, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.5, RUBY, rust, SCALA, SCM chicken, SCM guile, SCM qobi, ST, swift, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"naksh9619","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>naksh9619<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"2-08-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/aug17'>\n                    aug17\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/implementation'>\n                    implementation\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/naksh9619'>\n                    naksh9619\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple'>\n                    simple\n                <\/a>","editorial_url":"https:\/\/discuss.codechef.com\/problems\/GCAC","time":{"view_start_date":1503048600,"submit_start_date":1503048600,"visible_start_date":1503048600,"end_date":1735669800,"current":1514817149},"user":{"username":null},"todo":false,"problem_status":"unattempted"}