{"category_name":"easy","status":"success","problem_code":"GERMANDE","problem_name":"Gerrymander","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p> The country of BitLand is divided into <b>N<\/b> districts, and these districts are arranged in a circle: <b>1, 2, 3, ..., N<\/b>, where <b>i<\/b> and <b>i+1<\/b> are adjacent for all <b>1 ≤ i ≤ N-1<\/b>, and also <b>1<\/b> and <b>N<\/b> are adjacent. It is given that <b>N = o<sub>1<\/sub> * o<sub>2<\/sub><\/b>, where <b>o<sub>1<\/sub><\/b> and <b>o<sub>2<\/sub><\/b> are odd integers.\n<\/p>\n\n<p>\nThere are only 2 political parties in BitLand: the Zeros and the Ones. There was an election, in which each district chose it's representative who is either a Zero or a One. We know this data. i.e. for each of the <b>N<\/b> districts, we know whether their representative is a Zero or a One.\n<\/p>\n\n<p>\nThe <b>N<\/b> districts should be partitioned into <b>o<sub>1<\/sub><\/b> states, where each state consists of <b>o<sub>2<\/sub><\/b> consecutive districts.\n<br \\>\nFor example, if <b>o<sub>1<\/sub> = 5<\/b> and <b>o<sub>2<\/sub>=3<\/b>, then <b>N=15<\/b>, and {1,2,3} would be a valid state. {2,3,4}, {13,14,15}, {14,15,1}, {15,1,2} are other examples of valid states. But {3,5,6} is not a valid state, because the districts are not consecutive.\n<\/p>\n\n<p>\nA state gets a One Governor if, among all the <b>o<sub>2<\/sub><\/b> district representatives belonging to it, there are more One district representatives than Zero representatives. And it gets a Governor who is from the Zero party, if the majority of its district representatives are from the Zero party. And because <b>o<sub>2<\/sub><\/b> is odd, there will be no ties.\n<\/p>\n\n<p>\nThe President of BitLand will be a One if the majority of the <b>o<sub>1<\/sub><\/b> state Governors are Ones. Otherwise, the President will be from the Zero party.\n<\/p>\n\n<p>\nBut the state boundaries have not been fixed yet. Given just the district-wise data (i.e. whether each district's representative is a Zero or a One), you need to find if there is a way to partition them into states such that the President is a One.\n<\/p>\n\n\n\n<h3>Input<\/h3>\n\n<ul>\n<li>The first line contains one integer, <b>T<\/b>, which is the number of testcases.\n<li>The first line of each testcase contains two space separated integers, <b>o<sub>1<\/sub><\/b> and <b>o<sub>2<\/sub><\/b>, which are the number of states, and number of districts in each state, respectively.\n<\/li>\n<li>The next line of each testcase contains <b>N = o<sub>1<\/sub> * o<sub>2<\/sub><\/b> space separated integers: <b>d<sub>1<\/sub>, d<sub>2<\/sub>, .., d<sub>N<\/sub><\/b>. If <b>d<sub>i<\/sub><\/b> is <b>1<\/b>, then it signifies that District <b>i<\/b> has chosen a One representative. If <b>d<sub>i<\/sub><\/b> is <b>0<\/b>, then they have a Zero representative.<\/li>\n<\/ul>\n<p> <\/p>\n\n<h3>Output<\/h3>\n<ul>\n<li>Each testcase should be in a new line, and should contain <b>1<\/b>, if the President can be a One, and <b>0<\/b> otherwise.<\/li>\n<\/ul>\n<p> <\/p>\n\n\n\n<h3>Constraints<\/h3>\n<p>For all subtasks you may assume that: \n<ul>\n<li>\n<b>1 ≤ T ≤ 100<\/b>\n<\/li>\n<li><b>o<sub>1<\/sub>,o<sub>2<\/sub><\/b> will be odd positive integers.<\/li>\n\n<li><b>1 ≤<\/b> Summation of <b>o<sub>1<\/sub>*o<sub>2<\/sub><\/b> over all testcases <b>≤ 10<sup>6<\/sup><\/b><\/li>\n<li><b>0 ≤ d<sub>i<\/sub> ≤ 1<\/b><\/li>\n<\/ul>\n\n<p>\n<b>Subtask 1<\/b>: For 10% of the score,\n<ul>\n<li><b>1 ≤<\/b> Summation of <b>o<sub>1<\/sub>*o<sub>2<\/sub><\/b> over all testcases <b>≤ 10<sup>4<\/sup><\/b><\/li>\n\n<\/ul>\n<\/p>\n\n<p>\n<b>Subtask 2<\/b>: For further 20% of the score,\n<ul>\n<li>\n<b>1 ≤ o<sub>1<\/sub> ≤ 10<sup>4<\/sup><\/b>\n<\/li>\n<li>\n<b>1 ≤ o<sub>2<\/sub> ≤ 10<sup>2<\/sup><\/b>\n<\/li>\n<\/ul>\n<\/p>\n\n\n<p>\n<b>Subtask 3<\/b>: For further 70% of the score,\n<ul>\n<li>\nNo further constraints.<\/li>\n<\/ul>\n<\/p>\n\n\n<p> <\/p>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n4\n5 1\n1 0 0 1 1\n3 3\n0 0 1 1 0 1 1 0 0\n3 3\n1 1 1 0 1 0 0 1 0\n3 3\n1 0 0 1 1 0 1 0 0\n\n<b>Output:<\/b>\n1\n1\n1\n0\n<\/pre>\n<p> <\/p>\n<h3>Explanation<\/h3>\n\n<p>\nIn the first testcase, each state should have only 1 district, and hence, there is no actual choice in constructing the states. There will be three One Governors, and two Zero Governors, and hence the President will be a One.\n<\/p>\n\n<p>\nIn the second testcase, each of the three states should should have 3 districts each. Consider the following partitioning of the districts into states: {2,3,4}, {5,6,7} and {8,9,1}. So, the first state consists of the districts {2,3,4}, and the representatives of these correspond to {0,1,1}. The majority is One, and hence the first state will have a One Governor. The representatives corresponding to the second state are {0,1,1}, and so again, this will have a One Governor. The third state has representatives {0,0,0}, and hence will have a Zero Governor. On the whole, there are two One Governors, and one Zero Governor, and hence the President will be a One. And since there is a way to partition the districts into states, in which the President is a One, the answer is 1.\n<\/p>\n\n<p>\nIn the third testcase, each of the three states should should have 3 districts each. Consider the following partitioning of the districts into states: {3,4,5}, {6,7,8} and {9,1,2}. So, the first state consists of the districts {3,4,5}, and the representatives of these correspond to {1,0,1}. The majority is One, and hence the first state will have a One Governor. The representatives corresponding to the second state are {0,0,1}, and since the majority is Zero, this will have a Zero Governor. The third state has representatives {0,1,1}, and as Ones are in majority, this will have a One Governor. On the whole, there are two One Governors, and one Zero Governor, and hence the President will be a One. And since there is a way to partition the districts into states, in which the President is a One, the answer is 1.\n<\/p>\n\n<p>\nIn the fourth testcase, you can check that no matter how you construct the states, the President cannot be a One. Hence, the answer is 0.\n<\/p>\n\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"9-02-2017","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>\n                    admin2\n                <\/a>","user":{"username":null},"time":{"view_start_date":1487496600,"submit_start_date":1487496600,"visible_start_date":1487496600,"end_date":1735669800,"current":1493558214},"todo":false,"problem_status":"unattempted"}