{"category_name":"easy","status":"success","problem_code":"HX","problem_name":"Forces in the crystal","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Suppose that we have a crystalline triangular grid of atoms. Atoms are arranged on a regular grid, and each atom has six neighbors (unless it lies on the boundary of crystal). Each atom has an electric charge of <var>q<\/var>, and can be polarized in only one of two directions: up or down (the laws of physics in Byteland are somewhat surprising!). If two atoms are neighbors and share the same polarization, then a destructive force against the crystal occurs, whose value is equal to <var>q<sub>1<\/sub><\/var>*<var>q<sub>2<\/sub><\/var>. We can choose the polarization for each atom, and we would like to minimize total force working against the crystal, i.e., the sum of values of all the individual forces.<\/p>\n<h3>Input<\/h3>\n<p>First, 1000≤<var>n<\/var>≤2000, the size of input. Then <var>n<\/var> lines with <var>n<\/var> numbers in each follow. In the x-th line, 1≤<var>x<\/var>≤<var>n<\/var>, the y-th number, 1≤<var>y<\/var>≤<var>n<\/var>, is the charge of the atom with coordinates in the crystal equal to <var>(x,y)<\/var> if <var>x<\/var> is odd, <var>(x,y+1\/2)<\/var> otherwise. For any atom at coordinates <var>(x,y)<\/var>, the coordinates of the neighbors are assumed to be the following (as long as they appear in the crystal): <var>(x-1,y-1\/2),(x-1,y+1\/2),(x,y-1),(x,y+1),(x+1,y-1\/2),(x+1,y+1\/2)<\/var>. Each charge <var>q<\/var> is in the range 0.1≤<var>q<\/var>≤1.<\/p>\n<h3>Output<\/h3>\n<p>For each atom given at input, output <em>0<\/em> or <em>1<\/em> depending on whether the polarization of the atom should be directed up or down.<\/p>\n<h3>Score<\/h3>\nThe score of your program is equal to the value of the force acting on the crystal. The program is tested multiple times for different data sets, and the results are averaged.\n<h3>Example<\/h3>\n<pre><strong>Input:<\/strong>\n3\n1 2 3\n4 5 6\n7 8 9\n\n<strong>Output:<\/strong>\n0 0 0\n0 0 0\n0 0 1\n\n<strong>Score:<\/strong>\n269 = (1*2+1*4+2*3+2*5+2*4+3*6+3*5+4*5+4*7+4*8+5*6+5*8+7*8)\n<\/pre>\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.5, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, kotlin, PERL6, TEXT, SCM chicken, CLOJ, COB, FS","max_timelimit":"1.73209 - 2.59814","source_sizelimit":"50000","problem_author":"admin","problem_author_html_handle":"admin","problem_tester":null,"problem_tester_html_handle":"","date_added":"22-09-2009","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin'>admin<\/a>","time":{"view_start_date":1255253400,"submit_start_date":1255253400,"visible_start_date":1255253400,"end_date":1735669800,"current":1525198935},"user":{"username":""},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}