
{"category_name":"easy","status":"success","problem_code":"ICL1903","problem_name":"Too Many Candies","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Luke, an intergalactic traveller went on a trip across the universe and got candies from the different planets he visited. He comes back with $N$ candies and decides to distribute them among his $M$ friends. However, Luke only wants a fair distribution of the candies as he loves everyone equally. (A fair distribution is one in which each of his friends receive an equal number of candies and each friend receives at least one candy.) If a fair distribution is not possible, he might throw away some candies and try to distribute the remaining candies in a similar manner.\n \nIf he can throw away exactly $K$ candies at a time (he can throw away candies multiple times), what is the minimum number of times he will need to throw away candies before achieving a fair distribution?\n \n###Input:\n \n- First line will contain $T$, number of testcases. Then the testcases follow.\n- Each testcase contains of a single line of input, three integers $N, M, K$.\n \n###Output:\nFor each testcase, output a single integer denoting the minimum number of times he will need to throw away candies before achieving a fair distribution. If a fair distribution is not possible, print   -1.\n \n \n###Constraints\n- $1 \\leq T \\leq 10^5$\n- $2 \\leq N,M,K \\leq 10^9$\n \n###Sample Input:\n2          \n28 6 2        \n78 5 3         \n \n###Sample Output:\n2        \n1        \n               \n###EXPLANATION:\nTest case 1: There are 28 candies and 6 friends. He can distribute 24 candies fairly among his friends, each getting 4 candies. He then throws away the remaining 4 candies 2 at a time.\n \n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, R, COB, FS","max_timelimit":"1","source_sizelimit":"50000","problem_author":"la_flame_","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>la_flame_<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"20-03-2019","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/la_flame_'>la_flame_<\/a>","time":{"view_start_date":1553792400,"submit_start_date":1553792400,"visible_start_date":1553792400,"end_date":1735669800,"current":1559472948},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}