{"body":"\n<h3> All submissions for this problem are available. <\/h3><p align=\"justify\">After a long period of relaxation Alice and Bob decided to play a game.\nThis time of course not a number game. The rules of the game are as follows:<\/p>\n\n<p align=\"justify\">There is a vehicle situated at the point <strong>(m, n)<\/strong> of a rectangular grid.\nOnly one corner of the rectangular grid is defined, i.e. the left-top point <strong>(0, 0)<\/strong>,\nwhich is also known as the origin. The grid extends infinitely towards east and infinitely towards south.\nAlice and Bob are both sitting in a vehicle, initially situated at the point <strong>(m, n)<\/strong>.\nThe game they are playing ends as soon as one of them reaches <strong>(p, q)<\/strong>.<\/p>\n\n<p align=\"justify\">Now, Alice and Bob have to drive the vehicle in their respective turn.\nIn their own turn they can move the vehicle, from <strong>(x, y)<\/strong> to <strong>(x', y)<\/strong>\nor <strong>(x, y')<\/strong>; where <b>p ≤ x' &lt; x<\/b> and <b>q ≤ y' &lt; y<\/b>.\nThey can also move the vehicle to the point <strong>(x-a, y-a)<\/strong>, where <b>0 &lt; a ≤ min(x-p, y-q)<\/b>.\nAlso, <b>0 ≤ p &lt; m<\/b> and <b>0 ≤ q &lt; n<\/b>.\nThe winner is the game is the one who drives the vehicle to <strong>(p, q)<\/strong>.<\/p>\n\n<p align=\"justify\">Cunning Alice uses a biased coin for tossing purpose and always plays first.\nIt is assumed that both Alice and Bob play optimally in their respective turns.<\/p>\n\n<h3>Input<\/h3>\n<p align=\"justify\">The first line contains a single integer T denoting the number of test cases.\nT test cases follow. Each test case consists of a single line consisting of four space separated integers m, n, p, q\nrespectively.<\/p>\n\n<h3>Output<\/h3>\n<p align=\"justify\">For each test case print a string - either \"Alice\" or \"Bob\" (without the quotes), denoting the winner.<\/p>\n\n<h3>Constraints<\/h3>\n<p>1 ≤ T ≤ 1000<br \/>\n1  ≤ m, n  ≤ 1000<br \/>\n0 ≤ p &lt; m<br \/>\n0 ≤ q &lt; n<\/p>\n\n<h3>Sample Input<\/h3>\n<pre>2\n1 1 0 0\n2 4 1 2\n\n<\/pre>\n\n<h3>Sample Output<\/h3>\n<pre>Alice\nBob\n\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p align=\"justify\">In the second test case, initially the vehicle is at co-ordinate (2, 4).\nAlice now has four possible moves. Alice can move the vehicle to position (1, 4), (1, 3), (2, 3) and (2, 2).\nFor all moves that Alice can do, Bob can move the vehicle to the position (1, 2), winning the game.<\/p>    ","languages_supported":"NA","title":"IGAME","category":"NA","old_version":true,"problem_code":"IGAME"}