
{"category_name":"easy","status":"success","problem_code":"MISSME","problem_name":"Sherlock and His Device","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>Sherlock has finally caught Jim Moriarty in his own trap. Jim had called Sherlock to the amusement park to play one of his mind games, but he wasn't aware that the Sherlock had beforehand bugged the whole place with his newly invented device, which tells Sherlock the chances of Moriarty being at a particular place in the park.\n\nThe design of the Amusement park if plotted on a graph is in the form of a tree having no self-loops or multiple edges of $N$ vertices and rooted at index $1$. Sherlock's device returns an array of length $N$ consisting of integers. The Higher the value of integer at $ith$ index the higher is the probability of Moriarty being at Vertex $i$. Let the array be denoted by $K$.\n\nSherlock knows that Jim Moriarty is no fool and he can't just go to each vertex in search of Moriarity as he might run away. He devises a plan of selecting a subset of the nodes in the tree and visiting all vertices of the subset. He wants to select nodes for the subset such that he has the highest chance of catching Moriarty without alerting him. For not alerting Moriarty he says that if he visits a vertex $i$ he would not visit next $J$ levels directly below the vertex $i$. \n\n$J$ is calculated by taking the $xor( ⊕ )$ of all the values $K[a]$ where $a$ denotes the index of all the selected ancestors of $i$ and $i$ as well.\n\nlet's say sherlock selected some vertices from the tree by keeping the above condition in mind, then the total value of the subset would be  $∑ K[v]$ where $v$ denotes all the selected vertices.\n\nYou know Sherlock is Damn smart and he can find the optimal subset without your help, but for that, Sherlock would have to use his special medicines(You know what I mean) to check all the valid Combinations and chose the best subset of vertices. But as he has promised his friend Dr Watson of not taking these drugs(oops I said that) ever again, he has asked for your help.\nHelp Sherlock maximise the total value.\n\n$MISS$ $ME!!!!$ \n\n$Note$-\n\n$1.)$ if $i$ node is chosen and no ancestors of $i$ are part of the subset of selected vertices, then the value of $J$ at node $i$ will be just $K[i]$.\n\n$2.)$ the subset of selected vertices should follow Sherlock's strategy, i.e no node should be present in the subset which violates the given condition.\n\n###Input:\n- First line will contain an integer $N$ denoting the no. of vertices in the tree.\n\n- Second line will contain an array $K$ of length $N$ containing the values returned by the special device. Then $N-1$ lines follow denoting the Connections in the Tree. \n\n- Each line consists of a single line of input, two integers $X, Y$, denoting a connection between $V$<sub>$X$<\/sub> and $V$<sub>$Y$<\/sub>. \n\n###Output:\n\nOutput a single line containing the maximum possible sum by selecting some\/all(if possible) vertices from the tree keeping the above conditions in mind.\n\n###Constraints \n- $1 \\leq N \\leq 1000$\n- $0 \\leq K[i] \\leq 1023$ $where$ $K[i]$ $denotes$ $the$ $value$ $at$ $vertex$ $i$ \n\n###Sample Input:\n8\n\n1 1 1 1 1 1 1 1\n\n1 2\n\n2 3\n\n2 4\n\n3 5\n\n3 6\n\n4 7\n\n4 8\n\n###Sample Output:\n\t7\n\t\n###EXPLANATION:\nIf we select vertices $2,5,6,7,8$ then we get a total of 5. See that the given set does not violate the required condition.\nIf we select vertices $1,3,4,5,6,7,8$ then we get a total of 7. See that even this set does not violate the required condition. the J in this case for vertex 1=1 , vertex 3= 0(1 xor 1), \nvertex 4=0(1xor1)\nVertex 3 and vertex 4 have J=0 because 1 is their ancestor.\nSo the maximum answer is 7.","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"2.5","source_sizelimit":"50000","problem_author":"panik","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>panik<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"25-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/dfs'>dfs<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/medium'>medium<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/panik'>panik<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/panik'>panik<\/a>, <a class='problem-tag-small ' href='\/tags\/problems\/pelt2019'>pelt2019<\/a>","time":{"view_start_date":1547476200,"submit_start_date":1547476200,"visible_start_date":1547476200,"end_date":1735669800,"current":1559472952},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}