{"category_name":"easy","status":"success","problem_code":"NOLOGIC","problem_name":"Lack of Logic","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Consider the following dialog.<\/p>\n<p>- Father, what is the lack of logic?<br\/>- Bunny.<br\/>- Where?<br\/> - Day.<\/br\/><\/br\/><\/br\/><\/p>\n<p>As you see, father's answers have no logic demonstrating the son the notion of \"lack of logic\" using live example :D<\/p>\n<p>Let's try to formalize things. Note that both father's answers have no common letters with the corresponding questions. Probably this is the reason. <b>Let's say that the answer has no logic if it has no common letters with the question.<\/b> Your task is to write a bot that will answer annoying comments of contestants at codechef using this definition. Note that letter denotes a lowercase or uppercase English alphabet (ASCII code from 65 to 90 or from 97 to 122).<\/p>\n<p>Namely, you will be given several questions and you need to produce answers to these questions that have no logic. Note that lowercase and uppercase letters are considered the same when treating \"no common letters\" rule. Also note that this rule concerns only letters. <b>The answer should contain at least one letter.<\/b> If it is impossible to produce such answer then output \"~\" (tilde sign, quotes are for clarity).<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows. The only line of each test case contains the question. The question is a non-empty string where each character has ASCII code from 32 to 126, inclusive (refer to <a href=\"http:\/\/www.ascii.cl\/\">this<\/a>).<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output a single line containing the answer to this question that has no logic or \"~\" (quotes for clarity) if it is impossible to find such answer. Each character in the answer should be either a space (ASCII code 32), or the letter of English alphabet (lowercase or uppercase). Recall that the answer should contain at least one letter. The number of characters in the answer should not exceed 314. You can output any answer satisfying these constraints that has no logic.<\/p>\n<p><b>Note!<\/b> Special judge is very strict for this problem and check your output character-by-character. Be sure that you follow the mentioned output format precisely. For instance, your output should contain exactly <b>T<\/b> new-line characters (ASCII code 10) - one after each answer.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>314<\/b><\/li>\n<li><b>1<\/b> ≤ <b>the number of characters in the question<\/b> ≤ <b>314<\/b><\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n4\nFather, what is the lack of logic?\nWhere?\nThe quick brown fox jumps over the lazy dog.\n!!!\n\n<b>Output:<\/b>\nBunny\nDay\n~\nYou Can output aLoMsT anytihng HERE\n<\/pre><h3>Explanation<\/h3>\n<p>Example cases 1 and 2 correspond to the dialog in the problem statement. Note that we don't print dots since it is allowed to have only spaces and letters in the answer.<\/p>\n<p>In example case 3 each letter of English alphabet is used in the question. Hence we can't produce the answer that has no logic.<\/p>\n","languages_supported":"C, CPP 4.9.2, CPP14, JAVA","max_timelimit":"1","source_sizelimit":"50000","problem_author":"anton_lunyov","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>anton_lunyov<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"6-02-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/ad-hoc'>\n                    ad-hoc\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/anton_lunyov'>\n                    anton_lunyov\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cakewalk'>\n                    cakewalk\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cook31'>\n                    cook31\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/NOLOGIC","user":{"username":null},"time":{"view_start_date":1361126539,"submit_start_date":1361126539,"visible_start_date":1361126539,"end_date":1735669800,"current":1493558171},"todo":false,"problem_status":"unattempted"}