{"category_name":"easy","status":"success","problem_code":"PLAYFIT","problem_name":"Fit to Play","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p><i>Who's interested in football?<\/i><\/p>\n<p>Rayne Wooney has been one of the top players for his football club for the last few years. But unfortunately, he got injured during a game a few months back and has been out of play ever since.<\/p>\n<p>He's got proper treatment and is eager to go out and play for his team again. Before doing that, he has to prove to his fitness to the coach and manager of the team. Rayne has been playing practice matches for the past few days. He's played N practice matches in all.<\/p>\n<p>He wants to convince the coach and the manager that he's improved over time and that his injury no longer affects his game. To increase his chances of getting back into the team, he's decided to show them stats of any 2 of his practice games. The coach and manager will look into the goals scored in both the games and see how much he's improved. If the number of goals scored in the 2nd game(the game which took place later) is greater than that in 1st, then he has a chance of getting in. Tell Rayne what is the maximum improvement in terms of goal difference that he can show to maximize his chances of getting into the team. If he hasn't improved over time, he's not fit to play. Scoring equal number of goals in 2 matches will not be considered an improvement. Also, he will be declared unfit if he doesn't have enough matches to show an improvement.<\/p>\n<p><h3>Input:<\/h3>\nThe first line of the input contains a single integer T, the number of test cases.\nEach test case begins with a single integer N, the number of practice matches Rayne has played.<br \/>\nThe next line contains N integers. The ith integer, gi, on this line represents the number of goals Rayne scored in his ith practice match. The matches are given in chronological order i.e. j &gt; i means match number j took place after match number i.<\/p>\n\n<p><h3>Output:<\/h3>\nFor each test case output a single line containing the maximum goal difference that Rayne can show to his coach and manager. If he's not fit yet, print \"UNFIT\".<\/p>\n\n<p><h3>Constraints:<\/h3>\n1&lt;=T&lt;=10<br \/>\n1&lt;=N&lt;=100000<br \/>\n0&lt;=gi&lt;=1000000 (Well, Rayne's a legend! You can expect him to score so many goals!)<\/p>\n\n<h3>Example:<\/h3>\n\n<b>Input:<\/b><br \/>\n3<br \/>\n6<br \/>\n3 7 1 4 2 4<br \/>\n5<br \/>\n5 4 3 2 1<br \/>\n5<br \/>\n4 3 2 2 3<br \/>\n<br \/>\n<b>Output:<\/b><br \/>\n4<br \/>\nUNFIT<br \/>\n1<br \/>\n<br \/>\n<p><b>Explanation:<\/b><br \/>\nIn the first test case, Rayne can choose the first and second game. Thus he gets a difference of 7-3=4 goals. Any other pair would give him a lower improvement.\nIn the second test case, Rayne has not been improving in any match. Thus he's declared UNFIT.<\/p>\n<p><b><i>Note:<\/i><\/b> Large input data. Use faster I\/O methods. Prefer scanf,printf over cin\/cout.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"vamsi_kavala","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>vamsi_kavala<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"20-01-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/april12'>\n                    april12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/vamsi_kavala'>\n                    vamsi_kavala\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/PLAYFIT","user":{"username":null},"time":{"view_start_date":1334137605,"submit_start_date":1334137605,"visible_start_date":1334136600,"end_date":1735669800,"current":1493558174},"todo":false,"problem_status":"unattempted"}