{"body":"\n<h3> All submissions for this problem are available. <\/h3>\n<p>In poker, you have 5 cards. There are 10 kinds of poker hands (from highest to lowest):<\/p>\n<ul>\n<li> royal flush - ace, king, queen, jack and ten, all in the same suit\n<\/li><li> straight flush - five cards of the same suit in sequence, such<br \/>\nas 10,9,8,7,6 of clubs; ace can be counted both as the highest card or as the<br \/>\nlowest card - A,2,3,4,5 of hearts is a straight flush. But 4,3,2,A,K of hearts is not a straight flush - it's just a flush.\n<\/li><li> four of a kind - four cards of the same rank, such as four kings.\n<\/li><li> full house - three cards of one rank plus two cards of another rank\n<\/li><li> flush - five cards of the same suit (but not a straight flush)\n<\/li><li> straight - five cards in order - just like the straight flush, but mixed suits\n<\/li><li> three of a kind - three cards of one rank and two other cards\n<\/li><li> two pairs - two cards of one rank, two cards of another rank, and one more card\n<\/li><li> pair - two cards of the same rank\n<\/li><li> high card - none of the above\n<\/li><\/ul>\n<p>Write a program that will help you play poker by telling you what kind of hand you have.<\/p>\n<h3>Input<\/h3>\n<p>\nThe first line of input contains the number of test cases (no more than 20). Each test case consists of one line - five space separated cards. Each card is represented by a two-letter (or digit) word. The first character is the rank (A,K,Q,J,T,9,8,7,6,5,4,3 or 2), the second character is the suit (S,H,D,C standing for spades, hearts, diamonds and clubs). The cards can be in any order (but they will not repeat).<\/p>\n<h3>Output<\/h3>\n<p>\nFor each test case output one line describing the type of a hand, exactly like in the list above.<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\nAH KH QH TH JH\nKH 5S 3C 5C 7D\nQH QD 2S QC 2C\n\n<b>Output:<\/b>\nroyal flush\npair\nfull house\n<\/pre>    ","languages_supported":"NA","title":"POKER","category":"NA","old_version":true,"problem_code":"POKER"}