
{"category_name":"easy","status":"success","problem_code":"SIRUSERI","problem_name":"Siruseri Gerrymandering","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>The country of Siruseri has $A*B$ districts. You want to create $A$ states from these districts, such that each state has exactly $B$ districts, and each district is part of exactly one state. You don't care about the geographical location of the districts. You can pick any $B$ districts and make it into a state.\n\nThere are only two parties contesting in the coming elections: $P_1$ and $P_2$. You know the number of votes that each party receives in each district. In the i-th district, $P_1$ gets $c_i$ votes and $P_2$ gets $d_i$ votes. You are guaranteed that all these $2*A*B$ integers (the number of votes received by each party in the districts) are distinct. Also, both $A$ and $B$ are odd. \n\nSuppose you have chosen which districts belong to which states, then, to find out who wins any particular state, they follow a weird rule: Suppose the number of votes that $P_1$ gets in the $B$ districts of a particular state are $x_1, x_2, \\ldots, x_B$, and the number of votes that $P_2$ gets in the $B$ districts of this state are $y_1, y_2, \\ldots, y_B$. Then among all these $2*B$ numbers, the largest number is chosen (note that we are guaranteed of an unique largest number). If that number is some $x_i$, then $P_1$ wins this state. If the largest number is some $y_j$, then $P_2$ wins this state.\n\nYou secretly support the party $P_1$, and hence you want to assign the districts to states, in such a way, that the number of states won by $P_1$ is maximized. Find this maximum number of states that $P_1$ can win.\n\nNote that $c_i$ and $d_i$ will always remain associated with the i-th district. If the i-th district gets assigned to a particular state, then both $c_i$ and $d_i$ will be considered when deciding who won that state.\n\n###Input:\n- The first line of the input contains a single integer, $T$, the number of testcases. The description of each testcase follows.\n- The first line of each testcase contains two integers, $A$ and $B$.\n- The second line of each testcase contains $A*B$ integers: $c_1, c_2, \\ldots, c_{A*B}$, the number of votes won by $P_1$ in the districts.\n- The third line of each testcase contains $A*B$ integers: $d_1, d_2, \\ldots, d_{A*B}$, the number of votes won by $P_2$ in the districts.\n\n###Output:\nFor each testcase output a single line which contains the maximum number of states that $P_1$ can win.\n\n###Constraints:\n- $1 \\leq T \\leq 5$\n- $1 \\leq A, B$\n- $A*B \\leq 10^5$\n- $A$, $B$ are odd\n- $1 \\leq c_i, d_i \\leq 10^9$\n- All the $c_i$ and $d_i$ will be distinct.\n\n###Sample Input:\n```\n3\n1 3\n4 2 9\n5 6 7\n1 3\n4 2 9\n5 10 7\n3 3\n7 14 11 4 15 5 20 1 17\n2 13 16 9 19 6 12 8 10\n```\n\n###Sample Output:\n```\n1\n0\n3\n```\n\n###Explanation:\n**Testcase 1**: Since you have to form only 1 state, there is no choice, but to put all the 3 districts in that same state. Now to figure out who wins that single state, we take the maximum among {4, 2, 9, 5, 6, 7}. The maximum is 9, and that belongs to $P_1$. Hence $P_1$ wins this state. And because they have won 1 state, the answer is 1.\n\n**Testcase 2**: Similarly, there is no choice here. To figure out who wins that single state, we take the maximum among {4, 2, 9, 5, 10, 7}. The maximum is 10, and that belongs to $P_2$. Hence $P_2$ wins this state. And because $P_1$ have won no states, the answer is 0.\n\n**Testcase 3**: We need to make three states with three districts each. Suppose we that the 3rd, 5th and 7th districts and form a state, the votes in them would be {11, 16, 15, 19, 20, 12}. The max among these is 20, and that belongs to $P_1$. Hence $P_1$ would win this state. \n\nSimilarly, suppose we make the second state with the 2nd, 4th and 8th districts, the votes in them would be {14, 13, 4, 9, 1, 8}. The max among these is 14, and that belongs to $P_1$. Hence $P_1$ would win this state. \n\nThe remaining three districts: 1st, 6th and 9th districts form the third state. The votes in them would be {7, 2, 5, 6, 17, 10}. The max among these is 17, and that belongs to $P_1$. Hence $P_1$ would win this state. \n\nIn this situation, $P_1$ wins three states. You obviously cannot do any better. Hence the answer is 3.","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"2","source_sizelimit":"50000","problem_author":"admin2","problem_author_html_handle":"admin2","problem_tester":null,"problem_tester_html_handle":"","date_added":"17-12-2018","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/admin2'>admin2<\/a>","time":{"view_start_date":1545157800,"submit_start_date":1545157800,"visible_start_date":1545157800,"end_date":1735669800,"current":1559472959},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}