{"category_name":"easy","status":"success","problem_code":"STACKS","problem_name":"Stacks","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/COOK62\/mandarin\/STACKS.pdf\">Mandarin Chinese<\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/COOK62\/russian\/STACKS.pdf\">Russian<\/a> as well.<\/h3>\n<p><meta charset=\"utf8\" \/><\/p>\n<p>\nAs every other little boy, Mike has a favorite toy to play with. Mike's favorite toy is a set of <b>N<\/b> disks. The boy likes to compose his disks in stacks, but there's one very important rule: the disks in a single stack must be ordered by their radiuses in a <b>strictly<\/b> increasing order such that the top-most disk will have the smallest radius.\n<\/p>\n<p>\nFor example, a stack of disks with radii (5, 2, 1) is valid, while a stack of disks with radii (3, 4, 1) is not.\n<\/p>\n<p>\nLittle Mike has recently come up with the following algorithm after the order of disks are given:\n<\/p>\n<p><ul>\n<li>First, Mike initiates an empty set of disk stacks.\n<\/li><li>Then, Mike processes the disks in the chosen order using the following pattern:\n<ul>\n<li>If there is at least one stack such that Mike can put the current disk on the top of the stack without making it invalid, then he chooses the stack with the smallest top disk radius <b>strictly<\/b> greater than the radius of the current disk, and puts the current disk on top of that stack.\n<\/li><li>Otherwise, Mike makes a new stack containing only the current disk.\n\t<\/li><\/ul>\n<\/li><\/ul>\n<\/p>\n<p>\nFor example, let's assume that the order of the disk radii is (3, 4, 5, 1, 1, 2). Here's how the set of the top stack disks will appear during the algorithm's run:\n<\/p>\n<p><ul>\n<li>In the beginning of the algorithm, the set of disk stacks is empty. After processing the first disk, the set of top stack disks is {3}.\n<\/li><li>We cannot put the second disk on the only stack that we have after processing the first disk, so we make a new stack. After processing the second disk, the set of top stack disks is {3, 4}.\n<\/li><li>We cannot put the third disk on any of the available stacks, so we make a new stack. After processing the third disk, the set of top stack disks is {3, 4, 5}.\n<\/li><li>The fourth disk has radius 1, so it can be easily put on any of the available stacks. According to the algorithm, we choose the stack with the top disk radius equal to 3. After processing the fourth disk, the set of top stack disks is {1, 4, 5}.\n<\/li><li>The fifth disk has radius 1, so there are two stacks we can put it on. According to the algorithm, we choose the stack with the top disk radius equal to 4. After processing the fifth disk, the set of top stack disks is {1, 1, 5}.\n<\/li><li>The sixth disk has radius 2, so there is only one stack we can put it on. The final set of top stack disks is {1, 1, 2}.\n<\/li><\/ul>\n<\/p>\n<p>\nMike is really excited about his new algorithm, but he has so many disks that it seems impossible to simulate the algorithm manually.\n<\/p>\n<p>\nYou are given an array <b>A<\/b> of <b>N<\/b> integers denoting the radii of Mike's disks. The disks are already ordered by Mike. Your task is to find the set of the stack top disk radii after the algorithm is done.\n<\/p>\n<h3>Input<\/h3>\n<p>\nThe first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows.\n<\/p>\n<p>\nThe first line of a test description contains a single integer <b>N<\/b>.\n<\/p>\n<p>\nThe second line of the description contains <b>N<\/b> integers denoting <b>A<sub>1<\/sub>, ... , A<sub>N<\/sub><\/b>.\n<\/p>\n<h3>Output<\/h3>\n<p>\nFor each test case, output a single line. The line should start with a positive integer <b>S<\/b> denoting the number of stacks after the algorithm is done. This should be followed by <b>S<\/b> integers on the same line denoting the stacks' top disk radii in <b>non-decreasing order<\/b>.\n<\/p>\n<p>\nIf there are multiple correct answers, you are allowed to output any of them.\n<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ 10<\/li>\n<li>1 ≤ <b>N<\/b> ≤ 10<sup>5<\/sup><\/li>\n<li>1 ≤ <b>A<sub>i<\/sub><\/b> ≤ 10<sup>9<\/sup><\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n3\n6\n3 4 5 1 1 2\n10\n3 2 9 5 2 9 4 14 7 10\n8\n14 5 13 19 17 10 18 12\n\n<b>Output:<\/b>\n3 1 1 2\n5 2 2 4 7 10 \n4 5 10 12 18 \n<\/pre><h3>Explanation<\/h3>\n<p><b>Example 1<\/b> is already explained in the problem statement.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"kostya_by","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #D0011B;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>7&#9733;<\/span><span>kostya_by<\/span>","problem_tester":"shangjingbo","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>shangjingbo<\/span>","date_added":"11-09-2015","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/binary-search'>\n                    binary-search\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cook62'>\n                    cook62\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/kostya_by'>\n                    kostya_by\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/simple'>\n                    simple\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/STACKS","user":{"username":null},"time":{"view_start_date":1442773782,"submit_start_date":1442773782,"visible_start_date":1442773800,"end_date":1735669800,"current":1493558190},"todo":false,"problem_status":"unattempted"}