{"category_name":"easy","status":"success","problem_code":"SUPVIL","problem_name":"Superheroes and villains","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/LTIME43\/mandarin\/SUPVIL.pdf\">Mandarin Chinese<\/a>, <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/LTIME43\/russian\/SUPVIL.pdf\">Russian<\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/LTIME43\/vietnamese\/SUPVIL.pdf\">Vietnamese<\/a> as well.<\/h3>\n\n<p>In a world of superheroes each person is either a superhero or a villain. It is well known that every superhero has a name ending with either “man” or “woman”, for example “chefman”, “prettywoman” are Superheroes. All other persons are villains, for example “hacker” and “unclejohn\". \n<\/p>\n\n\n<p>Currently a big fight between the superheroes and the villains is going to happen. Initially there is only one superhero fighting one villain. Then total of <b>N<\/b> persons joined the fight one after another. If at point of time, there are two more superheroes than villains in the fight, superheroes will win the fight immediately, as they can overwhelm villains with their powers. On the other hand, if there are 3 more villains than superheroes at any time, they will win, because they use dirty tricks to defeat the superheroes. If over all all the fights, none of these cases happen, then the fight is declared to be a draw. For a given list of people joining the fight in the given order, decide which groups wins the fight or whether the fight is ended with a draw. \n<\/p>\n\n<h3>Input<\/h3>\n<p>In the first line there is a single integer <b>T<\/b> denoting the number of test cases to handle. After that the description of <b>T<\/b> test cases follow.<\/p>\n<p>Description of each test cases starts with a line containing a single integer <b>N<\/b> denoting the number of people joining the fight.<\/p>\n<p>The <b>i<\/b>-th of the following <b>N<\/b> lines contains the name of person joining the fight at time <b>i<\/b>.<\/p>\n\n<h3>Output<\/h3>\n<p>\nFor each test cases, output either \"superheroes\" if superheroes win the fight, \"villains\" if villains win or a \"draw\" if the fight ends with a draw. All of these strings should be outputted without quotes.\n<\/p>\n\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1 ≤ T ≤ 10<\/b><\/li> \n<li>Every person's name consists only of English lowercase letters (i.e. from 'a' to 'z') and it is no longer than 15 characters.<\/li>\n<li>No two persons have the same name.<\/li>\n<\/ul>\n\n<h3>Subtasks<\/h3>\n<p>\n<b>Subtask #1: (30 points)<\/b>\n<ul>\n<li><b>1 ≤ N ≤ 500<\/b><\/li>\n<\/ul>\n<\/p>\n\n<p>\n<b>Subtask #2: (70 points)<\/b>\n<ul>\n<li><b>1 ≤ N ≤ 10<sup>5<\/sup><\/b><\/li>\n<\/ul>\n<\/p>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n3  \n2   \nkittywoman  \nwingman  \n6  \nhacker  \nbeautywoman  \nblackjack  \nnoname  \nwatersnake  \nstrongman  \n4  \nfamousman  \nredsnake  \ntallwoman  \ntinythief  \n\n<b>Output:<\/b>\nsuperheroes\nvillains\ndraw\n<\/pre>\n\n<h3>Explanation<\/h3>\n<p><b>Example case 1.<\/b> As you know that initially a superhero is fighting with a villain. After that, superhero \"kittywoman\" joins the fight. At this point, there are two superheros and one villain. After that \"wingman\" joins the fight too. As this point of time, there are three superheros and one villain, so the number of superheros are two more than number of villains, so superheros will win the fight. <\/p>\n<p><b>Example case 2.<\/b> Other than first two peoople, six more people join the fight. The moment when the fight is decided is after <b>watersnake<\/b> joins the fight, because there are two superheroes fighting five villains, so villains will win.<\/p>\n<p><b>Example case 3.<\/b> Other than initial two people, four more people join the fight, and there is no moment at which the fight can be decided, so it ends with a draw.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"pkacprzak","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>pkacprzak<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"27-12-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/basic-prog'>\n                    basic-prog\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/cakewalk'>\n                    cakewalk\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/ltime43'>\n                    ltime43\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/pkacprzak'>\n                    pkacprzak\n                <\/a>","user":{"username":null},"time":{"view_start_date":1483203600,"submit_start_date":1483203600,"visible_start_date":1483203600,"end_date":1735669800,"current":1493558191},"todo":false,"problem_status":"unattempted"}