{"category_name":"easy","status":"success","problem_code":"TREECAKE","problem_name":"Tree Cake","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCKFL16\/mandarin\/TREECAKE.pdf\">Mandarin Chinese<\/a>, <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCKFL16\/russian\/TREECAKE.pdf\">Russian<\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/SNCKFL16\/vietnamese\/TREECAKE.pdf\">Vietnamese<\/a> as well.<\/h3>\n<p>Chef is well known for his delicious cakes with various flavors and shapes. One of his famous cakes is in the shape of a rooted binary tree of height <b>H<\/b>. The rooted binary tree has a very interesting property - for each non leaf node <b>v<\/b>, the height of the sub-tree rooted at the right child of <b>v<\/b> is exactly 1 more than that of the sub-tree rooted at the left child of node <b>v<\/b>. Note that the height of the leaf node of the tree is considered to be one and that of an empty subtree is considered to be zero. You can observe that the above property uniquely determines the rooted tree for a fixed height. So, instead of giving the entire rooted tree, we will just specify its height in the input.<\/p>\n<p>\nChef wants to cut his cake into some vertex-disjoint paths such that each node belongs to exactly one path. He wants your help to find out the minimum number of vertex-disjoint paths that cake be cut into.<\/p>\n<p>\nLet us take an example. The picture below describes the tree of height <b>H = 4<\/b>. Chef can cut this tree into 2 vertex-disjoint paths. These two paths are shown in green and red colors, respectively. This is the minimum number of paths that Chef can cut the cake into.\n<\/p>\n<p>\n<img src=\"https:\/\/s3.amazonaws.com\/codechef_shared\/download\/upload\/SNCKFL16\/1.png\" height=\"150\" \/>\n<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. This is followed by the description of the test cases.<\/p>\n<p>The only line of each test case contains a single integer <b>H<\/b>.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output a single integer in a separate line denoting the minimum number of vertex disjoint paths into which cake can be cut. As the answer could be large, output it modulo <b>10<sup>9<\/sup> + 7<\/b><\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>10<sup>4<\/sup><\/b><\/li>\n<li><b>1<\/b> ≤ <b>H<\/b> ≤ <b>10<sup>18<\/sup><\/b><\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n<tt>2\n1\n4<\/tt>\n\n<b>Output:<\/b>\n<tt>1\n2<\/tt>\n<\/pre><h3>Explanation<\/h3>\n<p><b>Example case 1.<\/b> The rooted tree will consist of only 1 node. So, Chef can cut the entire cake into 1 vertex-disjoint path consisting of the single node itself. <\/p>\n<p><b>Example case 2.<\/b> This case is already explained in the problem description.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"3","source_sizelimit":"50000","problem_author":"kingofnumbers","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>kingofnumbers<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"3-04-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/kingofnumbers'>\n                    kingofnumbers\n                <\/a>","user":{"username":null},"time":{"view_start_date":1468063200,"submit_start_date":1468063200,"visible_start_date":1468063200,"end_date":1735669800,"current":1493558196},"todo":false,"problem_status":"unattempted"}