{"body":"\n<h3> All submissions for this problem are available. <\/h3><p> As you might remember, the collector of Siruseri had ordered\na complete revision of the Voters List. He knew that constructing\nthe list of voters is a difficult task, prone to errors. Some\nvoters may have been away on vacation, others may have moved\nduring the enrollment and so on. <\/p>\n\n<p> To be as accurate as possible, he entrusted the task to three different \nofficials. Each of them was to independently record the list of voters and \nsend it to the collector. In Siruseri, every one has a ID number and\nthe list would only list the ID numbers of the voters and not their names.\nThe officials were expected to arrange the ID numbers in ascending order\nin their lists. <\/p>\n\n<p> On receiving the lists, the Collector realised that there were\ndiscrepancies - the three lists were not identical.  He decided\nto go with the majority. That is, he decided to construct the\nfinal list including only those ID numbers that appeared in at\nleast 2 out of the 3 lists.  For example if the three lists\nwere<\/p>\n\n<pre>\n23  30  42  57  90\n21  23  35  57  90  92\n21  23  30  57  90 \n<\/pre>\n\n<p>then the final list compiled by the collector would be:<\/p>\n\n<pre>\n21  23  30  57  90\n<\/pre>\n\n<p> The ID numbers 35, 42 and 92 which appeared in only one list\neach do not figure in the final list.<\/p>\n\n<p> Your task is to help the collector by writing a program that\nproduces the final list from the three given lists.<\/p>\n\n<p>Input format<\/p>\n\n<p>The first line of the input contains 3 integers\n<em>N<\/em><sub>1<\/sub>, <em>N<\/em><sub>2<\/sub> and\n<em>N<\/em><sub>3<\/sub>.  <em>N<\/em><sub>1<\/sub> is the number of\nvoters in the first list, <em>N<\/em><sub>2<\/sub> is the number of\nvoters in the second list and <em>N<\/em><sub>3<\/sub> is the number of\nvoters in the third list.  The next <em>N<\/em><sub>1<\/sub> lines\n(lines 2,...,<em>N<\/em><sub>1<\/sub>+1) contain one positive integer\neach and describe the first list in ascending order.  The following\n\n<em>N<\/em><sub>2<\/sub> lines (lines\n<em>N<\/em><sub>1<\/sub>+2,...,<em>N<\/em><sub>1<\/sub>+<em>N<\/em><sub>2<\/sub>+1)\ndescribe the second list in ascending order and the final\n<em>N<\/em><sub>3<\/sub> lines (lines\n\n<em>N<\/em><sub>1<\/sub>+<em>N<\/em><sub>2<\/sub>+2,...,<em>N<\/em><sub>1<\/sub>+<em>N<\/em><sub>2<\/sub>+<em>N<\/em><sub>3<\/sub>+1)\ndescribe the third list in ascending order.<\/p>\n\n<p>Output format<\/p>\n\n<p>The first line of the output should contain a single integer\n<em>M<\/em> indicating the number voters in the final list. The next\n<em>M<\/em> lines (lines 2,...,<em>M<\/em>+1) should contain one\npositive integer each, describing the list of voters in the final\nlist, in ascending order.<\/p>\n\n<p>Test data<\/p>\n\n<p>You may assume that 1    \n<em>N<\/em><sub>1<\/sub>,<em>N<\/em><sub>2<\/sub>,<em>N<\/em><sub>3<\/sub>\n    50000.\n<\/p>\n\n<p>Example<\/p>\n<p>Sample input:<\/p>\n\n<pre>\n5 6 5\n23\n30\n42\n57\n90\n21 \n23 \n35 \n57 \n90 \n92 \n21 \n23 \n30 \n57 \n90 \n<\/pre>\n\n<p>Sample output:<\/p>\n\n<pre>\n5\n21 \n23 \n30 \n57 \n90\n<\/pre>    ","languages_supported":"NA","title":"VOTERS","category":"NA","old_version":true,"problem_code":"VOTERS"}