{"body":"\n<h3> All submissions for this problem are available. <\/h3>\n<p><b>This problem was part of the <a href=\"http:\/\/www.codechef.com\/APRIL09\/\">CodeChef April Challenge<\/a>.  All user submissions for this contest problem are publicly available <a href=\"http:\/\/www.codechef.com\/APRIL09\/status\/A5\/\">here<\/a>.<\/b><\/p>\n<p>Shaheen has bought some gifts for a friend, which are wrapped up in several boxes of different sizes (all of which are full). She will need to carry the gifts a long way to her friend's house, so she would prefer to add some extra packing, and accommodate everything in one extra box. Moreover, to avoid damaging the contents, she does not wish to place more than two boxes directly within any box; however, boxes can be placed within boxes which contain other boxes, etc. A box which is used for holding two boxes of sizes <i>a<\/i> and <i>b<\/i> will have size <i>a<\/i>+<i>b<\/i>, and will cost Shaheen <i>a<\/i>+<i>b<\/i> coins at the local store. Please help Shaheen determine the minimum cost required to achieve the complete packing, and the number of different possible packings (arrangements of boxes within each other) having such a minimal cost.<\/p>\n<h3>Input<\/h3>\n<p>The first line of input is <i>n<\/i> &lt;=2000, the number of boxes with Shaheen's gifts. The next <i>n<\/i> lines of input contain one positive integer each, not greater than 10<sup>6<\/sup>, representing the sizes of the successive boxes.\n<\/p>\n<h3>Output<\/h3>\n<p>\nPrint to output exactly 2 numbers separated by spaces: the cost of the optimal solution, and the number of distinct ways of achieving this solution (modulo 10<sup>9<\/sup>).\n<\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n5\n3\n2\n3\n5\n1\n\n<b>Output:<\/b>\n31 3\n<\/pre><p>\n<br\/><br \/>\n<b>Explanation:<\/b><br \/>\nThe three solutions leading to cost 31 are as follows:<\/br\/><\/p>\n<p>\n1) pack the 2nd and the 5th box together, pack the resulting box together with the 1st box, and pack the result together with an additional box used for packing the 3rd and 4th boxes,<\/p>\n<p>\nor<\/p>\n<p>\n2) pack the 2nd and the 5th box together, pack the resulting box together with the 3rd box, and pack the result together with an additional box used for packing the 1st and 4th boxes,<\/p>\n<p>\nor<\/p>\n<p>\n3) pack the 2nd and the 5th box together, pack the resulting box together with the 4th box, and pack the result together with an additional box used for packing the 1st and 3rd boxes.<\/p>\n    ","languages_supported":"NA","title":"A5","category":"NA","old_version":true,"problem_code":"A5"}