{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Byteland is a strange country, with many cities, but with a poorly developed road network (in fact, there is exactly one route from each city to any other city, possibly leading through other cities). Until recently, the cities of Byteland were independently governed by proud Mayors, who chose not to integrate too tightly with their neighbours. However, recent opinion polls among Bytelandian computer programmers have shown a number of disturbing trends, including a sudden drop in pizza consumption.\nSince this had never before happened in Byteland and seemed quite inexplicable, the Mayors sought guidance of the High Council of Wise Men of Byteland. After a long period of deliberation, the Council ruled that the situation was very serious indeed: the economy was in for a long-term depression! Moreover, they claimed that tighter integration was the only way for the Bytelandian cities to survive. Whether they like it or not, the Mayors must now find a way to unite their cities as quickly as possible. However, this is not as easy as it sounds, as there are a number of important constraints which need to be fulfilled:\n<ul>\n  <li>Initially, each city is an independent State. The process of integration is divided into steps.\n  <\/li><li>At each step, due to the limited number of diplomatic envoys available, a State can only be involved in a unification process with <i>at most one<\/i> other state. At each step two States can unite to form a new State, but only if there exists a road directly connecting some two cities of the uniting States.\n  <\/li><li>The unification process is considered to be complete when all the cities belong to the same, global State.\n<\/li><\/ul>\n<\/p><p>\nThe Mayors have asked you to arrange a schedule for the diplomatic talks, so that unification can be completed in as few steps as possible. Can you handle this delicate task?<sup>a)<\/sup>\n\n\n<h3>Input<\/h3>\n<\/p><p>The first line contains <i>t<\/i>, the number of test cases (less than 1000). The descriptions of <i>t<\/i> test cases follow.\n\n<\/p><p> Each test case contains the description of the cities of Byteland, given in two lines. The first line contains a single integer <i>k<\/i>, representing the number of cities in Byteland (2 &lt;= <i>k<\/i> &lt;= 600); we assume that the cities are numbered 0,...,<i>k<\/i>-1. The second line contains exactly <i>k<\/i>-1 integers, and the <i>i<\/i>-th integer having a value of <i>p<\/i> represents a road connecting cities having numbers <i>i<\/i>+1 and <i>p<\/i> in Byteland.\n\n<h3>Output<\/h3>\n<\/p><p>For each test case, output a separate line containing one number, equal to the minimum number\nof steps required to perform the unification.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n3\n4\n0 1 2\n8\n0 1 2 0 0 3 3\n9\n0 1 1 1 1 0 2 2\n\n<b>Output:<\/b>\n2\n4\n5\n<\/pre>\n<\/p><p>\n<sup>a)<\/sup> Some conspiracy theorists claim that this task has in fact nothing to do with unification, and that it was proposed by pizza parlour lobbyists simply to boost their direct revenue at your expense. But don't worry, in any case, you are helping Byteland out of depression!<\/p>    ","languages_supported":"NA","title":"A8","category":"NA","old_version":true,"problem_code":"A8"}