{"body":"\n<h3> All submissions for this problem are available. <\/h3>\n<p>Byteland is a country located in the Archipelago of Rectangular Islands. The archipelago consists of <tt>1&lt;=n&lt;=1000<\/tt> islands. A fact that each island has a rectangular shape is very nice for Bytelandian cartographers. <\/p>\n<p><\/p><p>\nBytelandian islands are rather small and none are very fertile, so each of the rectangular pieces of cultivated land is under special control, simply speaking: &#8216;never enter there if you value your life&#8217;. Other areas are guaranteed to be freely accessible for all people.<\/p>\n<p>\nThe communication between islands is possible by ferries. On each island there is <tt>0&lt;=b&lt;=10<\/tt> terminals, from where crossings to another terminals on other islands are possible.<br \/>\nIt is known that total number of crossing connections is <tt>0&lt;=m&lt;=100000<\/tt>. Other infrastructure is practically unknown. Specifically the only possible<br \/>\nway of traveling through  the island is to do it on foot. <\/p>\n<p>\nWell, now we are close to a task you are requested to solve. John &#8211; one of the Bytelandian citizens is working as a sales manager. He is often requested to travel from one place to another which he rather dislikes.  What he'd rather do is spend his time relaxing on the beach.  Please help him to find a way to spare his time.<\/p>\n<h3>Task<\/h3>\n<p> Find the fastest ways for John to travel using ferries and foot paths on islands. Assume that while walking John is always moving one BM (Bytelandian unit of length) per BH  (Bytelandian unit of time).<br \/>\nYou can also assume that the ferry departures nearly immediately after John arrives the terminal, it will be enough to round up the walking time to the nearest integer.<\/p>\n<h3>Input<\/h3>\n<p>In the first line <tt>t<\/tt> - the number of tests, then for each test:<br \/>\nin next line <tt>n<\/tt> - the number of islands. Description of each island is as follows:<\/p>\n<pre>\nname\nw h [island dimensions]\nb - [number of terminals]\n[description of each terminal in a form:]\nname x y [name of a terminal and its coordinates]\nF [number of restricted areas F&lt;20]\nxl, yd, xr, yu [coordinates of each restricted area,\n0 &lt;=xl &lt; xr&lt;=250 0&lt;=yd &lt; yu&lt;=250.]\n<\/pre><p>\nAll coordinates are nonnegative integers measured in BM according to upper left corner of an island.<\/p>\n<p>\nYou can assume that any two restricted areas are disjoint. After the description of all islands all ferry connections are given (each connection is bi-directional). <\/p>\n<pre>\nm  [number of connections]\n[description of each connection]\nNB1 NW1 NB2 NW2 time [name of a first terminal, its island, the second respectively\nand communiaction time]\n...\n[description follows]\n...\nNBS NWS NBC NWC [start and goal terminal for John]\n<\/pre><h3>Output<\/h3>\n<p>\nFor each test describe the shortest route for John from terminal NBS on NWS island to terminal  NBC on NWC island in the following format:<\/p>\n<pre>\ncase nr Y [nr - test number]\nT [travel time in BH]\nNBS  NWS\n...\n[consecutive terminals]\n...\nNBC NWC\n[empty line]\n[consecutive tests]\n<\/pre><p>\nIf two consecutive terminals are located on the same island and John must take some walk you must give all middle point like in an example.<\/p>\n<p>\n<img src=\"\/content\/kuszi:trectarch_example.png\" width=\"100%\" \/><\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n1\n3\nW1\n8 7\n2\nLindos 4 0\nKamejros 4 7\n3\n2 1 6 2\n2 3 6 4 \n2 5 6 6 \nW2\n14 12\n2\nMalia 14 1\nKnossos 1 12\n5\n2 6 10 10\n11 1 12 6\n8 1 10 5\n11 7 12 9\n3 2 5 4\nW3 \n1 1\n1\nKorkyra 0 0\n0\n2\nKamejros W1 Knossos W2 100\nMalia W2 Korkyra W3 100\nKorkyra W3 Lindos W1\n<\/pre><p>\nAn example of a correct answer:<\/p>\n<pre>\n<b>Output:<\/b>\ncase 1 Y\n230\nKorkyra W3\nMalia W2\n12 6\n11 7\n10 10\nKnossos W2\nKamejros W1\n2 6\n2 1\nLindos W1\n<\/pre>    ","languages_supported":"NA","title":"ARCHPLG","category":"NA","old_version":true,"problem_code":"ARCHPLG"}