{"body":"\n<h3> All submissions for this problem are available. <\/h3><p><table border=\"0\" cellspacing=\"0\" cellpadding=\"0\" width=\"100%\"><tr><td width=\"50%\"><\/td><td>\n<div align=\"right\"><i>\nIt's a very funny thought that, if Bears were Bees,<br \/>\nThey'd build their nests at the bottom of trees.<br \/>\nAnd that being so (if the Bees were Bears),<br \/>\nWe shouldn't have to climb up all these stairs.<br \/><\/i>\n<hr \/>\nWinnie-the-Pooh, a Complaining Song\n<\/div><\/td><\/tr><\/table>\n<\/p><p>\n<\/p><p>Have you ever thought, when given an undirected graph in some problem, that it would be easier to solve it if the graph's edges were actually its vertices and the graph's vertices were its edges? This problem is right about this -- unfortunately, not about bears and bees (but if you want, you may think of vertices as of bears and of edges as of bees (or even vice versa)).\n\n<\/p><p>Suppose you're given an undirected graph <b>G<sub>0<\/sub><\/b> with <b>N<\/b> vertices and <b>M<\/b> edges. Let's perform a <i>simple transformation<\/i> on graph <b>G<sub>0<\/sub><\/b> to obtain graph <b>G<sub>1<\/sub><\/b> with <b>M<\/b> vertices so that each vertex of <b>G<sub>1<\/sub><\/b> corresponds to a unique edge of <b>G<sub>0<\/sub><\/b> and a pair of vertices in <b>G<sub>1<\/sub><\/b> is connected by a single edge if and only if the corresponding edges of <b>G<sub>0<\/sub><\/b> share a common vertex. Similarly, let's perform a simple transformation on graph <b>G<sub>1<\/sub><\/b> to obtain graph <b>G<sub>2<\/sub><\/b>, and let's perform a simple transformation on graph <b>G<sub>2<\/sub><\/b> to obtain graph <b>G<sub>3<\/sub><\/b>.\n\n<\/p><p>All you have to do is to output the number of vertices and edges in <b>G<sub>3<\/sub><\/b>.\n\n<h3>Input<\/h3>\n<\/p><p>The first line of the input file contains one integer <b>T<\/b> -- the number of test cases (no more than 10). Each test case is described by a line containing two integers <b>N<\/b> and <b>M<\/b> (1 ≤ <b>N<\/b>, <b>M<\/b> ≤ 1000) followed by <b>M<\/b> lines, each containing two integers between 1 and <b>N<\/b>, inclusive, separated by a single space and describing an edge of graph <b>G<sub>0<\/sub><\/b>. It's guaranteed that each edge connects two distinct vertices and each pair of vertices is directly connected by at most one edge.\n\n<h3>Output<\/h3>\n<\/p><p>For each test case output just one line containing two integers -- the number of vertices and edges in <b>G<sub>3<\/sub><\/b>.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n2\n3 3\n1 2\n1 3\n2 3\n4 4\n1 2\n1 3\n2 3\n3 4\n\n<b>Output:<\/b>\n3 3\n8 18\n\n<b>Explanation:<\/b>\n<\/pre>\n<\/p><p>In the first test case the given graph is a \"triangle\". It's easy to see that a simple transformation on a triangle results in the same triangle (as it contains three pairwise connected vertices and three pairwise \"connected\" edges).<\/p>    ","languages_supported":"NA","title":"BEARS","category":"NA","old_version":true,"problem_code":"BEARS"}