{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>Chef loves that his cooks involve themselves in group activities. \tThis month, Chef has involved his cooks in a rather very curious game. \tIt involves all his cooks, standing in a circle. Each cook is given one integer to keep, \twhich may be positive or negative (or zero). \tThe sum of all the integers, given to the cooks, is positive.<\/p>\n<p>Suppose there are N (N ≥ 3) cooks. Cooks are labeled from 1 to N. \tk's neighbors are (k-1) and (k+1), as they are standing in a circle. \tNote that if k = 1, k-1 wraps around to N; and if k = N, k+1 wraps around to 1. \tLet A[i] represent the integer that is kept by the cook i. \tThe game proceeds in turns. In each turn, any one cook may opt to play. \tNow, suppose the cook k wants to play in this turn, the following changes happen, in the given order:<\/p>\n<ul>\n<li>A[k-1] = A[k-1] + A[k]<\/li>\n<li>A[k+1] = A[k+1] + A[k]<\/li>\n<li>A[k] = -A[k]<\/li>\n<\/ul>\n<p>The game would end as soon as all the numbers kept by the cooks (each A[i]) is non-negative.<\/p>\n<p>Cooks are very impatient people! \tThey want to end the game as quickly as possible! \tHelp them determine a sequence in which they must play, such that the number of turns in which \tthe game finishes, is as low as possible. \tFor the purpose of this problem, you are to find the minimum number of turns in which the game can end!<\/p>\n<p><strong>Input format<\/strong><\/p>\n<p>The first line contains the number T, the number of test cases. In the following lines, T test cases follow (without any newlines between them.) Each test case consists of exactly two lines. The first line contains the only positive integer N, the number of cooks playing the game. The second line contains N space separated integers, the initial numbers kept by the cooks.<\/p>\n<p><strong>Output format<\/strong><\/p>\n<p>For each test case, print the minimum number of turns in which the game can end.<\/p>\n<p><strong>Constraints<\/strong><\/p>\n<p>1 ≤ T ≤ 10<br \/> 3 ≤ N ≤ 50000<br \/> -200000 ≤ (initial numbers kept by the cooks) ≤ 200000<\/p>\n<p><strong>Sample input<\/strong><\/p>\n<pre>2\n3\n1 -1 2\n3\n4 -2 -1\n\n<\/pre>\n<p><strong>Sample output<\/strong><\/p>\n<pre>1\n6\n\n<\/pre>\n<p><strong>Explanation<\/strong><\/p>\n<p>In the first case, cook 2 can take the first turn which converts the sequence into \t(0, 1, 1) and end the game.<\/p>\n<p>In the second case, the following sequence of moves are optimal.<\/p>\n<ul>\n<li>0. (4, -2, -1) -- initial<\/li>\n<li>1. (3, -3, 1) -- after cook 3 moves<\/li>\n<li>2. (0,  3, -2) -- after cook 2 moves<\/li>\n<li>3. (-2, 1, 2) -- after cook 3 moves<\/li>\n<li>4. (2, -1, 0) -- after cook 1 moves<\/li>\n<li>5. (1, 1, -1) -- after cook 2 moves<\/li>\n<li>6. (0, 0, 1) -- after cook 3 moves<\/li>\n<\/ul>\n<p><\/p>    ","languages_supported":"NA","title":"CHEF_GAM","category":"NA","old_version":true,"problem_code":"CHEF_GAM"}