{"category_name":"hard","status":"success","problem_code":"CPP","problem_name":"Chef Protection Plan","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Chef's restaurants are under attack. His competitors in disguise of customers or employees visit his restaurants and create trouble. Chef is extremely agitated. When he calms down he decides to beef up security. The plan is codenamed \"Chef Protection Plan\". Under this plan, everything is checked before being entered into restaurants. After much thinking it was decided to check for identification numbers of cooks, customers, delivery van etc. Various types of identification numbers to be checked are : \"Security number\", \"Employee number\", \"Roll number\" etc.<\/p>\n<p>Chef has restaurants all over the world. Different places have different <b>format<\/b>s for a given <b>identification number<\/b> and there are too many types of identification numbers. Thus Chef needs to specify the format for all the identification numbers in a convenient way. The format should also be consistent because the code monkeys who will be automating the process are not very careful with specifications. An identification number is composed of uppercase letters and digits and hyphen ('-') only. Thus instead of calling it an identification number, we will call it an <b>ID string<\/b> henceforth.<br\/>The rules used by Chef for specifying a <b>format of an ID string<\/b> are (formats are underlined)-<\/br\/><\/p>\n<ul>\n<li>A portion of string can be a fixed string, i.e. matches itself exactly only. Like <u>XYZ<\/u>, <u>A321<\/u>, <u>D-409<\/u> etc.<\/li>\n<li>The specification contains keywords in lowercase to describe the ID string. This is the list of keywords, along with their meaning-<br\/> - <b>to<\/b> : is used for specifying a <i>range<\/i> from a letter to letter or a digit to digit. Like <u>3 to 8<\/u>, <u>D to Z<\/u> etc. Note that ranges of numbers cannot be specified using <b>to<\/b>. <u>1 to 1000<\/u> is <b>invalid<\/b> because 1000 is not a digit but a number. Also <u>D to A<\/u> is invalid because the left-hand-side should not be greater than the right-hand-side.<br\/> - <b>or<\/b> : is used to specify a list of exclusive options. Like <u>XYZ or Y2K<\/u>, <u>1 or 3 or 55<\/u> etc.<br\/> - <b>times<\/b> : is used to specify the number of times (<b>N<\/b>) a portion of the format string is to be repeated. Like <u>A 3 times<\/u>, <u>S01 12 times<\/u> etc. The first example can also be specified simply as <u>AAA<\/u> instead. Thus as you will see there are multiple ways to specify same type of ID strings. Also the portion (to be repeated) is smallest meaningful expression. Like in <u>A B 2 times<\/u>, 'B' is repeated 2 times and not 'AB'.<br\/> - <b>optional<\/b> : is used to specify that the string portion is optional, i.e can be present or absent. Like <u>LP optional<\/u>, <u>12KL optional<\/u> etc. Also the portion (to be made optional) is smallest meaningful expression. Like in <u>A B optional<\/u>, 'B' is optional and not 'AB'.<br\/> - <b>digit<\/b> : is used to specify any digit. It is same as writing <u>0 to 9<\/u> or <u>0 or 1 or 2 or 3 or 4 or 5 or 6 or 7 or 8 or 9<\/u> in the rule.<br\/> - <b>letter<\/b> : is used to specify any letter. It is same as writing <u>A to Z<\/u> or <u>A or B or C...<\/u> in the rule.<br\/> - <b>digits<\/b> : is used to specify the number of times any digit may be repeated. It can be specified in two ways-<br\/> -- <b>exactly N digits<\/b>, where <b>N<\/b> is an integer. Like <u>exactly 3 digits<\/u> matches 007 and 987 but not 5 or 42<br\/> -- <b>upto N digits<\/b>, where <b>N<\/b> is an integer. Like <u>upto 3 digits<\/u> matches 7, 42 and 987 but not 4444. This rule can also match 0 digits. See the examples below.<br\/> - <b>letters<\/b> : is used to specify the number of times any letter may be repeated. It can be specified in two ways-<br\/> -- <b>exactly N letters<\/b>, where <b>N<\/b> is an integer. Like <u>exactly 3 letters<\/u> matches ABC and CPP but not Z or VG<br\/> -- <b>upto N letters<\/b>, where <b>N<\/b> is an integer. Like <u>upto 3 letters<\/u> matches A, BC and DEF but not PQRS. This rule can also match 0 letters.\n<li>The above keywords can be used to describe a portion of the format string. By writing such \"sub-formats\" side by side we can describe entire ID string. Like <u>3 to 8 XYZ or Y2K<\/u> matches 4XYZ, 7Y2K etc. but not XYZ, Y2K5 etc.<\/li>\n<li>The sub-formats can be nested as well. Like <u>3 to 8 or Y2K<\/u>, <u>digit 2 times<\/u>. Notice that second example is equivalent to <u>exactly 2 digits<\/u>.<\/li>\n<li>Parentheses can be used to enforce grouping in formats or to provide clarity. Like <u>XYZ 12 or 34 optional<\/u> makes 34 optional. Instead if you want '12 or 34' to be optional, you can use parentheses : <u>XYZ (12 or 34) optional<\/u>. Parenthesis can also be used when they are not really required. Like <u>((XYZ)) 234<\/u> is equivalent to <u>XYZ 234<\/u>, which can also be written as <u>XYZ234<\/u>. Note that <u>()<\/u> is invalid, because Chef believes empty parenthesis are useless.<\/li>\n<li>Spaces are used to separate keywords, strings, numbers, digits and letters from each other. Like <u>ABCoptional<\/u> is invalid, but <u>ABC optional<\/u> is valid. Spaces are very useful in breaking apart strings, like <u>AB CD 2 times<\/u>. Parenthesis can also be used for separation, like <u>AB(CD)2 times<\/u> is same as the last format. But <u>A(to)B<\/u> is invalid as parenthesis enforce grouping as well and <u>(to)<\/u> alone is invalid.<\/li>\n<\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/br\/><\/li><\/ul>\n\n<p>Now Chef is lousy at writing formats. Like he can add unnecessary spaces around words. He won't add stray symbols though. Also being a human he can sometimes end up writing erroneous formats -- the ones which do not conform to his rules. Like <u>optional ABC<\/u>, <u>1 to A<\/u> etc. are invalid formats. <b>But he would never use symbols apart from lowercase\/uppercase letter, digits, parenthesis, hyphen(-) and space.<\/b><\/p>\n<h3>Input<\/h3>\n<p>First line contains a single integer <b>T<\/b>, which specifies the number of test cases. First line of each test case contains <b>F<\/b>, the format of an ID string. The next line contains an integer <b>Q<\/b>. Then the next Q lines contain <b>IDS<\/b>, one ID string on each line.<\/p>\n<h3>Output<\/h3>\n<p>For each ID string output \"Valid-ID\" if the ID string conforms to the format, \"Invalid-ID\" otherwise. You need to ignore the queries (ID strings) for the following type of formats-<\/p>\n<p>1. If the format is inconsistent with the rules, output \"Format does not conform\". <\/p>\n<p>2. If the format is consistent with rules but can match ID strings which exceed the constraint imposed on <b>IDS<\/b> (possible length of IDS > 2000), output \"Matches too long ID\".<\/p>\n<p>3. If <b>N<\/b> (used in <u>X N times<\/u>, <u>exactly N digits<\/u> etc.) is less than 2 or greater than 12, output \"Format does not conform\"<\/p>\n<p>After each test case output an empty line.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ <b>T<\/b> ≤ 100<\/li>\n<li>1 ≤ <b>length of F<\/b> ≤ 1000<\/li>\n<li>0 ≤ <b>Q<\/b> ≤ 1000<\/li>\n<li>1 ≤ <b>length of IDS<\/b> ≤ 2000<\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n5\n  A to D - 1 to 4 exactly 2 digits  \n5\nD-409\nA-413\nCD-123\nM987\nB-1\n1 to 9 digit optional    digit optional -   CO or EC or IT - 09\n4\n326-CO-09\n123-EC-09\n1-IT-09\n123-EC-08\nX (YZ 1 optional  A413)     optional\n3\nX\nXYZA413\nXYZ1A413\nA to G upto 2 digits (1 or 3 or 5) 2 times  \n4\nA15\nG633\na15\nB5\n12times\n1\n123456789012\n\n<b>Output:<\/b>\nValid-ID\nValid-ID\nInvalid-ID\nInvalid-ID\nInvalid-ID\n\nValid-ID\nValid-ID\nValid-ID\nInvalid-ID\n\nValid-ID\nValid-ID\nValid-ID\n\nValid-ID\nValid-ID\nInvalid-ID\nInvalid-ID\n\nFormat does not conform\n\n<\/pre><h3>Notes<\/h3>\n<ul>\n<li>\"or\" has the least precedence among all keywords. For example <u>1 or 2 3 times<\/u> is interpreted as <u>1 or (2 3 times)<\/u> instead of <u>(1 or 2) 3 times<\/u>.<\/li>\n<li>\"optional\" and \"times\" have equal precedence, which is lower than all other keywords but higher than \"or\". Like  <u>1 to 3 4 times<\/u> is interpreted as <u>(1 to 3) 4 times<\/u>.<\/li>\n<\/ul>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"vinayak garg","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>vinayak garg<\/span>","problem_tester":"pieguy","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>pieguy<\/span>","date_added":"16-01-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/grammar-parsing'>\n                    grammar-parsing\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/may13'>\n                    may13\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/regex'>\n                    regex\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/string-parsing'>\n                    string-parsing\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/vinayak garg'>\n                    vinayak garg\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/CPP","user":{"username":null},"time":{"view_start_date":1368441257,"submit_start_date":1368441000,"visible_start_date":1368441000,"end_date":1735669800,"current":1493556669},"todo":false,"problem_status":"unattempted"}