{"category_name":"hard","status":"success","problem_code":"CULPRO","problem_name":"Cultural Programme","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>The Siruseri Welfare Association has organized a Cultural Programme for families in the area, to build up community spirit. The Cultural Programme is being held at the Siruseri Community Hall. Inside the hall, children perform songs and dances. Outside, local restau- rants have set up stalls selling snacks.<\/p>\n<p>As is typical on such an occasion, members of the audience drift in and out of the hall during the programme. An observant office bearer of the Siruseri Welfare Association notes down the times at which people enter and leave the hall. Suppose that is N. He wants to know the maximum size of the audience was during the course of the programme. <\/p>\n<p>For convenience, he writes down each time as a single integer - A<sub>i<\/sub>, the number of minutes from the start of the programme for the ith person. Also, the door of the hall is narrow, so at any time, either <b> one person <\/b> can enter or one person can leave the hall, but not both. Thus, each entry and exit time that is noted down is distinct.<\/p>\n<p>For example, suppose the observations noted down are the following. Each line denotes the entry time and exit time of one person. (The identity of the person is not important—the same person may enter and leave the hall many times. For instance, in the example below, it might well be that the entries and exits recorded at Serial Nos 2 and 5 refer to the same person.)<\/p>\n<p><img src=\"\/download\/extimages\/b52370c3ee7ab763d0b6ce064ba40193.png\" \/><\/p>\n<p>Your task is to read the list of entry and exit times and compute the <b> maximum size <\/b> of the audience during the programme.<\/p>\n<h3><strong>Input<\/strong><\/h3>\n<p>The first line of input is a single integer, N, the number of entries and exits recorded. This is followed by N lines of input. Each of these lines consists of two integers, separated by a space, describing one entry and exit. The first integer is the entry time and the second integer is the exit time..<\/p>\n<h3><strong>Output<\/strong><\/h3>\n<p>A single integer, denoting the maximum size of the audience during the performance.<\/p>\n<h3><strong>Constraints<\/strong><\/h3>\n<ul>\n<li>1 ≤ N ≤ 10<sup>5<\/sup><\/li>\n<li>1 ≤ A<sub>i<\/sub> ≤ 10<sup>7<\/sup><\/li>\n<\/ul>\n<p><b> <\/b><\/p>\n<h3><b>Example<\/b><\/h3>\n<p><b><b>Sample Input:<\/b> <\/b><\/p>\n<p>5<br \/>\n1 7<br \/>\n2 4<br \/>\n6 9<br \/>\n3 8<br \/>\n5 10<\/p>\n<p><b><b>Sample Output:<\/b><\/b><\/p>\n<p>4<\/p>\n<p><b> <\/b><\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"yogesh01","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>yogesh01<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"13-11-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/inpr1501'>\n                    inpr1501\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/yogesh01'>\n                    yogesh01\n                <\/a>","user":{"username":null},"time":{"view_start_date":1422551127,"submit_start_date":1422551127,"visible_start_date":1422551127,"end_date":1735669800,"current":1493556676},"todo":false,"problem_status":"unattempted"}