{"category_name":"hard","status":"success","problem_code":"EST","problem_name":"Equivalent Suffix Tries","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p><a href=\"http:\/\/en.wikipedia.org\/wiki\/Suffix_tree\">Suffix trees<\/a> are very powerful data structures. Using suffix trees it's often easy to solve the hardest computer science problems on strings. In this problem we'll consider a simplified version of suffix trees -- suffix <a href=\"http:\/\/en.wikipedia.org\/wiki\/Trie\">tries<\/a> (that is, tries formed by all suffixes of a given string).\n\n<\/p><p>Generally, the suffix tree is a tree whose edges are labeled with strings. Instead, we'll only consider suffix tries whose edges are labeled with single characters. This way every edge of a suffix tree may correspond to one or more edges connected in a chain-style fashion of a suffix trie.\n\n<\/p><p>Another trait of suffix trees is that each suffix of the string for which the suffix tree is built corresponds to exactly one path from the tree's root to a leaf. This is usually achieved by terminating each suffix of the string with a special character, say, $. However, in suffix tries we won't do that. In particular, this implies that the number of leaves in a suffix trie can be smaller than the length of the original string.\n\n<\/p><p>In the picture the suffix tries for strings 'aba' and 'abac' are presented:\n\n<img src=\"http:\/\/www.codechef.com\/download\/pic.PNG\" \/>\n\n<\/p><p>If we erase all letters from the edges of a suffix trie, it actually becomes a directed graph. Let's call two suffix tries equivalent if their corresponding directed graphs are <a href=\"http:\/\/en.wikipedia.org\/wiki\/Graph_isomorphism\">isomorphic<\/a>.\n\n<\/p><p>You're given a single string consisting of lowercase Latin letters. Your task is to find the number of different strings of the same length consisting of lowercase Latin letters as well such that their suffix tries are equivalent to the suffix trie of the given string. As this number can be large enough, output the remainder of its division by 42424242.\n\n<h3>Input<\/h3>\n<\/p><p>The first line contains a single number <b>T<\/b> -- the number of test cases (no more than 10). Each of the next <b>T<\/b> lines contains a single non-empty string of length no more than 100000 consisting of lowercase Latin letters <i>a<\/i>..<i>z<\/i>.\n\n<h3>Output<\/h3>\n<\/p><p>For each test case output just one line containing the sought number modulo 42424242.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n5\na\naa\nabc\naba\nhelloworld\n\n<b>Output:<\/b>\n26\n26\n15600\n1300\n6221124\n\n<b>Explanation:<\/b>\n<\/pre>\n<\/p><p>In the first test case every string of length 1 satisfies the condition. In the second test case every string consisting of two equal letters is fine. In the third test case every string comprising three pairwise distinct letters adds 1 to the answer. In the fourth test case string 'bee' is one of the 1300 good strings.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"5","source_sizelimit":"50000","problem_author":"gennady.korotkevich","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #D0011B;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>7&#9733;<\/span><span>gennady.korotkevich<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"6-06-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/gennady.korotkevich'>\n                    gennady.korotkevich\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hashing'>\n                    hashing\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/july12'>\n                    july12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/strings'>\n                    strings\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/EST","user":{"username":null},"time":{"view_start_date":1342000283,"submit_start_date":1342000283,"visible_start_date":1341999849,"end_date":1735669800,"current":1493556704},"todo":false,"problem_status":"unattempted"}