{"category_name":"hard","status":"success","problem_code":"GLBEGA","problem_name":"Glass Bead Game","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>  You play the following game against a devilishly clever opponent. On the table, there are two bowls ﬁlled with glass beads. In each move, depending on whose turn it is, you or your opponent can do one of the following.<\/p>\n<ul>\n<li>Move one bead from the ﬁrst bowl to the second bowl<\/li>\n<li>Remove one bead from the second bowl.<\/li>\n<\/ul>\n<p> <\/p>\n<p>At any point in the game, let x denote the number of beads in the ﬁrst bowl and y denote the number of beads in the second bowl. If x + y is even, it is your turn to move. If x + y is odd, it is your opponent’s turn to move<\/p>\n<p>At each position of the game, you get some points that depend on the number of beads, x and y, in the two bowls. This is given by a function f(x, y) = Ax<sup>2<\/sup> + By<sup>2<\/sup> + Cxy, where A, B and C are integers that are ﬁxed each time the game is played.<\/p>\n<p>The game starts with M beads in the ﬁrst bowl and N beads in the second bowl. As the game progresses, beads are removed. The game ends when both bowls are empty.<\/p>\n<p>Your score for the game is the sum of the values f(x, y) for each position (x, y) that the game passes through, starting from (M, N) and ending with (0, 0). Your aim is to obtain as high a score as possible, no matter what moves your opponent chooses. Remember that your opponent is ﬁendishly ingenious and will always play in such a way as to minimize your score.<\/p>\n<p>For example, suppose the game starts with 2 beads in each bowl and the score function is f(x, y) = x<sup>2<\/sup> − y<sup>2<\/sup> − xy: that is, A = 1, B = −1 and C = −1. Here are some plays of the game—the positions where you choose the move are enclosed in boxes and the positions where your opponent moves are not enclosed in boxes.<br \/>\n<img src=\"\/download\/extimages\/527ffcdf26a5a9d5ef96fec4f7ca6b40.png\" width=\"450px;\" \/><br \/>\n<br \/>\nIn this particular game, the best possible score that you can achieve if you consider all possible moves that your opponent can choose is −22. Recall that your devilishly clever opponent always plays in such a way that your score is minimized.<\/p>\n<h3>Input<\/h3>\n<p>The input consists of a single line containing ﬁve integers, M, N, A, B and C where M and N are the number of beads initially in the ﬁrst and second bowl, respectively and A, B and C are the coeﬃcients of the score function f(x, y) = Ax<sup>2<\/sup> + By<sup>2<\/sup> + Cxy.<\/p>\n<h3>Output<\/h3>\n<p>The output should be a single integer, the maximum score that you can achieve in this game.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li><b>1<\/b> ≤ <b>M,N<\/b> ≤ <b>600<\/b><\/li>\n<li><b>-1000<\/b>≤<b>A,B,C<\/b>≤<b>1000<\/b><\/li>\n<\/ul>\n<p> <\/p>\n<h3>Example<\/h3>\n<p><b>Input:<\/b><br \/>\n2 2 1 -1 -1<\/p>\n<p><b>Output:<\/b><\/p>\n<p>-22<font face=\"sans-serif, Arial, Verdana, Trebuchet MS\"><span style=\"white-space: normal;\"> <\/span><\/font><\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"yogesh01","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>yogesh01<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"26-12-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/easy'>\n                    easy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/greedy'>\n                    greedy\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/inpr1502'>\n                    inpr1502\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/yogesh01'>\n                    yogesh01\n                <\/a>","user":{"username":null},"time":{"view_start_date":1422636239,"submit_start_date":1422636239,"visible_start_date":1422633735,"end_date":1735669800,"current":1493556973},"todo":false,"problem_status":"unattempted"}