{"category_name":"hard","status":"success","problem_code":"GOODGAL","problem_name":"Good galaxy","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3>Read problems statements in <a href=\"\/download\/translated\/DEC14\/mandarin\/GOODGAL.pdf\" target=\"_blank\">Mandarin Chinese <\/a> and <a href=\"\/download\/translated\/DEC14\/russian\/GOODGAL.pdf\" target=\"_blank\">Russian<\/a>.<\/h3>\r\n<p>\r\n<meta charset=\"utf8\" \/>\r\n<\/p>\r\n<p>A galaxy is a set of planets with some connections between pairs of planets. Connections between planets are mutual and no planet can be connected with itself. The distance between a pair of planets is the least number of connections that you have to pass through while travelling from the first planet to the second.<\/p>\r\n<p>Now let's consider how good galaxies are formed.<\/p>\r\n<p>Initially there is a galaxy that consists of exactly one planet. At any moment, the galaxy grows by first making a copy of itself; then connecting each planet in the first copy to the corresponding planet in the second copy. Thus a galaxy which has <b>P<\/b> planets and <b>M<\/b> connections would grow into a new galaxy with <b>2P<\/b> planets and <b>2M+P<\/b> connections.<\/p>\r\n<p>This diagram shows how the galaxy grows over the first two iterations. Dark grey shows the copy of the galaxy; light grey shows the additional connections.<\/p>\r\n<p><img height=\"123\" width=\"329\" src=\"\/download\/extimages\/a32212069d65c14f3c9b4a1cfbbb3571.png\" \/><\/p>\r\n<p>However, galaxies do not continue growing forever. Why? The answer is simple: comets. At any point after the galaxy has started growing, a comet may pass through the galaxy. When it does, it changes the connections between planets by the following rule:<\/p>\r\n<p><em>Two planets are connected after the comet arrives if and only if the distance between the planets was equal to 2 before the comet arrives.<\/em><\/p>\r\n<p>It can be shown that a comet will split a growing galaxy into two disconnected galaxies with identical structures.<\/p>\r\n<p>After a comet has arrived, the galaxy stops growing. Researchers have discovered that each of the two identical galaxies formed by the comet are 'good galaxies' - fit for living. In fact, galaxies formed in this way are the <em>only<\/em> good galaxies that exist.<\/p>\r\n<p>This diagram shows the result when a comet arrives after each of the first three iterations. In each one the red and blue colours show the two equivalent good galaxies.<\/p>\r\n<p><img height=\"123\" width=\"329\" src=\"\/download\/extimages\/55bf4f46313dbc1cff5ebbd214e35142.png\" \/><\/p>\r\n<p>Unfortunately, nothing lasts forever. For many reasons, such as a second comet appearing, new planets or connections between them may be created or destroyed, resulting in galaxies with many other structures and causing the galaxy to lose its 'good' status.<\/p>\r\n<p>You are given a galaxy with <b>N<\/b> planets and <b>M<\/b> connections. Your task is to determine whether this galaxy is a good galaxy - ie can be created by a comet passing through a growing galaxy.<\/p>\r\n<h3>Input<\/h3>\r\n<p>The first line of the input contains one integer <b>T<\/b> denoting the number of test cases.<\/p>\r\n<p>The first line of each test case contains two integers <b>N<\/b> and <b>M<\/b> - the number of planets in the galaxy and the number of connections. All planets are enumerated from 1 to <b>N<\/b>.<\/p>\r\n<p>The following <b>M<\/b> lines each contain a pair of different integers - two planets which are connected in the galaxy. It's guaranteed that there won't be multiple connections between any pair of planets.<\/p>\r\n<h3>Output<\/h3>\r\n<p>For each test case output one word per line: \"YES\" if the galaxy is a good galaxy, or \"NO\" if it is not.<\/p>\r\n<h3>Constraints<\/h3>\r\n<ul>\r\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>5<\/b><\/li>\r\n<li><b>2<\/b> ≤ <b>N<\/b> ≤ <b>1024<\/b><\/li>\r\n<li><b>0<\/b> ≤ <b>M<\/b> ≤ <b>40 000<\/b><\/li>\r\n<\/ul>\r\n<h3>Subtasks<\/h3>\r\n<ul>\r\n<b>Subtask #1 <\/b> [22 points]: <b>N<\/b> ≤ <b>32<\/b> \r\n<\/ul>\r\n<ul>\r\n<b>Subtask #2<\/b> [78 points]: maximum constraints \r\n<\/ul>\r\n<h3>Example<\/h3>\r\n<pre><b>Input:<\/b>\r\n5\r\n2 1\r\n1 2\r\n\r\n2 0\r\n\r\n3 3\r\n1 2\r\n2 3\r\n1 3\r\n\r\n4 6\r\n1 2\r\n1 3\r\n1 4\r\n2 3\r\n2 4\r\n3 4\r\n\r\n4 5\r\n1 2\r\n1 3\r\n1 4\r\n2 3\r\n2 4\r\n\r\n<b>Output:<\/b>\r\nYES\r\nNO\r\nNO\r\nYES\r\nNO\r\n<\/pre>\r\n<h3>Explanation<\/h3>\r\n<p><b>Test case 1.<\/b> This galaxy is equivalent to the red (or blue) galaxy in step 2 in the above image.<\/p>\r\n<p><b>Test case 2.<\/b> This galaxy is similar to test case 1, but the connection has been destroyed, so the galaxy is no longer good.<\/p>\r\n<p><b>Test case 3.<\/b> There are no good galaxies with 3 planets; some planets must have been destroyed.<\/p>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2.5","source_sizelimit":"50000","problem_author":"pavel1996","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>pavel1996<\/span>","problem_tester":"xiaodao","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FFBF00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>5&#9733;<\/span><span>xiaodao<\/span>","date_added":"9-11-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/dec14'>\n                    dec14\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/graph'>\n                    graph\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/pavel1996'>\n                    pavel1996\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/GOODGAL","user":{"username":null},"time":{"view_start_date":1418643542,"submit_start_date":1418643542,"visible_start_date":1418643000,"end_date":1735669800,"current":1493556973},"todo":false,"problem_status":"unattempted"}