{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>First for some definitions :<\/p>\n<p>Let G = (V,E) be an undirected graph containing an edge e = (u,v) with u ≠ v. Let f be a function which maps every vertex in V\\{u,v} to itself, and otherwise, maps it to a new vertex w. The contraction of e results in a new graph G′ = (V′,E′), where V′ = (V\\{u,v})∪{w}, E′ = E\\{e}, and for every x ∈ V, x′ = f(x) ∈ V′ is incident to an edge e′ ∈ E′ if and only if, the corresponding edge, e ∈ E is incident to x in G.<\/p>\n<p>An undirected graph H is called a minor of the graph G if H is isomorphic to a graph that can be obtained by zero or more edge contractions on a subgraph of G.<\/p>\n<p>A graph is connected if there exists a path between any two vertices. A biconnected graph is one which remains connected even after the removal of any one vertex and all edges incident to it.<\/p>\n<p>A simple graph is one which does not have more than one edge between any pair of vertex, nor does it have an edge from a vertex to itself.<\/p>\n<p>You need to count how many simple biconnected graphs having n vertices and m edges exist such that they do not have a cycle of length 5 as a minor. Two graphs are considered distinct if there exist vertices having labels i and j which are adjacent in the first graph, but not in the second graph.<\/p>\n<p>Input :<\/p>\n<p>The first line contains the number of test cases T. Each of the next lines contains two integers n and m.<\/p>\n<p>Output :<\/p>\n<p>Output T lines, one corresponding to each test case. For a test case, output the number of graphs as described in the question. Output the answer modulo 1000000007.<\/p>\n<pre>Sample Input :\n5\n1 0\n3 2\n3 3\n4 4\n5 10\n\n<\/pre>\n<pre>Sample Output :\n1\n0\n1\n3\n0\n\n<\/pre>\n<pre>Constraints :\n1 &lt;= T &lt;= 2000\n1 &lt;= n &lt;= 100\n0 &lt;= m &lt;= 10000\n<\/pre>\n<p><\/p>    ","languages_supported":"NA","title":"GRAPHCT","category":"NA","old_version":true,"problem_code":"GRAPHCT"}