{"category_name":"hard","status":"success","problem_code":"KOL16G","problem_name":"Optimal use of Nuclear Power plant ","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>It is now 2050 AD. A city will be built under large protective circular dome. A nuclear power plant <b>(NPP)<\/b>  built outside the city will power the whole city. For safety reasons the <b>NPP<\/b> must be at least <b>d<sub>min<\/sub> <\/b>distance away from the dome. The radius of the dome has not been fixed yet. The houses inside the dome will be built after building the dome. So for simplicity it can be assumed that each location under the dome is equally likely to have a house. In other words houses will be uniformly distributed in the land inside the dome. As the houses are full of modern electrical equipments, so the power consumption per house is quite high. So each house is connected with the <b>NPP<\/b> with the shortest possible cable underground. In the figure below you can see four houses (Blue circles) and their shortest connection with <b>NPP<\/b> (dotted line). For wiring cost and line-loss issues the average distance of the houses (assuming they are uniformly distributed under then dome) from the <b>NPP<\/b> cannot be more than <b>D<sub>avg<\/sub><\/b>. \n<\/p>\n\n<img src=\"https:\/\/www.codechef.com\/download\/upload\/ACM16KOL\/G.png\" height=\"250\">\n\n\n<p>Given the value of <b>D<sub>avg<\/sub>, d<sub>min<\/sub><\/b> your job is to find the maximum possible value of the radius of the land under dome.<\/p>\n\n<h3>Input<\/h3>\n<p>First line of the input file contains an integer <b>T (0 &lt; T ≤ 20)<\/b> which denotes how many test cases to follow. Each of the next <b>T<\/b> lines contains two strictly positive integers <b>D<sub>avg<\/sub> (0 &lt; D<sub>avg<\/sub> &lt;1000)<\/b> and <b>d<sub>min<\/sub> (0 &lt; d<sub>min<\/sub> &lt; D<sub>avg<\/sub>)<\/b>. The meaning of <b>D<sub>avg<\/sub><\/b> and <b>d<sub>min<\/sub><\/b> are given in the problem statement above.<\/p>\n\n\n\n\n<h3>Output<\/h3> \n<p>For each test case produce one line of output. This line contains a floating-point number <b>R<sub>max<\/sub><\/b>, which denotes maximum possible value of the radius of the circular land under the dome maintaining the constraints imposed by <b>D<sub>avg<\/sub><\/b> and <b>d<sub>min<\/sub><\/b>. This value should be rounded to four digits after the decimal point. Errors not exceeding <b>1.5 * 10<sup>-4<\/sup><\/b> will be ignored.<\/p>\n\n<h3>Sample<\/h3> \n<pre><b>Input<\/b>\n2\n100 20\n10 5\n\n<b>Output<\/b>\n72.6679\n4.7114\n<\/pre>\n\n\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.4","max_timelimit":"4","source_sizelimit":"50000","problem_author":"kol_adm","problem_author_html_handle":"kol_adm","problem_tester":null,"problem_tester_html_handle":"","date_added":"21-12-2016","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/kol_adm'>\n                    kol_adm\n                <\/a>","user":{"username":null},"time":{"view_start_date":1482831600,"submit_start_date":1482831600,"visible_start_date":1482831600,"end_date":1735669800,"current":1493556745},"todo":false,"problem_status":"unattempted"}