{"category_name":"hard","status":"success","problem_code":"LPARTY","problem_name":"Little Party","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/APRIL15\/mandarin\/LPARTY.pdf\">Mandarin Chinese <\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/APRIL15\/russian\/LPARTY.pdf\">Russian<\/a>.<\/h3>\n<p>A little party never killed nobody... After listening to this song  many times Leha has decided to get together with his friends and have some fun again. But things are not as simple as you might think.<\/p>\n<p> Leha has <b>N<\/b> friends and he already had <b>M<\/b> parties with them and for some reason all these events were not good. He guesses that sometimes guys can't get across with each other. <\/p>\n<p>All his friends respect him and they always have come independently of their mood. And here is the problem: there is always some subset of his friends at the party that guys from these subset become angry. <\/p>\n<p>Now Leha wants to analyze previous events and find some groups of his friends(maybe empty) with correspondent moods which usually lead to problems. He perfectly remembers their states during previous time. A friend could have come either with good mood(in this case we will denote it as an upper-case Latin letter) or with bad mood(in this case we will denote it as an lower-case Latin letter). The same letters(even if their cases differ) correspond to one friend and different letters correspond to different friends.<\/p>\n<p>Let's consider an example: Leha has 3 friends and he had 3 parties with them with states <b>AbC<\/b>(friends A and C were in good mood, but B was in bad mood), <b>Abc<\/b>(A was in good mood, others were in bad), <b>aBC<\/b>(A was in bad mood, others were in good). During all these parties something had gone wrong. We can notice that when there is subset <b>Ab<\/b>(A was in good mood, but B was in bad mood) party is spoiled and the mood of friend <b>C<\/b> doesn't matter. We also have party with state <b>aBC<\/b> which gives us problems. We can't say anything special about other subsets(for example: here all parties are spoiled with subsets <b>A<\/b>, <b>b<\/b> but we don't have enough information to assume that these subsets are always bad)<\/p>\n<p>So we have two subsets which if are presented guarantee us some problems: <b>Ab<\/b> and <b>aBC<\/b>. We will call them <i>key subsets<\/i>. Leha wants to find several key subsets with minimal total size that describe all problem parties. In the example enough key subsets with minimal total size are: <b>Ab<\/b> and <b>aBC<\/b> with total size of 5. He could also find subsets straightforwardly <b>AbC<\/b>, <b>Abc<\/b>, <b>aBC<\/b> but their total size would be 9, so he will choose the first option.<\/p>\n<p>The idea of finding problem key subsets with minimal total size is good, but Leha doesn't like time-consuming and boring tasks. He asks you to do this job for him. <\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. Each of the  following<b>T<\/b> test cases starts with two integer numbers <b>N<\/b> and <b>M<\/b>. <b>M<\/b> strings describing failed parties that already have been hold follow(one string per one line). Each string consists of <b>N<\/b> first Latin letters.<\/p>\n<p> <\/p>\n<h3>Output<\/h3>\n<p>For each test case, output a single line containing one integer - the minimal possible total size of key subsets.<\/p>\n<p> <\/p>\n<h3>Constraints<\/h3>\n<p><ul>\n<li><b>1<\/b> ≤ <b>T<\/b> ≤ <b>120<\/b><\/li>\n<li><b>0<\/b> ≤ <b>M<\/b> ≤ <b>1000<\/b><\/li>\n<\/ul>\n<\/p>\n<p>Subtask 1 (23 points):<\/p>\n<ul>\n<li><b>1<\/b> ≤ <b>N<\/b> ≤ <b>3<\/b><\/li>\n<\/ul>\n\n<p>Subtask 2 (77 points)<\/p>\n<ul>\n<li><b>1<\/b> ≤ <b>N<\/b> ≤ <b>5<\/b><\/li>\n<\/ul>\n\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n2\n3 3\nAbC\nAbc\naBC\n3 2\nabc\nAbC\n<b>Output:<\/b>\n5\n6\n<\/pre><p> <\/p>\n<h3>Explanation<\/h3>\n<p>The first test case is explained in the problem statement.<\/p>\n<p>In the second test case we can only take two given subsets and can't find anything less.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYPY, PYTH, PYTH 3.4, RUBY, SCALA, SCM chicken, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1.2","source_sizelimit":"50000","problem_author":"pavel1996","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>pavel1996<\/span>","problem_tester":"xcwgf666","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","date_added":"25-02-2015","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/april15'>\n                    april15\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/backtracking'>\n                    backtracking\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/bitmasking'>\n                    bitmasking\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/maths'>\n                    maths\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/pavel1996'>\n                    pavel1996\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/LPARTY","user":{"username":null},"time":{"view_start_date":1428917400,"submit_start_date":1428917400,"visible_start_date":1428917400,"end_date":1735669800,"current":1493556759},"todo":false,"problem_status":"unattempted"}