{"category_name":"hard","status":"success","problem_code":"MARTARTS","problem_name":"Martial Arts","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Chef somehow strayed away from kitchen and got involved in martial arts. He isn't in the right shape to get into fights but he is qualified enough to be a coach in the local gym. He's just been put in charge of organizing an upcoming tournament.<\/p>\n<p>There will be two teams of N fighters participating in the tournament. We will refer to the Chef's team as home team. The other one will be guest team. As the organizer, Chef has to assign all fighters to N fights. One contestant from each team will take part in a fight and the judges will award certain number of points to each fighter's team according to their performance. Team's final score is equivalent to the sum of points which the contestants earned in their fights. Chef has to assign every fighter to exactly one fight.<\/p>\n<p>Chef knows all participants very well and wants to assign pairs in such way that will maximize the difference between home and guest team's score. Let's say that home team will score H and guest team G points. Chef wants to maximize H-G. If he can do that in multiple ways, he would then like to maximize H.<\/p>\n<p>However, he is not the only one with a hidden agenda. After the pairs are announced, guest coach can make up an excuse that one of his contestants got injured. This means that this contestant's fight won't take place and therefore won't contribute to team scores. When deciding whether to cancel some fight and which fight should that be, the guest coach has a similar goal as Chef. His primary goal is to maximize G-H and secondary to maximize G.<\/p>\n<p>Chef is stunned by guest coach's tactic and asks for your help to organize fights optimally.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains the number of contestants N in each team. The following N lines describe all possible pairings of contestants. j-th element in i-th line is of the form \"A<sub>i,j<\/sub>:B<sub>i,j<\/sub>\" which means that home team would get A<sub>i,j<\/sub> points and guest team B<sub>i,j<\/sub> points if i-th contestant from home team fights against the j-th from guest team.<\/p>\n<h3>Output<\/h3>\n<p>Output the number of points H scored by home team and the number of points G scored by guest team in an optimally conducted tournament. Separate them by a single space.<\/p>\n<h3>Constraints<\/h3>\n<ul>\n<li>1 ≤ N ≤ 100<\/li>\n<li>0 ≤ A<sub>i,j<\/sub>, B<sub>i,j<\/sub> &lt; 10<sup>12<\/sup><\/li>\n<\/ul>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\n10:7 0:20 6:5\n5:5 0:10 8:10\n0:0 50:0 100:0\n\n<b>Output:<\/b>\n18 17\n<\/pre><h3>Explanation<\/h3>\n<p>Chef will pair contestants in the following way: (1,1), (2,3), (3,2). Coach of the guest team will cancel the last fight (3,2) which would earn home team 50 points. This way the final score is 18 points for home team and 17 points for guest team.<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"5","source_sizelimit":"50000","problem_author":"thocevar","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>thocevar<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"21-09-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/bipartite'>\n                    bipartite\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/matching'>\n                    matching\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/nov12'>\n                    nov12\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/thocevar'>\n                    thocevar\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/MARTARTS","user":{"username":null},"time":{"view_start_date":1352712600,"submit_start_date":1352712600,"visible_start_date":1352712600,"end_date":1735669800,"current":1493556766},"todo":false,"problem_status":"unattempted"}