{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>\nChef's brother likes to put words in Chef's mouth.\nChef hates it about him of course.\nHe has decided to become extremely careful about what he speaks.\nFortunately, he knows how his brother transforms the words, that Chef uses.\nHe has decided to use only those words which remain the same even after his brother's transformation!\n<br \/><br \/>\nIf Chef speaks an <b>N<\/b> letter word, his brother moves all the letters which are at even positions (assuming, numbering of positions starts from 1), to the beginning of the word; and the rest of the letters follow as they appeared in the word, e.g. abdef becomes beadf; cdcd becomes ddcc.\n<br \/><br \/>\nChef wants to know how many words he can use, provided that the length of each word is between <b>L<\/b> and <b>R<\/b> inclusive and each word is composed of lowercase letters of the English alphabet. They use an ancient language in Byteland, which allows all possible words within the above definition!\n<\/p>\n\n<h3>Input<\/h3>\n\n<p>\nThe first line contains a positive integer <b>T<\/b>, the number of test cases. In the following lines, <b>T<\/b> test cases follow. Every test case is a single line that contains two space separated positive integers, <b>L<\/b> and <b>R<\/b>. <b>L<\/b> is lower bound and <b>R<\/b> is upper bound for the length of the word that Chef wants to use.\n<\/p>\n\n<h3>Output<\/h3>\n<p>\nFor each test case, print the number of words with length between <b>L<\/b> and <b>R<\/b> inclusive that Chef can use; that is, number of words, which remain the same after brother's transformation. \nSince the result can be quite large, output the result modulo <b>1000000007<\/b>.\n<\/p>\n\n<h3>Constraints<\/h3>\n<p><b>\n1 &lt;= T &lt;= 5\n<br \/>\n1 &lt;= L &lt;= R &lt;= 10<sup>10<\/sup>\n<br \/>\nR - L &lt;= 50000\n<\/b><\/p>\n\n<h3>Sample input<\/h3>\n\n<pre>3\n1 5\n6 7\n45 50\n\n<\/pre>\n\n<h3>Sample output<\/h3>\n\n<pre>1430\n18252\n871229844\n\n<\/pre>    ","languages_supported":"NA","title":"MISINT2","category":"NA","old_version":true,"problem_code":"MISINT2"}