{"body":"\n<h3> All submissions for this problem are available. <\/h3><p>\nYou are playing the game Heroes of Magical Might. Your  hero is in a grid map divided into MxN squares.\n<\/p>\n<p>\nThere are three kinds of possible objects in each square:\n<\/p>\n<ul>\n<li>Obstacles: these can be trees, mountains, houses, and so on. Your hero cannot walk into these squares. These squares are represented by the characters '#'.\n<\/li><li>Treasures: your hero can find some gold or earn experience points when collecting these treasures. These squares are represented by the characters '*'.\n<\/li><li>Gates: these gates form a complex interconnected network in the map. Your hero can travel almost instantly between the gates, represented by the characters '@'.\n<\/li><\/ul>\n<p>You control the hero turn by turn. In each turn, you can:\n<\/p><p>Choose one of the four possible directions, and move to the adjacent square in that direction. However, due to fog, your hero will only succeed with probability P. He may go in the remaining 3 directions with equal probability (1-P)\/3. If the adjacent square is an obstacle or is outside the maze, the hero remains in the current square.\n<\/p><p>In addition, if your hero's current square is a gate, your hero could choose to enter the gate. He will appear in one of the remaining gates with equal probabilities, i.e. with probability 1\/(Number of Gates - 1).\n<pre>\n.@.\n@#@\n<\/pre>\n<\/p><p>For example, in the above map, suppose your hero's starting position is at (1,1) and P = 0.8. If the hero moves down in the first turn, he may succeed and end up in the gate at (2,1) with probability 0.8. With probability 0.2 \/ 3, he may go right and end up in the gate at (1,2). With probability 2*0.2 \/ 3, he just remains at (1,1) since the top and left direction would lead him out of the maze.\n<\/p><p>If the hero choose to enter the gate at (2,2), he may end up at (1,2) or (2,3) with equal probability 1\/2.\n\n<\/p><p>Find the optimum strategy to control your hero such that <i>the expected number of turns to collect the first treasure<\/i> is minimized.<\/p>\n<h3>Input<\/h3>\n<p>\nThe first line contains t, the number of test cases (about 15). Then t test cases follow, preceded by empty lines. Each test case has the following form.\n<\/p><p>The first line contains two numbers M and N (1&lt;=M,N&lt;=20), describing the dimensions of the map.<\/p>\n<p>Each line in the next M lines contains N characters describing the maze. The meanings of the characters are:<\/p>\n<ul>\n<li>'*': treasure\n<\/li><li>'#': obstacle\n<\/li><li>'.': empty square\n<\/li><li>'@': gate\n<\/li><li>'S': starting point of the hero\n<\/li><\/ul>\n<p>You are guaranteed that the hero can always collect at least one treasure with probability greater than 0. The number of gates will never be 1. There is exactly one 'S' character in the maze.\n\n<h3>Output<\/h3>\n<\/p><p>For each test case, output the minimum expected number of turns until the hero collects the first treasure, rounded to two decimal places.\n\n<h3>Example<\/h3>\n\n<pre>\n<b>Input:<\/b>\n4\n\n1 2\nS*\n0.7\n\n1 2\nS*\n0\n\n2 4\nS##*\n@##@\n0.8\n\n2 18\nS...*.#@*......*@.\n.@....#...........\n0.6\n\n<b>Output:<\/b>\n1.43\n3.00\n3.50\n6.41\n<\/pre><\/p>    ","languages_supported":"NA","title":"N2","category":"NA","old_version":true,"problem_code":"N2"}