{"category_name":"hard","status":"success","problem_code":"QMARKS","problem_name":"Lucy and Question Marks","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in Russian <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/LTIME06\/russian\/QMARKS.pdf\">here<\/a><\/h3>\n<p>Long ago Lucy had written some sentences in her textbook. She had recently found those her notes. But because of the large amount of time that had passed, some letters became difficult to read. Her notes are given to you as a string with question marks in places of letters that are impossible to read. <\/p>\n<p>Lucy remembers that those sentences definitely made some sense. So now she wants to restore them. She thinks that the best way to restore is to replace all the question marks by latin letters in such a way that the total sum of occurrences of all the strings from her dictionary in it is maximal. And it is normal if some word occurs in her dictionary two or more times. In this case you just have to count every word as much times as it occurs in the dictionary.<\/p>\n<p>You will be given the string itself and the dictionary. Please output the maximal possible number of occurrences of dictionary words and lexicographically minimal string with this number of occurrences.<\/p>\n<h3>Input<\/h3>\n<p>The first line of the input contains an integer <b>T<\/b> denoting the number of test cases. The description of <b>T<\/b> test cases follows.<br \/><br \/>\nThe first line of every test case consists of two integers <b>N<\/b> and <b>M<\/b> - the length of the string, written by Lucy and the number of words in the dictionary. The second line of the test case consists of the string itself - <b>N<\/b> characters, each is either a question mark or a small latin letter.<br \/>Then,  <b>M<\/b> lines follow. Each line consist of a single string of small latin letters - the word from the dictionary.<\/p>\n<h3>Output<\/h3>\n<p>For each test case, output a two lines. The first line should contain the maximal number of occurrences. The second line should contain lexicographically minimal string with the maximal number of occurrences of the words from the dictionary.<\/p>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n3\n7 4\n???????\nab\nba\naba\nx\n5 3\n?ac??\nbacd\ncde\nxa\n8 2\n?a?b?c?d\necxd\nzzz\n\n<b>Output:<\/b>\n9\nabababa\n2\nbacde\n1\naaabecxd\n<\/pre><h3>Scoring<\/h3>\n<p>\nSubtask 1 (16 points): <b>T<\/b> = 50, 1 &lt;= <b>N<\/b> &lt;= 8, 1 &lt;= <b>M<\/b> &lt;= 10. Only the characters a, b and c and question marks occur in the string. Only the characters a, b, and c occur in the dictionary words. All the words in the dictionary consist of no more than 10 letters.<br \/><br \/>\nSubtask 2 (32 points): <b>T<\/b> = 50, 1 &lt;= <b>N<\/b> &lt;= 100, 1 &lt;= <b>M<\/b> &lt;= 100. Only the characters a, b and question marks occur in the string. Only the characters a and b occur in the dictionary words. All the words in the dictionary consist of no more than 10 letters.<br \/><br \/>\nSubtask 3 (52 points): <b>T<\/b> = 10, 1 &lt;= <b>N<\/b> &lt;= 1000, 1 &lt;= <b>M<\/b> &lt;= 1000. Total length of all the dictionary strings will not exceed 1000.<br \/><br \/>\nTime limit for the last subtask equals to 2 sec. For the first two subtasks it is 1 sec.\n<\/p>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1 - 2","source_sizelimit":"50000","problem_author":"xcwgf666","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","problem_tester":"Rubanenko","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>rubanenko<\/span>","date_added":"3-11-2013","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/aho-corasick'>\n                    aho-corasick\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/easy-medium'>\n                    easy-medium\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/ltime06'>\n                    ltime06\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/xcwgf666'>\n                    xcwgf666\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/QMARKS","user":{"username":null},"time":{"view_start_date":1385283988,"submit_start_date":1385283988,"visible_start_date":1385283988,"end_date":1735669800,"current":1493556801},"todo":false,"problem_status":"unattempted"}