
{"category_name":"hard","status":"success","problem_code":"RIVERLND","problem_name":"Riverland","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>### Read problem statements in [Hindi](http:\/\/www.codechef.com\/download\/translated\/SNCKFL19\/hindi\/RIVERLND.pdf), [Bengali](http:\/\/www.codechef.com\/download\/translated\/SNCKFL19\/bengali\/RIVERLND.pdf), [Mandarin Chinese](http:\/\/www.codechef.com\/download\/translated\/SNCKFL19\/mandarin\/RIVERLND.pdf), [Russian](http:\/\/www.codechef.com\/download\/translated\/SNCKFL19\/russian\/RIVERLND.pdf), and [Vietnamese](http:\/\/www.codechef.com\/download\/translated\/SNCKFL19\/vietnamese\/RIVERLND.pdf) as well.\n\nThere is a country with a large river system. The cities in this country are numbered $1$ through $N$; city number $1$ is the capital. The river system forms a rooted tree such that the capital is the root. Each river connects two cities and flows towards the root. For each non-root city $i$, there is a river that flows from this city to city $p_i$. There is also a port in each city.\n\nIn the country, there are only two ways to travel between cities: by boat and by ferry. A boat can only move downstream (that is, towards the capital), while a ferry can move in both directions. There are direct ferry routes from every port to every other port.\n\nInitially, all the ports are open. Sometimes, some ports can close or open again (possibly multiple times); the port in the capital is always open. It is not allowed to travel by ferry from a closed port, but travelling to a closed port is allowed. Travelling by boat is always possible, even from a closed port.\n\nSometimes, Chef wants to go on a trip. He has already chosen a city $v$ where he will start the trip. However, he only has enough money for at most one trip by ferry. Therefore, he wants to make a trip as follows:\n- Choose a city $b$ with an opened port and travel to this city by boat. It must be possible to travel from $v$ to $b$ by boat (specifically, $v=b$ is allowed).\n- Decide to either continue from city $b$ by ferry or end the trip in this city.\n- If he decides to continue by ferry, choose a city $f$ and travel from $b$ to $f$ by ferry. It must also be possible to travel from $b$ to $f$ by ferry.\n- It is not allowed to travel along any river twice (regardless of direction), i.e. when Chef decides to continue by ferry, the shortest paths between ($v$, $b$) and ($b$, $f$) must have no common rivers.\n\nChef likes travelling by ferry, so the more rivers he visits (travels along) on a ferry, the happier he becomes. Also, each city has a fixed beauty; let's denote the beauty of city $i$ by $a_i$. Then, for a trip with *value* $T$, let's define the *happiness* Chef gains as $a_b + D \\cdot T$, where $D$ is the length of the ferry route (the number of rivers visited when travelling by ferry — possibly zero).\n\nYou should process $Q$ queries. There are three types of queries:\n- `- v`: The port in city $v$ closes. It is guaranteed that the port in city $v$ was open before this query.\n- `+ v`: The port in city $v$ reopens. It is guaranteed that the port in city $v$ was closed before this query.\n- `? v T`: Chef wants to make a trip with value $T$ from city $v$.\n\nFor each query of the third type, find the maximum happiness Chef can gain from such a trip.\n\n### Input\n- The first line of the input contains two space-separated integers $N$ and $Q$.\n- The second line contains $N-1$ space-separated integers $p_2, p_3, \\ldots, p_N$.\n- The third line contains $N$ space-separated integers $a_1, a_2, \\ldots, a_N$.\n- The following $Q$ lines describe queries. Each of these lines starts with a character $c$ denoting the type of the current query, a space and an integer $v$. If $c$ is '?', this is followed by a space and an integer $T$.\n\n### Output\nFor each query of the third type, print a single line containing one integer — the maximum obtainable happiness.\n\n### Constraints\n- $2 \\le N \\le 3 \\cdot 10^5$\n- $1 \\le Q \\le 3 \\cdot 10^5$\n- $1 \\le p_i \\lt i$ for each valid $i$\n- $1 \\le a_i \\le 10^9$ for each valid $i$\n- $1 \\le v \\le N$\n- for each query of the first or second type, $v \\neq 1$\n- $1 \\le T \\le 10^9$\n- $c \\in \\{\\text{'+'}, \\text{'-'}, \\text{'?'}\\}$\n\n### Example Input\n```\n10 9\n1 2 3 2 2 6 3 8 8\n30 20 6 13 8 40 7 9 13 1\n? 4 11\n- 4\n? 4 11\n- 7\n? 10 6\n+ 7\n- 6\n- 2\n? 7 4\n```\n\n### Example Output\n```\n57\n42\n33\n30\n```\n\n### Explanation\nIn the first query, Chef travels by ferry from city $4$ to city $7$.\n\nIn the second query, Chef cannot travel by ferry from city $4$, so he has to use the second best route, which is from city $2$ to city $7$.\n\nIn the third query, Chef travels to city $8$ by boat and then to city $7$ by ferry.\n\nIn the fourth query, Chef travels to the capital (city number $1$) by boat and does not travel by ferry at all.\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, COB, FS","max_timelimit":"3","source_sizelimit":"50000","problem_author":"forestryks","problem_author_html_handle":"forestryks","problem_tester":null,"problem_tester_html_handle":"","date_added":"8-02-2019","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/forestryks'>forestryks<\/a>","time":{"view_start_date":1550311200,"submit_start_date":1550311200,"visible_start_date":1550311200,"end_date":1735669800,"current":1559472992},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}