
{"category_name":"hard","status":"success","problem_code":"SONIQUE","problem_name":"Sonya and Queries","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span>### Read problem statements in [Hindi](http:\/\/www.codechef.com\/download\/translated\/APRIL19\/hindi\/SONIQUE.pdf) and [Bengali](http:\/\/www.codechef.com\/download\/translated\/APRIL19\/bengali\/SONIQUE.pdf)\n\n**This is an interactive problem.**\n\nSonya is a very creative and dreamy person, so she decided to open her own bakery one day. Since Sonya lives in a country where the traditional dish is apple pie, the business quickly became successful, and after a while, Sonya already had a chain of $N$ bakeries — one in each of the $N$ cities of the country. The cities are numbered $1$ through $N$ and the bakeries are numbered in the same way as the cities. At each moment, each bakery has a certain number of pies in stock; let's denote the number of pies in stock in city $i$ by $A_i$.\n\nAll the bakeries bake unique pies, so the country has built $N-1$ roads in such a way that it is possible to reach any city from all other cities using these roads (and possibly visiting other cities on the way). The roads are numbered $1$ through $N-1$. Unfortunately, in the country where Sonya lives, earthquakes happen frequently, so roads can collapse. It is impossible to use a collapsed road until it is repaired.\n\nFor each bakery, let's define its connected component as the set of all bakeries (including itself) which can be reached from it without using any collapsed roads.\n\nYou should process $M$ events. There are seven types of events, each of them corresponds to something changing in the country or Sonya asking for information related to her business:\n- type $1$: The state of the $E$-th road changes — if it was not collapsed, it collapses, and if it was collapsed, it is repaired (and becomes not collapsed).\n- type $2$: The $X$-th bakery bakes and delivers $Y$ pies to each bakery in its connected component (including itself). In other words, for each bakery $i$ in the connected component of bakery $X$, $A_i$ increases by $Y$.\n- type $3$: Each bakery from the connected component of the $X$-th bakery sends all the pies it has in stock to the $X$-th bakery, which adds them to its stock.\n- type $4$: Sonya wants to know the number of pies in stock in the $X$-th bakery.\n- type $5$: Sonya wants to know the total number of pies in stock in the connected component of the $X$-th bakery.\n- type $6$: Each bakery from the connected component of the $X$-th bakery (including itself) sells all the pies it had in stock. In other words, for each bakery $i$ in the connected component of bakery $X$, $A_i$ becomes $0$.\n- type $7$: Sonya wants to know the minimum number of roads which need to be repaired so that for each pair of bakeries $i$ and $j$ such that $A_i \\gt 0$ and $A_j \\gt 0$, it is possible to reach bakery $i$ from bakery $j$ without using any collapsed roads.\n\nYou need to answer all of Sonya's queries (for events of types $4$, $5$ and $7$). The queries need to be answered online, i.e. you must answer each query in order to receive information about the subsequent events from the grader.\n\n### Interaction\n- First, you must read a line containing a single integer $G$ — the number of the current subtask.\n- Then, you must read a line containing two space-separated integers $N$ and $M$.\n- Then, you must read $N - 1$ lines. For each $i$ ($1 \\le i \\le N-1$), the $i$-th of these lines contains two space-separated integers $u$ and $v$ denoting the cities connected by the $i$-th road.\n- Then, you must read a line containing a single string with length $N - 1$. For each valid $i$, the $i$-th character of this string is '1' if the $i$-th road is initially collapsed or '0' if it is not collapsed.\n- Then, you must read a line containing $N$ space-separated integers $A_1, A_2, \\ldots, A_N$ — the number of pies in stock initially.\n- Finally, you must repeat the following process $M$ times:\n    - Read a line describing an event. This line begins with an integer denoting the type of the event.\n        - For queries of type $1$, this integer is followed by a space and a single integer $E$.\n        - For queries of type $2$, it is followed by a space and two space-separated integers $X$ and $Y$.\n        - For queries of types $3$ through $6$, it is followed by a space and a single integer $X$.\n        - For queries of type $7$, it is not followed by anything else.\n    - If the type of the event was $4$, $5$ or $7$, print a single line containing one integer — the answer to this query.\n\nDon't forget to flush the output after printing each line!\n\n### Constraints \n- $1 \\le G \\le 5$\n- $1 \\le N, M \\le 250,000$\n- $1 \\le u, v \\le N$\n- $0 \\le A_i \\le 10^5$ for each valid $i$\n- $1 \\le E \\le N-1$\n- $1 \\le X \\le N$\n- $0 \\le Y \\le 10^5$\n\n### Subtasks\n**Subtask #1 (10 points):** $1 \\le N, M \\le 3,000$\n\n**Subtask #2 (20 points):**\n- there are no queries of type $7$\n- in each event of type $1$, a road that was collapsed is repaired\n\n**Subtask #3 (25 points):** there are no queries of type $7$\n\n**Subtask #4 (15 points):** each city is directly connected to at most two other cities (by collapsed or uncollapsed roads)\n\n**Subtask #5 (30 points):** original constraints\n\n### Example Input\n```\n5\n5 11\n1 2\n1 3\n3 4\n3 5\n0100\n1 0 6 1 3\n5 3\n3 4\n2 5 4\n4 3\n7\n6 4\n1 2\n5 4\n2 2 1\n1 3\n5 2\n```\n\n### Example Output\n```\n10\n4\n1\n1\n5\n```\n\n### Explanation\nThe following images depict the initial state of the country (Image 0) and after each event that changes the state of the country (Image 1 through Image 6, in chronological order). Bakeries\/cities are depicted as circles, uncollapsed roads as regular lines between them and collapsed roads as dashed lines. Inside each circle, there are two integers — the number of the city\/bakery and the number of pies it has in stock.\n\n![](https:\/\/codechef_shared.s3.amazonaws.com\/download\/Images\/APRIL19\/SONIQUE\/image0.png =190x275)\n\n![](https:\/\/codechef_shared.s3.amazonaws.com\/download\/Images\/APRIL19\/SONIQUE\/image123.png =500x275)\n\n![](https:\/\/codechef_shared.s3.amazonaws.com\/download\/Images\/APRIL19\/SONIQUE\/image456.png =500x275)\n","languages_supported":"C, CPP14, JAVA, PYTH, PYTH 3.6, PYPY, CS2, PAS fpc, PAS gpc, RUBY, PHP, GO, NODEJS, HASK, rust, SCALA, swift, D, PERL, FORT, WSPC, ADA, CAML, ICK, BF, ASM, CLPS, PRLG, ICON, SCM qobi, PIKE, ST, NICE, LUA, BASH, NEM, LISP sbcl, LISP clisp, SCM guile, JS, ERL, TCL, kotlin, PERL6, TEXT, SCM chicken, PYP3, CLOJ, R, COB, FS","max_timelimit":"2.5","source_sizelimit":"50000","problem_author":"smelskiy","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>smelskiy<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"3-04-2019","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/smelskiy'>smelskiy<\/a>","time":{"view_start_date":1555320602,"submit_start_date":1555320602,"visible_start_date":1555320602,"end_date":1735669800,"current":1559472994},"user":{"username":"","access":"default"},"todo":false,"problem_status":"unattempted","is_direct_submittable":false}