{"category_name":"hard","status":"success","problem_code":"TESTERS","problem_name":"Vacation","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p>Everybody knows that there are a lot of complicated problems on CodeChef and it’s quite difficult to solve them. However, very few people know that testing these problems is much more elaborate process than solving. Hosting Chef’s great contests would be impossible without his testers - Anton and Hiroto. The number of problems they solved and tested probably won’t fit in 32-bit integer. These guys do very big amount of work and of course they also need to have a rest. They are having vacation for the next ten days. Of course, they’ve chosen ChefLand as a place to go. <\/p>\n<p>\nThere are <b>N<\/b> cities in ChefLand and every city is denoted by its integer number. Surprisingly these numbers are not to be distinct. Anton is fond of Math so he quickly counted <b>the sum of squares of all positive integer divisors<\/b> for every this number; let’s call this sum for number that denotes <b>ith<\/b> city <b>S(i)<\/b>. Hiroto considers city <b>i<\/b> to be beautiful if <b>S(i)<\/b> is <b>odd<\/b>, otherwise it is ugly for him. <\/p>\n<p>\nIt’s important to mention that the cities of ChefLand are connected by <b>bidirectional<\/b> roads. It took Hiroto a couple of seconds to notice that there are exactly <b>N-1<\/b> roads and that it’s possible to reach every city from every other city by existing roads. <\/p>\n<p>\nOur testers want their vacation to consist of interesting trips. Formally trip is a path between two cities (Anton swears that there is an unique path between each pair of cities, so let’s trust him:)); the length of the trip is a number of cities it consists of. Furthermore, visiting of a single city is also a trip of length 1. The time of having any trip is equal to its length. Hiroto considers a trip to be interesting if the number of beautiful cities in it is not less than the number of ugly cities. <\/p>\n<p>\nAnton and Hiroto want to try every interesting trip. Since our testers are very smart and provident, they want to know the exact time it will take them to go through all the interesting trips. Note that if they had a trip from <b>A<\/b> to <b>B<\/b> then they are not interested in having trip from <b>B<\/b> to <b>A<\/b>.<\/p>\n<h3>Input<\/h3>\n<p>The first line contains single integer <b>N<\/b> – the number of cities in ChefLand. Then <b>N-1<\/b> lines follow – description of the roads. Each road is described by a pair of integers in <b>[1, N]<\/b> range. Then you are given <b>N<\/b> numbers in the next line. <b>Ith<\/b> of them is the number that denotes city <b>i<\/b>.<\/p>\n<h3>Output<\/h3>\n<p>The first and only line of the output should contain the total length of all the interesting trips.<\/p>\n<p><h3>Constrains<\/h3>\n<\/p><p><b>1 ≤ N ≤ 300000 (3*10<sup>5<\/sup>)<\/b><\/p>\n<p>\n<b>1 ≤ Number that denotes any city ≤ 1500000 (1.5*10<sup>6<\/sup>)<\/b><\/p>\n<h3>Example<\/h3>\n<pre>\n<b>Input:<\/b>\n3\n1 2\n1 3\n3 1 1 \n\n<b>Output:<\/b>\n9\n<p>\n<h3>Explanation<\/h3>\nHere we have <b>S(2)=S(3)=1<\/b> and <b>S(1)=10 (1 + 3<sup>2)<\/sup><\/b>, so the first city is ugly and other two are beautiful. \n(2, 2) – 1\n(3, 3) – 1\n(1, 2) – 2\n(1, 3) – 2\n(2, 3) – 3\n1+1+2+2+3=9\nThe (1, 1) trip is not interesting. \n\n<\/p><\/pre>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"2","source_sizelimit":"50000","problem_author":"Rubanenko","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>rubanenko<\/span>","problem_tester":"laycurse","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>laycurse<\/span>","date_added":"23-12-2012","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/Rubanenko'>\n                    Rubanenko\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/feb13'>\n                    feb13\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/hard'>\n                    hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/tree'>\n                    tree\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/TESTERS","user":{"username":null},"time":{"view_start_date":1360583767,"submit_start_date":1360583767,"visible_start_date":1360582602,"end_date":1735669800,"current":1493556868},"todo":false,"problem_status":"unattempted"}