{"category_name":"hard","status":"success","problem_code":"TRIPS","problem_name":"Children Trips","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><h3> Read problems statements in <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/OCT14\/mandarin\/TRIPS.pdf\">Mandarin Chinese <\/a> and <a target=\"_blank\" href=\"http:\/\/www.codechef.com\/download\/translated\/OCT14\/russian\/TRIPS.pdf\">Russian<\/a>.<\/h3>\n<p>There's a new trend among Bytelandian schools. The \"Byteland Touristic Bureau\" has developed a new project for the high-schoolers. The project is so-called \"Children's Trips\".<\/p>\n<p>The project itself is very simple: there are some touristic routes in Byteland, and <b>N<\/b> touristic campuses (numbered from <b>1<\/b> to <b>N<\/b>). For the sake of economy, there are exactly <b>N-1<\/b> road between them. Of course, even having this given, it is possible to travel from any touristic campus to any other one. Moreover, for the sake of safety, each road is no longer than <b>2<\/b> kilometers.<\/p>\n<p>When some student wants to travel, he first chooses his starting campus - he is been delivered there (say) by a helicopter. He chooses his final destination campus as well. From his final destination, he will be transported to his home by (say) a helicopter, again. So that pupil won't travel any extra distance by foot. When the start and the finish are chosen and the pupil is delivered, he starts his moving by the only route. None of pupils is infinitely strong, so first the pupil looks at the map of the touristic routes, and then he chooses the furthest campus on his way that he can reach during the current day (by safety regulations, it is strictly prohibited to sleep not at the campus because there can be a little trouble with werewolves), and moves there. Then the new day begins, and it repeats till the moment when the destination is reached.<\/p>\n<p>Of course, not all the students created equal. Somebody is good in math, somebody in English, somebody in PE. So it's quite natural that all high-schoolers has different strengths.<br \/>\nWe call the strength is the maximal number of kilometers that the pupil can pass in a day. And now you're given a lot of queries from the children. For every query, you are given the starting campus, the final campus and the strength. You are requested to calculate the number of days for every trip. The map of the campuses and the distances between them will be given to you as well.<\/p>\n<h3>Input<\/h3>\n<p>The first line of input contains the integer <b>N<\/b>, denoting the number of campuses.<\/p>\n<p>The next <b>N-1<\/b> lines contain triples of the form <b>X Y D<\/b> with the meaning that there is a road between the <b>X<\/b>-th and the <b>Y<\/b>-th campus with the length <b>D<\/b> kilometers.<\/p>\n<p>Then there is a line with a single integer <b>M<\/b>, denoting the number of queries.<\/p>\n<p>Then, there are <b>M<\/b> lines with the triples of the form <b>S F P<\/b> with the meaning that the trip starts at the campus <b>S<\/b>, ends at the campus <b>F<\/b> and the student has the strength of <b>P<\/b>.<\/p>\n<h3>Output<\/h3>\n<p>For every query, please output the number of days on a separate line.<\/p>\n<h3>Constraints<\/h3>\n<p><ul>\n<li><b>1<\/b> ≤ <b>N, M<\/b> ≤ <b>100000<\/b><\/li>\n<li><b>1<\/b> ≤ <b>X, Y, S, F<\/b> ≤ <b>N<\/b><\/li>\n<li><b>1<\/b> ≤ <b>D<\/b> ≤ <b>2<\/b><\/li>\n<li><b>2<\/b> ≤ <b>P<\/b> ≤ <b>2*N<\/b><\/li>\n<\/ul>\n<\/p>\n<h3>Example<\/h3>\n<pre><b>Input:<\/b>\n5\n1 2 1\n2 3 2 \n1 4 2\n4 5 1\n5\n1 5 3\n1 3 2\n2 5 4\n1 2 10\n4 5 2\n\n<b>Output:<\/b>\n1\n2\n1\n1\n1\n<\/pre>\n","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"8","source_sizelimit":"50000","problem_author":"xcwgf666","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #FF7F00;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>6&#9733;<\/span><span>xcwgf666<\/span>","problem_tester":"shangjingbo","problem_tester_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #3366CC;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>3&#9733;<\/span><span>shangjingbo<\/span>","date_added":"4-08-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/lca'>\n                    lca\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/medium-hard'>\n                    medium-hard\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/oct14'>\n                    oct14\n                <\/a><a class='problem-tag-small ' href='\/tags\/problems\/xcwgf666'>\n                    xcwgf666\n                <\/a>","editorial_url":"http:\/\/discuss.codechef.com\/problems\/TRIPS","user":{"username":null},"time":{"view_start_date":1413192600,"submit_start_date":1413192600,"visible_start_date":1413192600,"end_date":1735669800,"current":1493557001},"todo":false,"problem_status":"unattempted"}