{"category_name":"hard","status":"success","problem_code":"VOGOZO","problem_name":"Vogon Zoo","body":"<span class=\"solution-visible-txt\">All submissions for this problem are available.<\/span><p> On the icy planet Zorg, the Vogons are putting together a zoo. One cage will house a collection of Kubudu dragons. Unlike the limited number of blood types found in other creatures, Kubudu dragons have a large variety of blood types. Each dragon’s blood type is ﬁxed when it is born and is given by a positive integer.<\/p>\n<p>These blood types determine how the dragons interact with each other. Two dragons whose blood types are close to each other will quickly start ﬁghting and eventually destroy each other. At any given time, there is a threshold K such that it is safe to put two Kubudu dragons in the same cage only if their blood types diﬀer by K or more.<\/p>\n<p>A batch of freshly hatched Kubudu dragons has arrived. Each dragon has had its blood tested and is tagged with its blood type. The Vogon zookeeper would like to determine the size of the largest collection of dragons from this batch that can safely be placed in a single cage. Given the dragons’ ﬁghting tendencies, this means that for each pair of dragons in the cage, their blood types should diﬀer by at least K.<\/p>\n<p>For instance, suppose that K is 3 and there are 12 Kubudu dragons whose blood types are 1, 5, 6, 1, 8, 3, 12, 2, 13, 7, 9 and 11. From this batch, the maximum number of dragons that can be placed safely in the same cage is 4—for example, the dragons with blood types: 6, 12, 2 and 9.<\/p>\n<p>You will be given the blood types of N Kubudu dragons and the threshold K. Your task is to compute the size of the largest group of dragons from this collection that can safely be placed in the same cage.<\/p>\n<h3>Input<\/h3>\n<p>The ﬁrst line of input has two space separated integers N and K, where N is the number of Kubudu dragons and K is the threshold below which they ﬁght, as described above. The second line of input consists of N space separated integers, the blood types of the N dragons.<\/p>\n<h3>Output<\/h3>\n<p>A single integer, the size of the largest collection of dragons that can be safely placed in the same cage.<\/p>\n<p><strong>Test data<\/strong><br \/> In all cases, 1 ≤ N ≤ 10<sup>6<\/sup>. In 30% of the inputs, 1 ≤ N ≤ 5000. The blood types of the dragons lie in the range 1 to 10<sup>7<\/sup><br \/>  <\/p>\n<h3>\n<p>Example<\/p>\n<\/h3>\n<pre> \n<b>Sample Input:<\/b> \n12 3 \n1 5 6 1 8 3 12 2 13 7 9 11 \n\n<b>Sample Output:<\/b>\n 4<font face=\"sans-serif, Arial, Verdana, Trebuchet MS\"><span style=\"white-space: normal;\"> <\/span><\/font><\/pre>","languages_supported":"ADA, ASM, BASH, BF, C, C99 strict, CAML, CLOJ, CLPS, CPP 4.3.2, CPP 4.9.2, CPP14, CS2, D, ERL, FORT, FS, GO, HASK, ICK, ICON, JAVA, JS, LISP clisp, LISP sbcl, LUA, NEM, NICE, NODEJS, PAS fpc, PAS gpc, PERL, PERL6, PHP, PIKE, PRLG, PYTH, PYTH 3.4, RUBY, SCALA, SCM guile, SCM qobi, ST, TCL, TEXT, WSPC","max_timelimit":"1","source_sizelimit":"50000","problem_author":"yogesh01","problem_author_html_handle":"<span \n            class='rating' \n            style='display: inline-block; \n                    font-size: 10px; \n                    background: #684273;\n                    padding: 0 3px; \n                    line-height: 1.3; \n                    color: white;\n                    margin-right: 2px;'>4&#9733;<\/span><span>yogesh01<\/span>","problem_tester":null,"problem_tester_html_handle":"","date_added":"26-12-2014","tags":"<a class='problem-tag-small ' href='\/tags\/problems\/yogesh01'>\n                    yogesh01\n                <\/a>","user":{"username":null},"time":{"view_start_date":1422636277,"submit_start_date":1422636277,"visible_start_date":1422635400,"end_date":1735669800,"current":1493556895},"todo":false,"problem_status":"unattempted"}